{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI config with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report confirming that the 'New Case' button restoration in CasesListView.tsx is implemented with high confidence, referencing REQ-1 test ID.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, utilities, and types.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart colors, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, setting the app title, favicon, viewport meta tags, PWA manifest link, and mounting the React app at the root div.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, display mode, theme colors, and icon assets in multiple sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of app shell assets, runtime caching of static files, and exclusions for authentication and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication state, view navigation (Dashboard/Cases/Settings), sticky header with logo, and rendering ProfileSetupModal and view components with case highlight/scroll support.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity that clears the React Query cache on logout and handles already-authenticated edge cases.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that collects a name and saves it via the useSaveCallerUserProfile mutation, blocking dismissal until submitted.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist items (discharge notes, labs, imaging, etc.) for surgery cases and exports utility functions to get default selections, remaining/completed task counts, and Tailwind color classes.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Renders a collapsible card for a surgery case showing patient info (species icon, name, MRN, sex, age) and checklist task status, with optional edit and task-click callbacks.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog for editing an existing surgery case's fields (patient info, dates, checklist tasks) that submits updates via the useUpdateCase mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog for creating a new surgery case with form validation, speech-to-text quick-fill, debounced previous-case search, and checklist task selection, submitting via useCreateCase.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Displays a filterable, searchable, and sortable list of surgery case cards with controls for species, task type, completion status, sort order, CSV import/export, and new case creation.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a search icon and a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control that allows the user to choose a sort option for the cases list using predefined SORT_OPTIONS.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering surgery cases by species (canine, feline, other) with checkboxes, persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and completion status, with sessionStorage persistence for filter state.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist UI component that supports two modes—creation (toggling task selection) and completion (toggling task completion)—rendering colored checkbox items from CHECKLIST_ITEMS.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, handling parsing errors, progress tracking, and create/update mutations via React Query hooks.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, with blur validation and auto-advance on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Utility module for exporting surgery cases to CSV and importing/parsing CSV files back into case data structures, including field validation and matching against existing cases.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema for veterinary surgery case import/export, including column headers, row type, validation constants for species/sex/boolean values, and a date format regex.",
  "frontend/src/features/cases/filtering.ts": "Provides functions to filter surgery cases by species, by incomplete task types, by all-tasks-completed status, and to exclude fully completed cases.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the Web Speech Recognition API to provide recording state, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object, mapping recognized field labels to typed values including dates, species, and sex.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML table report of surgery cases with remaining checklist tasks, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a timestamped CSV report of surgery cases including remaining tasks, using browser Blob and anchor-click download.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides utility functions to format case data (dates, species, sex, text) into human-readable strings for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides utility functions to format case data (dates, species, sex) into human-readable strings for CSV/report display, mirroring pdfFormatters.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a search query, matching against basic fields and remaining (selected but incomplete) checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for an AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or open task count.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options, and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and date parsing/formatting utilities, including conversion between Date objects and nanosecond bigints.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Renders the main dashboard with active case cards, stats (active cases and open tasks), and controls for searching, filtering by species/tasks, and sorting.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Provides utilities to extract open task items from individual cases and calculate the total open task count across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Renders a settings page where users can configure and save an OpenAI API key, with status indicators for whether AI analysis is currently enabled.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by a configurable delay, returning the debounced version to reduce rapid updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend actor calls including user profiles, admin checks, OpenAI config, and surgery case CRUD operations.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light mode colors, including custom variables for patient name, species, complaint, and notes fields.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration mapping OKLCH CSS variables to semantic color tokens, extending theme with custom fonts, border radii, and enabling animate and typography plugins.",
  "project_state.json": "Project state metadata for SurgiPaw describing pending fix requests to restore the 'New Case' button and CaseFormDialog functionality that were lost during a revert from version 77."
}