{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding source files, components, and test IDs, covering the weekly calendar view, navigation, toggle, case cards, and day columns.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-sentence summaries of every frontend source file, used as a build-planning reference for the React/TypeScript frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "HTML shell for the SurgiPaw PWA, referencing the app icon, web manifest, theme color meta tags, and the Vite entry script.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, standalone display mode, theme colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy that precaches the app shell on install, cleans old caches on activate, and caches static assets at runtime while skipping auth and API requests.",
  "frontend/src/App.tsx": "Root React component managing authentication state, top-level navigation between Dashboard and Cases views, sticky header with nav buttons, and the first-time profile setup modal.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG icon component for the Culture workflow task, rendering three small circles inside a larger circle using the culture workflow color token.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG icon component for the Discharge Notes workflow task, rendering a document rectangle with a checkmark polyline using the discharge workflow color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "Renders a follow-up workflow icon using WorkflowIconBase with a circular arrow SVG path in cyan color.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a histology workflow icon using WorkflowIconBase with a microscope-like SVG in purple color.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging icon as a grayscale PNG image of an x-ray bone at 24x24 pixels.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a labs workflow icon using WorkflowIconBase with a test tube SVG in orange color.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a PDVM-notified workflow icon using WorkflowIconBase with a speech bubble SVG in yellow color.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a surgery report workflow icon using WorkflowIconBase with a scalpel/document SVG in red color.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Maps task type strings to their corresponding icon components and renders the appropriate workflow icon for a given type prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component that applies consistent size, stroke color, and stroke style for all workflow icons.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Exports shared design tokens for workflow icons including color values per task type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves it as their profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/validation.ts": "Empty file; no content provided.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist item configuration for surgery case tasks and provides utility functions to get default selections, remaining items, and task colors.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact expandable card for displaying a surgery case in a calendar view, with task completion toggling and case deletion support.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; no content provided.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying full surgery case details, workflow task icons, checklist editing, and delete functionality with highlight/scroll support.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog form for editing all fields of an existing surgery case including patient info, dates, and task checklist selections.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog component for creating new surgery cases, featuring a form with fields for patient info, a quick-fill text parser, speech recognition input, and checklist task selection.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases, combining search, species/task filters, sorting, and rendering filtered case cards, with loading/error/unauthenticated states handled.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), with selection state persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by pending task types and completed status, with state persisted to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a checklist of selected tasks for a surgery case, allowing toggling of individual task completion states with icons and strikethrough styling.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component that handles CSV export of all cases and CSV import with progress tracking, error reporting, and backend create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A React date input component that supports both manual MM/DD/YYYY text entry with auto-formatting and a calendar popover picker, forwarding refs and calling an optional onComplete callback when a valid date is entered.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides exportCasesToCsv and importCasesFromCsv functions for serializing SurgeryCase records to a CSV file and parsing/validating CSV rows back into case data with per-row error reporting.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript row type, and validation constants for species, sex, boolean, and date formats.",
  "frontend/src/features/cases/filtering.ts": "Exports pure functions to filter SurgeryCase arrays by species, by selected task types, by cases with remaining incomplete tasks, and by cases where all tasks are completed.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the Web Speech API to provide start/stop recording controls, accumulated transcript state, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Exports preprocessOcrText, which normalizes whitespace, corrects common OCR character errors, and removes artifacts from raw OCR text output as a preprocessing step.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Exports parseStructuredText, which parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to typed values including dates, species, and sex.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with outstanding tasks by writing HTML into a hidden iframe and triggering the browser's native print dialog.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV file containing all surgery cases with their remaining checklist tasks, using browser Blob/URL APIs.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for converting dates (bigint nanoseconds), Species enums, and Sex enums into human-readable strings for PDF output.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions identical in purpose to pdfFormatters but scoped for CSV report output, converting dates, Species, and Sex values to readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against patient/owner fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that orders surgery cases by arrival date or number of open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constant option arrays for species and sex dropdowns, and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields (MRN, pet name, owner name, breed) and date parsing/formatting utilities supporting MM/DD/YYYY, M/D/YYYY, and ISO formats.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that fetches and displays surgery cases with filtering, sorting, searching, and toggling between a calendar view and list view, plus PDF export and new case creation.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "React component that renders a 7-column weekly calendar grid with navigation controls, displaying surgery cases grouped by day using CalendarCaseCard components.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the weekly calendar including generating week day arrays, filtering cases by day, converting bigint timestamps to dates, and formatting week range strings.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions that extract and count open (remaining) checklist tasks from surgery cases, returning structured OpenTaskItem objects.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no content, likely a placeholder for a settings view component.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by a configurable delay (default 500ms) using setTimeout, returning the debounced value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication via a React context, exposing login/clear functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including user profiles, surgery cases, tasks, dashboard data, and OpenAI config via the ICP actor.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light-mode CSS custom property tokens for colors, with dark mode overridden to also use light theme values.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file, likely a placeholder for jspdf-autotable type definitions.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file, likely a placeholder for jspdf type definitions.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file for the tesseract.js OCR library, defining interfaces for Worker, RecognizeResult, Logger, and related types, plus PSM and OEM enums.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, typography, border radius variables, and enables the animate and typography plugins.",
  "project_state.json": "Project state metadata for SurgiPaw, a veterinary case management app, tracking existing features and a pending feature request to add a weekly calendar view to the Dashboard."
}