{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases and user profiles, with authorization checks via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two PWA-related features: adding the mobile-web-app-capable meta tag to index.html and fixing the PWA manifest icon to use properly sized PNG files instead of an .ico reference.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing the purpose and key details of each component, hook, utility, and type definition in the frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, including meta tags for mobile web app capability, theme color, Apple touch icon, and a link to the PWA manifest.",
  "frontend/public/manifest.json": "PWA manifest for SurgiPaw specifying app name, display mode, theme colors, and two PNG icon entries (192x192 and 512x512) for installation.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of app shell assets on install, old cache cleanup on activate, and runtime caching of static assets while skipping auth and API requests.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky header with login/logout controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component for the Culture task, rendering a petri-dish shape with optional completed state styling via WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "SVG workflow icon component for the Daily Summary task, rendering a tear-off calendar page with binding holes and a date number.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon component for the Discharge Notes task, rendering a document with a checkmark using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG workflow icon component for the Follow-Up task, rendering a circular arrow (refresh/history) icon using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a sun/radial SVG icon for the 'Histo' workflow step using WorkflowIconBase with the histo color token.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging icon using a grayscale X-ray bone image, with an optional X overlay SVG when the step is completed.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a flask/beaker SVG icon for the 'Labs' workflow step using WorkflowIconBase with the labs color token.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a speech bubble SVG icon for the 'PDVM Notified' workflow step using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a document-with-plus SVG icon for the 'Surgery Report' workflow step using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that maps a workflowType string to the corresponding workflow icon component.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper for workflow icons that applies consistent sizing and stroke tokens, and overlays an X when isCompleted is true.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons: per-type colors, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; no implementation present.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; no implementation present.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; no implementation present.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; no implementation present.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; no implementation present.",
  "frontend/src/features/auth/validation.ts": "Empty file; no implementation present.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration array for all workflow task types and provides helper functions to derive task selections, remaining items, and colors from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact card component for calendar views that displays a surgery case's species icon, pet name, and clickable workflow icons that toggle task completion.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; no implementation present.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component for a surgery case showing patient details, workflow task icons with toggle support, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog form for editing all fields of an existing surgery case including patient info, dates, species/sex, and checklist task selections.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog form component for creating new surgery cases, with fields for patient info, species, sex, dates, and selectable task options. Submits data via the useCreateCase mutation hook.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases, handling fetching, filtering by species/tasks/search, sorting, and rendering CaseCard components. Also provides access to case creation and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing the sort order of the cases list, using predefined SORT_OPTIONS.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), with selections persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by pending task types and a completed-tasks toggle, with state persisted to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders the selected checklist tasks for a case as clickable icon buttons that toggle task completion status.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component that handles exporting cases to CSV and importing cases from a CSV file, creating or updating backend records with progress tracking and error reporting.",
  "frontend/src/features/cases/components/DateField.tsx": "A React component that renders a date input field with MM/DD/YYYY auto-formatting, validation, and a calendar popover picker. Supports auto-advancing to the next field on completion and exposes the input ref via forwardRef.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides export and import functions for surgery cases in CSV format, handling serialization of dates and booleans, CSV parsing with quoted fields, and row-level validation with error reporting.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript row type, and validation constants for species, sex, boolean, and date formats.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks using checklist metadata.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the Web Speech API to provide speech-to-text recording with state for transcript, recording status, errors, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1), and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object, mapping recognized field labels to typed values including dates, species, sex, and string fields.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with incomplete tasks by writing HTML into a hidden iframe and triggering the browser's native print dialog.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV file of all surgery cases including remaining tasks, using browser Blob/URL APIs.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting dates (bigint nanoseconds), species, sex enums, and task lists into human-readable strings for PDF output.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting dates, species, and sex enums into readable strings for CSV report output, mirroring pdfFormatters.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a text query, matching against case fields and incomplete checklist item labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that orders surgery cases by arrival date or number of open tasks.",
  "frontend/src/features/cases/types.ts": "Defines species/sex option constants and the CaseFormData interface used for surgery case form state.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and date parsing/formatting utilities supporting MM/DD/YYYY, M/D/YYYY, and ISO formats, plus bigint nanosecond conversions.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that fetches, filters, sorts, and displays surgery cases in either a calendar or list view, with controls for search, species/task filters, sorting, and PDF export.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "A React component that renders a 7-column weekly calendar grid with navigation controls, displaying surgery cases grouped by day using CalendarCaseCard components.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the weekly calendar including generating week day arrays, filtering cases by day, formatting week range strings, and checking if a week is the current week.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions that extract and count open (remaining) checklist tasks from surgery cases, returning structured OpenTaskItem objects.",
  "frontend/src/features/settings/components/SettingsView.tsx": "An empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "A generic React hook that debounces a value by a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, surgery cases, tasks, dashboard data, and configuration.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light-mode CSS custom properties (design tokens) for colors, borders, and semantic UI variables; dark mode is intentionally kept identical to light mode.",
  "frontend/src/lib/utils.ts": "Exports a cn utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable type augmentation.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf type augmentation.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file for the tesseract.js OCR library, defining interfaces for Worker, RecognizeResult, Logger, and enums for PSM and OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH-based color tokens, extended font and border-radius settings, and the animate and typography plugins.",
  "project_state.json": "Project state snapshot for a veterinary case management app, tracking implemented features, architectural notes, known issues, and current development focus around dashboard views and task defaults."
}