{
  "backend/main.mo": "Main Motoko actor defining the SurgiPaw backend with types for surgery cases, tasks, and user profiles, plus CRUD operations for cases and user profiles with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping four UI feature requests (compact cards, relocated New Case button, species icons, and completed-case search inclusion) to their relevant frontend files and test IDs.",
  "frontend-file-summaries.txt": "Cached one-to-two sentence summaries of every frontend source file, describing each component's purpose, key props, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "HTML shell for the SurgiPaw PWA, setting up favicons, manifest, Apple web-app meta tags, and mounting the React app at the root div.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, theme color, standalone display mode, and 192×192/512×512 icon references.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy that precaches the app shell on install, cleans old caches on activate, and caches static assets at runtime while skipping auth and API requests.",
  "frontend/src/App.tsx": "Root React component rendering the sticky navigation header with the '+ New Case' button and Dashboard/Cases/Settings nav, managing view state, case creation dialog, and profile setup modal for authenticated users.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content; likely a placeholder for an authentication context.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content; likely a placeholder for an authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, handling login, logout, and query cache clearing.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves their profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) for surgery cases and provides utility functions to compute task completion counts, remaining items, and Tailwind color classes.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a collapsible card for a surgery case showing patient info, species icon, and an interactive checklist for toggling task completion.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating a new surgery case with fields for patient details, checklist selection, quick-fill text parsing, and speech recognition support.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Renders a filterable, searchable, and sortable grid of surgery case cards with controls for species, task type, completion status, and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing the sort order of the cases list.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component for selecting one or more species to filter cases, with state persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types, persisting selections to sessionStorage. Displays checkboxes for each checklist item and a badge showing the active filter count.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that supports two modes: 'creation' (toggling which tasks are selected) and 'completion' (toggling which selected tasks are done). Renders colored checkbox items from CHECKLIST_ITEMS.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error display, and create/update backend mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, with blur validation and auto-advance on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides exportCasesToCsv and importCasesFromCsv functions for serializing/deserializing surgery cases to/from a 17-column CSV format, including field parsing and duplicate detection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema constants, headers, TypeScript types, and validation values (species, sex, boolean formats) for the veterinary surgery case import/export format.",
  "frontend/src/features/cases/filtering.ts": "Provides functions to filter surgery cases by species, by incomplete task types, by all tasks completed, or by having at least one incomplete task.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "React hook that wraps the browser Web Speech API to provide speech-to-text recording with state for transcript, recording status, errors, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l), and removing artifacts like pipes and excessive dashes.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object, mapping recognized field labels to typed values including species, sex, dates, and string fields.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML table report of surgery cases with remaining tasks, using a hidden iframe without external PDF libraries.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV file of surgery cases including remaining checklist tasks, using browser Blob/URL APIs without external dependencies.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting Time (bigint nanoseconds), Species, and Sex enum values into human-readable strings for PDF display, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting Time (bigint nanoseconds), Species, and Sex enum values into human-readable strings specifically for CSV report output.",
  "frontend/src/features/cases/search.ts": "Filters an array of SurgeryCase objects by a search query, matching against basic case fields and selected-but-incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for an AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or open task count.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options, and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for date parsing, formatting, and conversion between Date objects and nanosecond timestamps.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Renders the main dashboard with a filterable, searchable, sortable grid of CaseCard components, plus a PDF export button.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Provides utilities to extract open task items from a single case and calculate the total open task count across multiple cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Renders a settings page for configuring the OpenAI API key, showing validation status and allowing the user to save a new key.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that returns a debounced version of a given value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, creating, and updating surgery cases, as well as user profiles and OpenAI config, using a backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a light-blue-themed OKLCH design token system for the app, with dark mode locked to light values.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for PSM/OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration mapping OKLCH CSS variables to semantic color tokens, extending fonts, border radii, and enabling the animate and typography plugins.",
  "project_state.json": "Project state manifest for SurgiPaw tracking existing features, pending UI improvement requests (smaller cards, nav button move, species icons, search enhancements), and architectural metadata."
}