{
  "backend/main.mo": "Main Motoko actor defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for veterinary surgery cases, user profiles, and OpenAI config, with role-based access control via MixinAuthorization and state migration support.",
  "backend/migration.mo": "Migration module that upgrades actor state by adding the new `followUpSelected` and `followUpCompleted` fields to existing SurgeryCase Task records, defaulting both to false.",
  "feature_evidence.json": "Feature evidence report linking the 'Follow Up' checklist item addition (with aqua color token) in checklist.ts to test ID REQ-2 with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing the app manifest, favicon, and the React app's main.tsx module entry.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw defining app name, display mode, theme colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of app shell assets, runtime caching of static files, and exclusions for auth and API calls.",
  "frontend/src/App.tsx": "Root React component handling authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky app header with login controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component for the Culture task type, rendering three small circles inside a larger circle using the culture workflow color token.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon component for the Discharge Notes task type, rendering a document with a checkmark using the discharge workflow color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG workflow icon component for the Follow Up task type, rendering a circular arrow using the followup workflow color token.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a histology workflow icon using WorkflowIconBase with purple color and SVG paths representing a microscope/circle motif.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging workflow icon as a grayscale PNG image of an X-ray bone icon at 24x24 pixels.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a labs workflow icon using WorkflowIconBase with orange color and SVG paths representing a test tube.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a notification workflow icon using WorkflowIconBase with yellow color and an SVG speech bubble path.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a surgery report workflow icon using WorkflowIconBase with red color and SVG paths depicting a surgical instrument on a document.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Maps task type strings to their corresponding icon components and renders the appropriate icon based on a given type prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component for workflow icons that applies consistent sizing, stroke color, and stroke styling to child SVG elements.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Exports shared design tokens for workflow icons including a color map per workflow type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file intended to define an authentication context.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file intended to define an authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity authentication, toggling between login and logout actions and clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file intended to define a login form component.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file intended to define a logout button component.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves the profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file intended to define a registration form component.",
  "frontend/src/features/auth/validation.ts": "Empty file intended to hold authentication-related validation logic.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS array describing all workflow task types with their metadata, and exports helper functions to get default selections, remaining incomplete tasks, and task colors.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file intended to define a camera capture modal component.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying a surgery case's patient info, remaining workflow checklist items, and actions for editing, toggling task completion, and deleting the case.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog for editing an existing surgery case's fields and task checklist selections, converting dates between display strings and nanosecond timestamps before saving via a mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog for creating a new surgery case with form fields, checklist task selections, speech-to-text quick fill, and debounced previous-case lookup, submitting via a create case mutation.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component for surgery cases that handles fetching, filtering (species, tasks, search), sorting, and rendering case cards, along with controls for creating new cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button that allows users to search cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select component for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), with selection state persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and completion status, with filter state persisted to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a checklist of selected tasks for a surgery case, allowing toggling of task completion with visual strikethrough feedback.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Panel component that handles CSV export of all cases and CSV import with parsing, validation, progress tracking, and sequential backend create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, with blur validation and auto-advance on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides functions to export surgery cases to a CSV file and import cases from a CSV file, including row parsing, field validation, and error collection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript types, and validation constants for species, sex, and boolean values.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser's SpeechRecognition API to provide recording state, transcript accumulation, error handling, and start/stop controls.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to their corresponding typed values.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a styled HTML report of surgery cases that have at least one incomplete task, rendered inside a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and triggers a CSV download of all surgery cases, including patient details and remaining checklist tasks, with proper CSV escaping.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting dates, species, sex enums, and task lists into human-readable strings for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting dates, species, and sex enums into human-readable strings for CSV report output.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against patient fields and incomplete checklist item labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a function to sort surgery cases by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constant option arrays for species and sex dropdowns, and the CaseFormData interface for the case creation/edit form.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for converting between Date objects, nanosecond timestamps, and formatted date strings, plus species/sex parsing.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases with filtering, sorting, searching, and stats, and supports creating new cases.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open task items from a surgery case and calculate the total count of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that returns a debounced version of a given value, updating only after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, surgery cases, tasks, dashboard data, and OpenAI config using TanStack Query's useQuery and useMutation.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for the light-mode design system, including semantic color tokens for UI elements like complaints, notes, and species fields.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends the theme with Inter font and custom border radii, and registers the animate and typography plugins.",
  "project_state.json": "Project state tracking file for SurgiPaw describing current features, pending feature requests (including adding a 'Follow Up' task with aqua icon), and architectural notes about ICP canister storage."
}