{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw app defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles (Daily Summary task, navy blue color tokens, CalendarCaseCard enhancements) to their implementing files and associated test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, and utility module.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML shell for the SurgiPaw React SPA, configuring the app icon, PWA manifest link, theme color, and mounting the React root div.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, display mode, theme/background colors, and icon assets for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of the app shell on install, old cache cleanup on activate, and runtime caching of static assets while bypassing auth and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky header with login/logout controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG icon component for the Culture workflow task, rendering a petri dish with bacterial colonies using the culture workflow color token and supporting a completed/X-overlay state.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "Renders a calendar-style SVG icon for the Daily Summary workflow type, with optional completed state, using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "Renders a document-with-checkmark SVG icon for the Discharge Notes workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "Renders a circular-arrow SVG icon for the Follow Up workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a side-view microscope SVG icon for the Histo workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging icon using a grayscale PNG asset, overlaying an X mark SVG when the completed state is true.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a test tube SVG icon with liquid fill and bubble details for the Labs workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a speech-bubble SVG icon for the PDVM Notified workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a scalpel SVG icon for the Surgery Report workflow type using WorkflowIconBase.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that maps a workflowType string to the corresponding workflow icon component.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper for workflow icons that applies consistent size, stroke, and an optional X-mark overlay when isCompleted is true.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Exports shared design tokens for workflow icons including per-type colors, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; authentication context not yet implemented.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; authentication view component not yet implemented.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; login form component not yet implemented.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; logout button component not yet implemented.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; registration form component not yet implemented.",
  "frontend/src/features/auth/validation.ts": "Empty file; auth validation logic not yet implemented.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration for all workflow task types and exports helper functions to derive task selections, remaining items, and colors from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact card component for calendar views that displays a surgery case's pet info, complaint, and clickable workflow task icons with toggle-completion support.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; camera capture modal component not yet implemented.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying full surgery case details, workflow task icons with completion toggling, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog component for editing an existing surgery case, pre-populating form fields from the provided case data and submitting updates via the useUpdateCase mutation.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog component for creating a new surgery case, with form fields for patient details and task selection checkboxes, submitting via the useCreateCase mutation.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases, handling fetching, filtering by species/tasks/search, sorting, and rendering case cards along with controls for creating cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A select dropdown component for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task type and completion status, persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders the selected checklist tasks for a surgery case as clickable icon buttons that toggle task completion state.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component providing CSV import and export functionality for surgery cases, handling file parsing, progress tracking, and creating/updating cases via API mutations with toast notifications.",
  "frontend/src/features/cases/components/DateField.tsx": "A controlled date input component supporting manual MM/DD/YYYY entry with auto-slash insertion, validation, and a calendar popover picker.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides exportCasesToCsv and importCasesFromCsv functions for serializing surgery cases to CSV and parsing/validating CSV files back into structured case data with error reporting.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 18-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript row type, and validation constants for species, sex, boolean, and date formats.",
  "frontend/src/features/cases/filtering.ts": "Exports pure functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech API to provide start/stop recording, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Exports preprocessOcrText, which normalizes whitespace, corrects common OCR character errors, and removes artifacts from raw OCR text output.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured 'Label: Value' text line-by-line and maps recognized labels to CaseFormData fields, handling species, sex, dates, and string fields with voice input variations.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with incomplete tasks using a hidden iframe and the browser's native print dialog, with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases including remaining checklist tasks, with proper field escaping and a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF display, converting Time (bigint nanoseconds), Species, and Sex values to human-readable strings, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV reports, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a query string, matching against case fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines the CaseFormData interface and constant option arrays for species and sex dropdowns used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields, date parsing (MM/DD/YYYY, ISO), date-to-nanoseconds conversion, and Species/Sex enum parsing utilities.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases in either a weekly calendar or list view, with filtering, sorting, search, and a new case creation dialog.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "Weekly calendar React component that renders a 7-column grid of surgery cases grouped by arrival date, with week navigation controls.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the calendar view, including computing week day arrays, filtering cases by day, formatting week range strings, and checking if a week is current.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract and count remaining open checklist tasks across surgery cases, returning structured OpenTaskItem objects.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced version.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login, logout, and identity state via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including fetching/mutating surgery cases, user profiles, dashboard data, and tasks against the ICP canister actor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom property design tokens for light mode (colors, radius, semantic UI roles like complaint, notes, patient-name). Dark mode is intentionally locked to the same light values.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "React app entry point that mounts the root with QueryClientProvider, InternetIdentityProvider, and the top-level App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file, likely a placeholder for jspdf-autotable type augmentations.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file, likely a placeholder for jsPDF type augmentations.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for Worker, OCR results (blocks, lines, words), and enums for PSM/OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens (primary, secondary, destructive, chart, etc.), sets Inter as the default font, and registers the animate and typography plugins.",
  "project_state.json": "Project state metadata file tracking existing features and pending feature requests for the SurgiPaw app, including adding a Daily Summary task to the New Case form and calendar view improvements (last name display, larger text, smaller icons)."
}