{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw app defining types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two high-confidence features: auditing useQueries.ts for correct backend method calls and actor guards, and auditing DashboardView/CasesListView for proper data rendering and error handling.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, utilities, and types.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing the app icon, web manifest, and the main React module entry script.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, display mode, theme colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of the app shell, runtime caching of static assets, and exclusions for ICP API calls and Internet Identity flows.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky app header with login controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component for the culture task type, rendering three small circles inside a larger circle using the culture workflow color token.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon component for the discharge notes task, rendering a document with a checkmark using the discharge workflow color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG workflow icon component for the follow-up task, rendering a circular arrow using the followup workflow color token.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "SVG workflow icon component for the histopathology task, rendering a microscope-like shape using the histo workflow color token.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "SVG workflow icon component for the imaging task, rendering a framed chart/waveform using the imaging workflow color token.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a labs workflow icon using WorkflowIconBase with an orange color and a beaker-like SVG path.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a notification/chat bubble workflow icon using WorkflowIconBase with a yellow color.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a surgery workflow icon using WorkflowIconBase with a red color and a scalpel-like SVG shape.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Maps task type strings to their corresponding icon components and renders the appropriate workflow icon based on the provided type prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component for workflow icons that applies consistent sizing, stroke color, and style properties to its children.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons including colors per task type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file intended to define an authentication context.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file intended to define an authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Renders a login/logout button that uses Internet Identity authentication, handling login, logout, and in-progress states.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file intended to define a login form component.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file intended to define a logout button component.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves the profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file intended to define a registration form component.",
  "frontend/src/features/auth/validation.ts": "Empty file intended to contain authentication-related validation logic.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist items for surgery case tasks, along with helper functions to get default selections, remaining incomplete items, and task colors/icon classes.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file intended to define a camera capture modal component.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a collapsible card for a surgery case showing patient info, species icon, checklist task status, and actions for editing, completing tasks, and deleting the case.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog for editing an existing surgery case's details including patient info, dates, species, sex, notes, and task checklist selections.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog for creating a new surgery case with form fields, task checklist selections, speech-to-text quick fill, and auto-population from previous cases.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component for surgery cases that handles fetching, filtering (species, tasks, search), sorting, and rendering case cards, along with authentication/loading/error states and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for selecting species (canine, feline, other) to filter cases, with session storage persistence.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and completed status, with session storage persistence.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a checklist of selected tasks for a surgery case, allowing toggling of task completion with icons and strikethrough styling.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Panel component that handles CSV export of cases and CSV import with progress tracking, error reporting, and backend create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-formatting and a calendar popover picker, with auto-advance on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides functions to export surgery cases to a CSV file and import cases from a CSV file, including row parsing, validation, and error collection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including headers, column types, valid enum values, and format constants.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser's SpeechRecognition API to provide recording state, transcript accumulation, error handling, and start/stop controls.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to their corresponding typed values.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML report of surgery cases that have at least one incomplete task, with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and triggers a CSV download of all surgery cases, including patient details and remaining checklist tasks, with proper CSV escaping.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting dates, species, sex enums, and task lists into human-readable strings for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting dates, species, and sex enums into human-readable strings for CSV report output.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against patient fields and incomplete checklist item labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a function to sort surgery cases by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for converting between Date objects, nanosecond timestamps, and formatted date strings.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases with filtering, sorting, searching, and a new-case dialog, along with summary stats for open tasks and active cases.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open task items from a surgery case and calculate the total count of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that returns a debounced version of a given value, updating only after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, surgery cases, tasks, and dashboard data using TanStack Query.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for the light-mode design system, including semantic color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file providing full type definitions for the tesseract.js OCR library, including Worker, RecognizeResult, PSM, and OEM enums.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends typography and animation plugins, and sets Inter as the default font.",
  "project_state.json": "Tracks the current state of the SurgiPaw veterinary case management ICP app, documenting a recurring frontend data-fetching bug (V94-99) where surgery cases stored in canister stable storage fail to load on the Dashboard and Cases pages. Lists existing fix features and pending audit requests targeting backend Motoko actor, React Query hooks, actor initialization, and UI components."
}