{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI configuration with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing planned fixes for the Quick Fill text parser in parseStructuredText.ts, covering field boundary parsing for pet name/owner name, multi-word sex values, and date-of-birth recognition.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files describing the purpose and key functionality of each component, hook, utility, and feature module in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing favicons, a web manifest, Apple touch icons, and the main React module entry script.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, theme colors, display mode, and icon assets for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy that precaches the app shell on install, cleans old caches on activate, and caches static assets at runtime while skipping Internet Identity and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication state, view routing between dashboard/cases/settings, profile setup modal, dark-mode prevention, and navigation handlers for case selection and new case creation.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content, likely a placeholder for an authentication context module.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content, likely a placeholder for an authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, handling login, logout, and query cache clearing.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves their profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items for surgery case tasks and provides utility functions to compute task counts, remaining items, default selections, and Tailwind color classes.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case as a card with inline note editing, task checklist editing, and delete confirmation, using mutation hooks to persist changes.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating or editing a surgery case, featuring MRN-based auto-prefill, AI text parsing, speech recognition input, and checklist task selection.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view for surgery cases with search, species/task filtering, sorting, highlight-on-select scrolling, and controls to open the new case dialog.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing the sort order of the cases list.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering surgery cases by species, with checkboxes for each species option and session storage persistence.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering surgery cases by task types and completion status, with session storage persistence for filter state.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that supports two modes—creation (toggling task selection) and completion (toggling task completion)—rendering colored checkbox items from CHECKLIST_ITEMS.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, handling parsing errors, progress tracking, and create/update mutations for each imported case.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, with auto-advance on complete input.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides exportCasesToCsv and importCasesFromCsv functions to serialize surgery cases to CSV and parse CSV files back into case data with validation error reporting.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema for veterinary surgery case import/export, including column headers, TypeScript types, and validation constants for species, sex, boolean, and date formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filter functions for surgery cases by species, selected incomplete task types, all-tasks-completed status, and exclusion of fully completed cases.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser's SpeechRecognition API to provide recording state, transcript accumulation, error handling, and start/stop controls.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object, mapping recognized field labels to typed values including species, sex, dates, and string fields.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML table report of surgery cases with remaining checklist tasks, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a timestamped CSV report of surgery cases including remaining tasks, using browser Blob and anchor-click download without external dependencies.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides utility functions to format case data (dates, species, sex, task lists, and text truncation) for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides utility functions to format case data (dates, species, sex) for CSV/report display, nearly identical to pdfFormatters but scoped to CSV output.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a search query, matching against basic fields and remaining (selected but incomplete) checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for an AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function to sort SurgeryCase arrays by arrival date or number of open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for converting between Date objects and nanosecond bigints, plus date string parsing in multiple formats.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard UI component that displays, searches, filters, and sorts surgery cases, with support for task filtering, PDF export, and navigation to individual cases.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open task items from a single case and calculate the total open task count across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component that allows users to configure and save an OpenAI API key, displaying the current validation status of the key.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on surgery cases and related data (user profiles, tasks, OpenAI config) by calling backend actor methods.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a light-blue-themed design token system using OKLCH CSS custom properties for colors, with dark mode overridden to always use light theme.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends the theme with Inter font and custom border radii, and registers the animate and typography plugins.",
  "project_state.json": "Tracks the veterinary case management app's project state, including known issues with the Quick Fill from Text parser (field boundary misidentification, multi-word sex values, missing DOB parsing) and four corresponding fix feature definitions."
}