{
  "backend/main.mo": "Main Motoko actor defining data types (SurgeryCase, Task, Species, Sex) and backend logic for a veterinary surgery case management app, including CRUD operations for cases and user profiles with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (default arrival date, Daily Summary task, always-expanded CaseCard) to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated documentation file containing one- to two-sentence summaries of each frontend source file, describing their purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML shell for the SurgiPaw PWA, referencing the app icon, web manifest, theme color, and the React entry point script.",
  "frontend/public/manifest.json": "PWA web manifest for SurgiPaw defining app name, display mode, theme colors, and icon references for 192×192 and 512×512 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of the app shell, runtime caching of static assets, and cache cleanup on activation; skips caching for API calls and Internet Identity flows.",
  "frontend/src/App.tsx": "Root React component providing authenticated layout with a sticky header, Dashboard/Cases navigation, profile setup modal on first login, and routing to DashboardView or CasesListView.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component representing a culture task, rendering a petri dish with bacterial colonies and supporting an isCompleted overlay via WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "SVG workflow icon component representing the Daily Summary task, rendering a calendar page with date lines and supporting an isCompleted overlay via WorkflowIconBase.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "Renders a discharge notes workflow icon using WorkflowIconBase with a file/document SVG path and green color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "Renders a follow-up workflow icon using WorkflowIconBase with a circular arrow SVG representing a refresh/follow-up action.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a histology workflow icon using WorkflowIconBase with a side-view microscope SVG composed of multiple shapes.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging workflow icon using a grayscale X-ray bone PNG image, overlaying an X mark SVG when the task is completed.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a labs workflow icon using WorkflowIconBase with a test tube SVG including a liquid fill line and bubble dots.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a PDVM-notified workflow icon using WorkflowIconBase with a speech bubble SVG in yellow.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a surgery report workflow icon using WorkflowIconBase with a scalpel SVG including handle, blade, and guard details.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that maps a workflowType string to the corresponding specific workflow icon component.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base wrapper component for workflow icons that renders an SVG with consistent size and stroke settings, and overlays an X mark when isCompleted is true.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons including color values per workflow type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile via a mutation hook, blocking dismissal until submitted.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/validation.ts": "Empty file; no content provided.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration array for all workflow task types and provides utility functions to derive task selections, remaining items, and colors from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact card component for calendar view that displays a surgery case's species icon, pet name, complaint, and clickable workflow task icons with toggle-completion support.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; no content provided.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Detailed card component for a surgery case showing species, patient info, task workflow icons with toggle support, and edit/delete actions via dialog and confirmation.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog component for editing an existing surgery case, pre-populating form fields from the case data and submitting updates via the `useUpdateCase` mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog component for creating a new surgery case with patient details and task selection checkboxes, submitting the form via the `useCreateCase` mutation hook.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases that fetches all cases and applies search, species/task filtering, sorting, and renders case cards along with controls for creating new cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select component for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task type and a completed-tasks toggle, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders the selected checklist task items for a surgery case as clickable workflow icons that toggle completion state.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component providing CSV import and export functionality for surgery cases, handling file parsing, progress tracking, and creating/updating cases via API mutations with error reporting.",
  "frontend/src/features/cases/components/DateField.tsx": "A controlled date input component supporting manual MM/DD/YYYY entry with auto-formatting, validation, calendar popover selection, and auto-advance on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export (serializing SurgeryCase data to a downloadable file) and CSV import (parsing, validating, and mapping rows to case data structures with error collection).",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 18-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript row type, valid enum values, and format constants.",
  "frontend/src/features/cases/filtering.ts": "Provides pure functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech API to provide speech-to-text recording with transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Utility function that preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts, used as a fallback for cleaning AI-returned text.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured 'Label: Value' text line-by-line and maps recognized labels to CaseFormData fields, handling species, sex, dates, and string fields with voice input variations.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with incomplete tasks using a hidden iframe and the browser's native print dialog, with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases including remaining checklist tasks, with proper field escaping and a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF display, converting Time (bigint nanoseconds), Species, and Sex values to human-readable strings, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV reports, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a query string, matching against case fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines the CaseFormData interface and constant option arrays for species and sex used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields, date parsing (MM/DD/YYYY, ISO), date-to-nanoseconds conversion, and Species/Sex enum parsing utilities.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases in either a weekly calendar or list view, with filtering, sorting, search, and a new case dialog.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "Weekly calendar React component that renders a 7-column grid of surgery cases grouped by arrival date, with week navigation controls.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the calendar view: computing week day arrays, filtering cases by day, formatting week range strings, and checking if a week is current.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open (incomplete) checklist task items from surgery cases and count the total number of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated ICP backend actor using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced value after the delay elapses.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and persisting identity across page reloads via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for all backend data operations (cases, user profiles, dashboard, tasks, AI config), creating actors directly via createActorWithConfig to avoid a broken initialization call in useActor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for a light-blue themed design system, including tokens for backgrounds, foregrounds, charts, and domain-specific colors (patient name, species, complaint, notes). Dark mode is intentionally locked to light theme values.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file, likely a placeholder for jspdf-autotable type augmentations.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file, likely a placeholder for jsPDF type augmentations.",
  "frontend/src/types/tesseract.d.ts": "TypeScript module declaration for `tesseract.js`, defining interfaces for OCR workers, recognition results, bounding boxes, and enums for PSM and OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them to `sessionStorage`, and clean sensitive parameters from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and font family, and registers the `tailwindcss-animate` and `@tailwindcss/typography` plugins.",
  "project_state.json": "Project state manifest for SurgiPaw describing three pending fix requests: defaulting the arrival date to today, adding a Daily Summary task option, and making patient cards always-expanded with a rounded rectangle layout."
}