{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report identifying a single high-confidence fix needed in `frontend/src/hooks/useQueries.ts` to restore correct surgery case fetching for DashboardView and CasesListView.",
  "frontend-file-summaries.txt": "Cached summaries of all frontend source files describing each component's purpose, props, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML shell for the SurgiPaw Vite/React app with PWA meta tags, manifest link, favicon, and a root div mounting point.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, theme colors, display mode, and icon assets at multiple sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of app shell assets, runtime caching of static files, and bypass rules for auth and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky app header with login controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon for the Culture task type rendered via WorkflowIconBase with three small circles representing microbial growth.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon for the Discharge Notes task showing a document with a checkmark polyline.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG workflow icon for the Follow-Up task depicting a circular arrow with a corner polyline.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "SVG workflow icon for the Histopathology task showing a microscope-like shape with a circle and arc paths.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "SVG workflow icon for the Imaging task depicting a framed rectangle with a trend-line polyline.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "SVG workflow icon for the Labs task showing a test tube shape with a horizontal line.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "SVG workflow icon for the PDVM Notified task depicting a speech bubble with a tail.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "SVG workflow icon for the Surgery Report task showing a document with diagonal scalpel lines.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Maps task type strings to their corresponding icon components and renders the appropriate icon based on the provided type prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component for workflow icons that applies consistent size, stroke color, and style tokens to its children.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Exports shared design tokens for workflow icons including a color map per task type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file intended to define an authentication context for the application.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file intended to implement the authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file intended to implement a login form component.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file intended to implement a logout button component.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves the profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file intended to implement a user registration form component.",
  "frontend/src/features/auth/validation.ts": "Empty file intended to contain authentication-related validation logic.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist item configuration for surgery case tasks and provides utility functions to get default selections, remaining incomplete items, and task colors.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file intended to implement a camera capture modal component.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying surgery case details, remaining checklist tasks, and actions for toggling task completion, editing, and deleting a case.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog form for editing an existing surgery case's patient details, dates, and task checklist selections, submitting updates via a mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating a new surgery case with fields for patient info, task selections, speech-to-text quick fill, and auto-parsing of structured text input.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component for surgery cases that combines search, filtering (species, tasks), sorting, and pagination with loading/error/empty states, and includes buttons for creating new cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a search icon and a clear (X) button that calls an onChange callback as the user types.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing a sort option from the predefined SORT_OPTIONS list, displayed alongside an ArrowUpDown icon.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other) using checkboxes, with selection state persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and a 'show all tasks completed' toggle, with filter state persisted to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a checklist of selected task items for a given Task, allowing each item to be toggled complete/incomplete via checkboxes with workflow icons.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides CSV export and import functionality for surgery cases, handling file parsing, progress tracking, and calling create/update mutations for each imported case with error reporting via toasts.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY text entry with auto-slash insertion and a calendar popover picker, with blur validation and an onComplete callback for field auto-advance.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides functions to export surgery cases to a CSV file and import cases from a CSV file, including row parsing, field validation, and error collection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript types, and validation constants for species, sex, and boolean values.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser's SpeechRecognition API to provide recording state, transcript accumulation, error handling, and start/stop controls.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts to produce cleaner text for further parsing.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to their corresponding typed values.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a styled HTML report of surgery cases that have at least one incomplete task, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and triggers a CSV download of all surgery cases, including patient details and remaining checklist tasks, with proper CSV field escaping.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting dates, species, sex enums, and task lists into human-readable strings for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting dates, species, and sex enums into human-readable strings for CSV report output.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against patient/owner fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no implemented content.",
  "frontend/src/features/cases/sorting.ts": "Provides sort options and a function to sort surgery cases by arrival date or number of open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for converting between Date objects, nanosecond timestamps, and formatted date strings.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases with filtering, searching, sorting, and stats, and supports adding new cases.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open task items from a surgery case and calculate the total count of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor instance using the current Internet Identity, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that returns a debounced version of a given value, updating only after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (useQuery/useMutation) for all backend actor calls related to surgery cases, tasks, user profiles, dashboard data, and OpenAI config.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for the light-mode design system, including semantic color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends typography and animation plugins, and sets Inter as the default font.",
  "project_state.json": "Project state metadata for SurgiPaw tracking existing features, known issues (cases not loading on Dashboard/Cases page), and a pending fix request for DashboardView and CasesListView rendering."
}