{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI config with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two high-confidence features focused on restoring surgery case data rendering on the Dashboard and Cases list pages by fixing React Query hook wiring and prop passing.",
  "frontend-file-summaries.txt": "Aggregated one-line summaries of all frontend source files describing the purpose and key implementation details of each component, hook, utility, and type definition in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing the app icon, web manifest, theme color meta tags, and mounting the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, display mode, theme/background colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of the app shell on install, old cache cleanup on activate, and runtime caching of static assets while bypassing auth and API calls.",
  "frontend/src/App.tsx": "Root React component handling authentication state, navigation between Dashboard and Cases views, profile setup modal display, and sticky header with login button.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component for the Culture task type, rendering three small circles inside a larger circle using the culture workflow color token.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon component for the Discharge Notes task, rendering a document rectangle with a checkmark polyline using the discharge color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG workflow icon component for the Follow-Up task, rendering a circular arrow with a corner polyline using the followup color token.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "SVG workflow icon component for the Histopathology task, rendering a microscope-like shape using the histo color token.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "SVG workflow icon component for the Imaging task, rendering a framed chart/waveform shape using the imaging color token.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "SVG workflow icon component for the Labs task, rendering a test tube shape with a horizontal line using the labs color token.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a speech-bubble SVG icon for the 'notified' workflow state using WorkflowIconBase with the notified color token.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a scalpel/document SVG icon for the 'surgery' workflow state using WorkflowIconBase with the surgery color token.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Maps task type strings to their corresponding icon components and exports a WorkflowIcon component that renders the correct icon for a given type.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component that applies shared icon size, stroke width, and color to all workflow icons.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons including colors for each task type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file intended to hold an authentication context provider.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file intended to hold the authentication view component.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing loading state and clearing React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file intended to hold a login form component.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file intended to hold a logout button component.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves it as their profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file intended to hold a registration form component.",
  "frontend/src/features/auth/validation.ts": "Empty file intended to hold authentication-related validation logic.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration array for all surgical task types and exports helper functions to get default selections, remaining incomplete items, and color/icon metadata by workflow type.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file intended to hold a camera capture modal component.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying a surgery case's patient info, remaining checklist tasks, and actions for toggling task completion, editing, and deleting the case.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Dialog form for editing an existing surgery case's patient details, dates, and task checklist selections, submitting changes via the updateCase mutation.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating a new surgery case with fields for patient info, task selections, quick-fill text parsing, and optional speech recognition input.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component for surgery cases that combines search, filtering (species, tasks), sorting, and displays case cards with loading/error states. Manages all filter/sort state and computes the filtered/sorted case list via useMemo.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Controlled search input component with a search icon and a clear (X) button that resets the query when clicked.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing a sort option from the predefined SORT_OPTIONS list, displaying an ArrowUpDown icon alongside the selector.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component for selecting one or more species (canine, feline, other) using checkboxes, with selection state persisted to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "Popover filter component for filtering cases by incomplete task types and a 'show all tasks completed' toggle, with state persisted to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a checklist of selected task items for a given Task, allowing toggling of completion state via checkboxes with workflow icons and strikethrough styling.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Panel component providing CSV export of all cases and CSV import that creates or updates cases in the backend, with progress tracking and error reporting via toasts.",
  "frontend/src/features/cases/components/DateField.tsx": "Controlled date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, with blur validation and auto-advance on complete entry.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides functions to export surgery cases to a CSV file and import cases from a CSV file, including row parsing, validation, and error collection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers, TypeScript row type, and validation constants (valid species, sex, boolean, and date format) for veterinary surgery case import/export.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser Web Speech API to provide start/stop recording, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts to produce cleaner text for further parsing.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to their corresponding typed values.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a styled HTML report of surgery cases that have at least one incomplete task, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases, including patient details and remaining checklist tasks, with proper CSV escaping and a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF display, converting Time (bigint nanoseconds), Species, and Sex values to human-readable strings, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV report output, converting Time (bigint nanoseconds), Species, and Sex values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against patient/owner fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no implemented content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts surgery cases by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines constant option arrays for Species and Sex dropdowns, and the CaseFormData interface used for surgery case form state.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields (MRN, pet name, owner name, breed) and date conversion/parsing utilities between Date objects, nanoseconds, and MM/DD/YYYY strings.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "React component that renders the main dashboard, displaying surgery cases with search, filter, sort controls, summary stats, and a new case dialog, using React Query for data fetching.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open task items from a surgery case and calculate the total count of remaining tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced value after the delay has elapsed without changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state and persisting identity across page reloads using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on surgery cases, tasks, user profiles, dashboard data, and OpenAI config, all wired to the backend canister actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for the light-mode design system, including semantic color tokens for cards, complaints, notes, and species fields.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for tesseract.js, defining interfaces for OCR workers, recognition results, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and font family, and registers the animate and typography plugins.",
  "project_state.json": "Project state metadata for SurgiPaw describing a known bug where surgery cases render as a blank list on Dashboard and Cases pages after a v95 UI refactor, with two fix-request features targeting prop/query wiring issues."
}