{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw veterinary surgery case management app, defining types for cases, tasks, and user profiles, and exposing CRUD operations with role-based access control and data migration support.",
  "backend/migration.mo": "Data migration module that upgrades existing surgery case records by adding the new `dailySummarySelected` and `dailySummaryCompleted` fields (defaulting to false) to each case's task record.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles (e.g., removing surgery report default, adding Daily Summary task, updating workflow icons) to the specific frontend files and test IDs that implement them.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, serving as a reference document for the frontend codebase structure and recent changes.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, destructive, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, setting up the root div, app metadata, favicon, manifest link, and loading the main React module.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw defining the app name, display mode, theme colors, and icon assets at 192×192 and 512×512 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy that precaches the app shell on install, cleans old caches on activate, and caches static assets at runtime while skipping Internet Identity and API calls.",
  "frontend/src/App.tsx": "Root application component that handles authentication state, navigation between Dashboard and Cases views, and renders the header with login/logout controls and profile setup modal.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG icon component representing a culture petri dish with bacterial colonies, styled using the culture workflow color token.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "SVG icon component depicting a calendar/daily summary page with binding holes and text lines, using the dailySummary color token.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG icon component showing a document with a checkmark to represent discharge notes, using the dischargeNotes color token.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "SVG icon component depicting a circular refresh/follow-up arrow, using the followUp color token.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "SVG icon component representing a microscope for histology, using the histo color token.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Icon component for imaging that renders an x-ray bone image asset and overlays an X mark when the task is completed.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "SVG icon component depicting a laboratory flask/beaker for labs workflow, using the labs color token.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "SVG icon component showing a speech bubble to represent PDVM notification, using the pdvmNotified color token.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "SVG icon component depicting a scalpel to represent surgery reports, using the surgeryReport color token.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that renders the appropriate workflow icon component based on a workflowType string prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper component for workflow icons that applies consistent sizing, stroke styling, and an optional completed X overlay.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons including color values per workflow type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves it as their profile via a mutation.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist item configuration for all workflow task types and provides utility functions to filter selected, remaining, and completed checklist items from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Card component for displaying a surgery case in a calendar view, showing species icon, pet name, complaint, and interactive workflow task icons that can be toggled as completed.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Renders a collapsible card for a single surgery case, displaying patient info, species icon, workflow task icons, and supporting expand/collapse, task toggle, edit, and delete actions.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "Modal dialog for editing an existing surgery case, pre-populating all fields from the current case and submitting updates via the useUpdateCase mutation.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Modal dialog for creating a new surgery case, with form fields for patient details and task selections, submitting via the useCreateCase mutation.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view that fetches all surgery cases and renders them with search, species/task filters, sort controls, and options to add new cases or import/export CSV.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Controlled search input component with a clear button for filtering surgery cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component for selecting one or more species to filter the cases list, persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that lets users filter cases by task type and completion status, persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a row of clickable workflow icons for a case's selected checklist tasks, toggling their completed state on click.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides UI buttons to export cases to CSV or import cases from a CSV file, handling progress tracking and error reporting via toasts.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export (serializing SurgeryCase arrays to a downloadable file) and CSV import (parsing, validating, and mapping rows to case data with error collection).",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 18-column CSV schema for surgery case import/export, including headers, TypeScript row type, and validation constants for species, sex, booleans, and date format.",
  "frontend/src/features/cases/filtering.ts": "Provides pure functions to filter SurgeryCase arrays by species, task type selection, incomplete tasks, and fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the browser's Web Speech API to provide speech-to-text recording functionality, exposing state for recording status, transcript, errors, and browser support.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Exports a `preprocessOcrText` function that cleans raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text (e.g., from voice or OCR input) into a partial `CaseFormData` object by mapping recognized field labels to their corresponding typed values.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML report of surgery cases that have incomplete checklist tasks, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV file of all surgery cases including their remaining tasks, using browser Blob and anchor-click download mechanics.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for converting backend types (Time, Species, Sex) into human-readable strings for PDF display.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for converting backend types (Time, Species, Sex) into human-readable strings for CSV report display, mirroring pdfFormatters.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against case fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a `sortCases` function that sorts surgery cases by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines the `CaseFormData` interface and constant option arrays for species and sex dropdowns used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields (MRN, pet name, owner name, breed) and utility functions for date parsing/formatting and date-to-nanosecond conversions used with the backend.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that fetches all cases and dashboard data, applies filtering/sorting/search, and renders either a weekly calendar view or list view of surgery cases with stats and a new case dialog.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "Renders a 7-column weekly calendar grid with week navigation controls, displaying surgery cases grouped by their arrival date in each day column.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the weekly calendar view, including generating week day arrays, filtering cases by day, formatting week range strings, and checking if a week is the current week.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Provides functions to extract open (incomplete) checklist task items from surgery cases and calculate the total count of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a changing value by a configurable delay (default 500ms), returning the debounced value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, and exposing identity state and status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the ICP backend canister, covering user profiles, surgery cases, tasks, and dashboard data. Creates actors directly via `createActorWithConfig` to avoid a broken initialization call that previously caused a blank page.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines OKLCH-based CSS custom properties for the light-mode color theme, including semantic tokens for backgrounds, borders, charts, and domain-specific colors.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file intended to provide type augmentation for the jspdf-autotable library.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file intended to provide type augmentation for the jsPDF library.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration module for `tesseract.js`, defining interfaces and enums for OCR workers, recognition results, page segmentation modes, and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using `sessionStorage` for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends the theme with Inter font and custom border radii, and registers the `tailwindcss-animate` and `@tailwindcss/typography` plugins.",
  "project_state.json": "Project state manifest tracking the app's architecture, known issues, completed features, and pending feature requests for a clinical case management app built on the Internet Computer platform."
}