{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI config, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (presenting complaint display, color-coded task icons, PDF export) to their relevant source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing the purpose and key implementation details of each component, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing the app icon, manifest, theme color metadata, and the React app's main.tsx entry script.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw defining app name, display mode, theme colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets with precaching on install, old cache cleanup on activate, and bypass rules for API calls and Internet Identity flows.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky app header with logo and nav buttons.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, clearing the React Query cache on logout and retrying login if already authenticated.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name and saves the profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist items (discharge notes, labs, imaging, etc.) for surgery case tasks, along with utility functions to compute completion counts, remaining items, and styling helpers.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "A collapsible card component that displays surgery case details (patient info, species icon, sex, age) and its checklist task statuses with click handlers for task completion and editing.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog form for editing an existing surgery case, pre-populating all fields from the case data and submitting updates via the useUpdateCase mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog form for creating a new surgery case, featuring speech-to-text quick-fill, debounced previous-case search, checklist task selection, and validation before submitting via useCreateCase.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main cases list view that fetches all cases and applies search, species/task filters, sorting, and renders CaseCard components with support for highlighting a newly created case and exporting to PDF.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component for filtering cases by any field, with a clear button that appears when there is input.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for sorting cases, rendering options from a predefined SORT_OPTIONS list.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and completion status, persisting state to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist UI component that supports both creation mode (selecting which tasks to include) and completion mode (marking tasks as done), with color-coded task items.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking and error reporting during import.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-formatting and a calendar popover picker, with auto-advance on complete input.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides functions to export surgery cases to a CSV file and import cases from a CSV file, including row parsing, field validation, and error collection.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers, TypeScript row type, and validation constants (valid species, sex, boolean, and date format) for veterinary surgery case import/export.",
  "frontend/src/features/cases/filtering.ts": "Exports utility functions to filter surgery cases by species, incomplete task types, all-tasks-completed status, and to exclude fully completed cases.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "A React hook that wraps the Web Speech Recognition API to provide start/stop recording, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts to produce cleaner text for downstream parsing.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object by mapping recognized field labels to their corresponding typed values including dates, species, and sex.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with outstanding tasks by writing HTML into a hidden iframe and triggering the browser's print dialog. Only includes cases with at least one incomplete task, rendering them in a styled table with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV file of all surgery cases including remaining tasks, using browser Blob/URL APIs. Handles CSV field escaping and timestamps the filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF output, converting backend Time (bigint nanoseconds), Species, and Sex values to human-readable strings, plus text truncation and task list formatting helpers.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV report output, converting backend Time (bigint nanoseconds), Species, and Sex values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of surgery cases by a search query, matching against basic case fields and also against incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts surgery cases by arrival date (newest/oldest) or by number of open tasks (most/fewest).",
  "frontend/src/features/cases/types.ts": "Defines constant option arrays for species and sex dropdowns, and the CaseFormData interface used for case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields (MRN, pet name, owner name, breed) and date utility functions for parsing multiple date formats, converting between Date objects and nanosecond bigints, and formatting dates as MM/DD/YYYY.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that fetches all surgery cases, applies search/filter/sort logic, and renders case cards with stats, controls for filtering by species and task type, a new case dialog, and a PDF export button.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Provides utility functions to extract open task items from a single surgery case and to calculate the total count of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay (default 500ms), returning the debounced value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for React, exposing login/logout functions, identity state, and login status via a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profiles, admin checks, OpenAI config, and surgery case CRUD operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a light-mode-only OKLCH-based design token system for colors, borders, and custom semantic variables.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file providing full type definitions for the tesseract.js OCR library, including Worker, RecognizeResult, PSM, and OEM enums.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends the theme with custom fonts and border radii, and registers animation and typography plugins.",
  "project_state.json": "Tracks project state including version, summary, existing features, and new feature requests for a case management dashboard app. Contains three main features: presenting complaint display, color-coded task icons, and PDF export functionality."
}