{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI config with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two high-confidence features related to reverting and auditing data-fetching logic in useQueries.ts and actor wiring between frontend and backend.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, hooks, types, utilities, and CSV handling across the SurgiPaw frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing the app manifest, icons, and loading the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw specifying app name, display mode, theme colors, and icon assets at 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy with precaching of app shell assets, runtime caching of static files, and exclusions for auth flows and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky header layout.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "SVG workflow icon component for the Culture task, rendering a database/cylinder shape with optional completed-state styling.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "SVG workflow icon component for the Daily Summary task, rendering a tear-off calendar with binding holes and a date number.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "SVG workflow icon component for the Discharge Notes task, rendering a document with a checkmark and optional completed-state styling.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "Renders a follow-up workflow icon using WorkflowIconBase with a refresh/clock SVG path and the followUp color token.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a histology workflow icon using WorkflowIconBase with a sun/radial SVG path and the histo color token.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an imaging workflow icon using a grayscale X-ray bone image, with an optional X overlay when completed.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a labs workflow icon using WorkflowIconBase with a flask SVG path and the labs color token.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a PDVM-notified workflow icon using WorkflowIconBase with a speech-bubble SVG path and the pdvmNotified color token.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a surgery report workflow icon using WorkflowIconBase with a document/plus SVG path and the surgeryReport color token.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that maps a workflowType string to the corresponding specific workflow icon component.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper for workflow icons that applies consistent size and stroke styling, and overlays an X when isCompleted is true.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Defines shared design tokens for workflow icons: color values per workflow type, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/validation.ts": "Empty file; no content provided.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration array for all workflow task types and provides helper functions to derive task selections, remaining items, and colors from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact card component for calendar views that displays a surgery case's species icon, pet name, complaint, and toggleable workflow task icons.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; no content provided.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component for a surgery case showing patient details, workflow task toggle icons, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog component for editing an existing surgery case, pre-populating form fields from the case data and submitting updates via the `useUpdateCase` mutation hook.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog component for creating a new surgery case with fields for patient info, species, sex, and task selections, submitting via the `useCreateCase` mutation hook.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases, handling fetching, filtering by species/tasks/search, sorting, and rendering case cards along with controls for creating cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select component for choosing the sort order of the cases list using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task type and completion status, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders the selected checklist tasks for a surgery case as toggleable icon buttons, visually indicating completed tasks with strikethrough and reduced opacity.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component providing CSV import and export functionality for surgery cases, handling file parsing, progress tracking, error display, and backend create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A controlled date input component supporting MM/DD/YYYY keyboard entry with auto-slash insertion, blur validation, and a calendar popover picker.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export (serializing SurgeryCase arrays to a downloadable file) and CSV import (parsing, validating rows, and matching against existing cases) for surgery cases.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery case import/export, including column headers, TypeScript row type, and validation constants for species, sex, boolean, and date formats.",
  "frontend/src/features/cases/filtering.ts": "Provides pure functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech API to provide start/stop recording, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Utility that preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured 'Label: Value' text line-by-line and maps recognized labels to CaseFormData fields, handling species, sex, dates, and string fields with voice input variations.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with incomplete tasks using a hidden iframe and the browser's native print dialog, with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases including remaining checklist tasks, with proper field escaping and a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF display, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings, plus text truncation.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV report output, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a query string, matching against case fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines the CaseFormData interface and constant option arrays for species and sex dropdowns used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields, date parsing (MM/DD/YYYY, ISO), date-to-nanoseconds conversion, and Species/Sex enum parsing utilities.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases in either a weekly calendar or list view, with filtering, sorting, search, and a new case creation dialog.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "Weekly calendar React component that renders a 7-column grid of surgery cases grouped by arrival date, with week navigation controls.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the calendar view, including computing week day arrays, filtering cases by day, formatting week range strings, and checking if a week is the current one.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract and count remaining open checklist tasks across surgery cases, returning structured OpenTaskItem objects.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using TanStack Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced result.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login, logout, and identity state via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for all backend data operations including cases, user profiles, tasks, and dashboard data, using a direct actor factory that bypasses the broken initialization call in useActor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for a light-blue themed design system, with tokens for colors, radius, and semantic UI elements like complaints and notes.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "React app entry point that renders the root component wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file intended for jspdf-autotable type augmentation.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file intended for jsPDF type augmentation.",
  "frontend/src/types/tesseract.d.ts": "TypeScript ambient module declaration for `tesseract.js`, defining interfaces for workers, OCR results, bounding boxes, and enums for PSM and OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and font family, and registers the `tailwindcss-animate` and `@tailwindcss/typography` plugins.",
  "project_state.json": "Project state metadata file tracking known issues (blank page due to broken data-fetching), existing fix features, and a pending action request to diagnose the backend actor and revert data-fetching logic to Version 107."
}