{
  "backend/main.mo": "Main Motoko actor defining data types (SurgeryCase, Task, Species, Sex) and backend logic for a veterinary surgery case management app, including CRUD operations for cases, user profiles, and authorization via mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to the frontend files and components they affect, along with test IDs and confidence levels for build/verification planning.",
  "frontend-file-summaries.txt": "Structured text file containing short summaries of each frontend source file, describing their purpose, key exports, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw React app, referencing the app icon, PWA manifest, and mounting the React root via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw defining app name, display mode, theme colors, and icon assets at multiple resolutions.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of app shell assets, runtime caching of static files, and exclusions for auth and API calls.",
  "frontend/src/App.tsx": "Root React component handling authentication state, navigation between Dashboard and Cases views, profile setup modal display, and the sticky app header with login controls.",
  "frontend/src/components/workflow-icons/IconCulture.tsx": "React component rendering a culture workflow icon (ellipse/cylinder SVG) using WorkflowIconBase with optional completed-state X overlay support.",
  "frontend/src/components/workflow-icons/IconDailySummary.tsx": "Renders a calendar/tear-off page SVG icon for the Daily Summary workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconDischarge.tsx": "Renders a document-with-checkmark SVG icon for the Discharge Notes workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconFollowUp.tsx": "Renders a circular-arrow SVG icon for the Follow Up workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconHisto.tsx": "Renders a sun/radial SVG icon for the Histo workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconImaging.tsx": "Renders an x-ray bone image icon for the Imaging workflow type, overlaying an X mark when completed.",
  "frontend/src/components/workflow-icons/IconLabs.tsx": "Renders a flask/beaker SVG icon for the Labs workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconNotified.tsx": "Renders a speech-bubble SVG icon for the PDVM Notified workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/IconSurgery.tsx": "Renders a document-with-plus SVG icon for the Surgery Report workflow type, with optional completed state.",
  "frontend/src/components/workflow-icons/WorkflowIcon.tsx": "Dispatcher component that renders the correct workflow icon component based on a workflowType string prop.",
  "frontend/src/components/workflow-icons/WorkflowIconBase.tsx": "Base SVG wrapper for workflow icons that applies consistent sizing, stroke color, and an X overlay when isCompleted is true.",
  "frontend/src/components/workflow-icons/workflowTokens.ts": "Exports shared design tokens for workflow icons: per-type colors, icon size, and stroke width.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile via a mutation hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file; no content provided.",
  "frontend/src/features/auth/validation.ts": "Empty file; no content provided.",
  "frontend/src/features/cases/checklist.ts": "Defines the CHECKLIST_ITEMS configuration array for all workflow task types and exports helper functions to derive task selections, remaining items, and colors from a Task object.",
  "frontend/src/features/cases/components/CalendarCaseCard.tsx": "Compact card component for calendar views that displays a surgery case's pet info and clickable workflow icons for toggling task completion.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file; no content provided.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Expandable card component displaying full surgery case details, workflow task icons with toggle support, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseEditDialog.tsx": "A dialog component for editing an existing surgery case, pre-populating form fields from the provided case data and submitting updates via the useUpdateCase mutation.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog component for creating a new surgery case with fields for patient info, species, sex, dates, and task checklist selections, submitting via the useCreateCase mutation.",
  "frontend/src/features/cases/components/CasesListView.tsx": "The main list view for surgery cases that fetches all cases and applies search, species/task filtering, sorting, and renders case cards along with controls for creating cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing the sort order of the cases list, using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for filtering cases by species (canine, feline, other), persisting selections to sessionStorage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by pending task types and a completed-tasks toggle, persisting state to sessionStorage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders the selected checklist tasks for a surgery case as clickable icon buttons that toggle task completion state.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component that provides CSV import and export functionality for surgery cases, handling file parsing, progress tracking, error display, and backend create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A controlled date input component supporting MM/DD/YYYY keyboard entry with auto-slash insertion, blur validation, and a calendar popover picker.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export (serializing SurgeryCase arrays to a downloadable file) and CSV import (parsing, validating, and mapping rows to case data with error reporting).",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery case import/export, including column headers, TypeScript types, valid enum values, and format constants.",
  "frontend/src/features/cases/filtering.ts": "Provides pure functions to filter surgery cases by species, task types, incomplete tasks, or fully completed tasks.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the Web Speech API to provide start/stop recording, transcript accumulation, error handling, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Utility function that preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback when AI analysis returns semi-structured text.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured 'Label: Value' text line-by-line and maps recognized labels to CaseFormData fields, handling species, sex, dates, and string fields with voice input variations.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with incomplete tasks using a hidden iframe and the browser's native print dialog, with color-coded task badges.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases including remaining checklist tasks, with proper field escaping and a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utility functions for PDF display, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings, plus text truncation.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utility functions for CSV reports, converting Time (bigint nanoseconds), Species, and Sex enum values to human-readable strings.",
  "frontend/src/features/cases/search.ts": "Filters a list of SurgeryCase objects by a query string, matching against case fields and incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or number of remaining open tasks.",
  "frontend/src/features/cases/types.ts": "Defines the CaseFormData interface and constant option arrays for species and sex dropdowns used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields, date parsing (MM/DD/YYYY, ISO), date-to-nanoseconds conversion utilities, and species/sex enum parsers.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard React component that displays surgery cases in either a weekly calendar or list view, with filtering, sorting, search, and a new-case dialog.",
  "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx": "Weekly calendar React component that renders a 7-column grid of surgery cases grouped by arrival date, with previous/next week navigation.",
  "frontend/src/features/dashboard/utils/calendarUtils.ts": "Utility functions for the calendar view: computing week day arrays, filtering cases by day, formatting week range strings, and checking if a week is the current week.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open (remaining) checklist task items from surgery cases and count the total number of open tasks across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Empty settings view component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login, logout, and identity state via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including fetching/mutating surgery cases, user profiles, tasks, dashboard data, and OpenAI config.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a light-mode-only OKLCH color token system for the app's design system, including custom tokens for patient name, species, complaint, and notes fields.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file intended for jspdf-autotable type augmentation.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file intended for jsPDF type augmentation.",
  "frontend/src/types/tesseract.d.ts": "TypeScript module declaration for tesseract.js, defining interfaces for Worker, OCR results, logging, and enums for PSM and OEM modes.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and font family, and registers the animate and typography plugins.",
  "project_state.json": "Project state tracking file that records the current version, feature list, architectural notes, and in-progress implementation details for the veterinary case management app."
}