{
  "backend/main.mo": "Main Motoko actor for the SurgiPaw backend defining data types (SurgeryCase, Task, Species, Sex) and CRUD operations for surgery cases, user profiles, and OpenAI config with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two bugs to fix: restoring the cases list display broken in version 78 (filtering.ts) and fixing the broken app logo in the navigation header (App.tsx).",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing the purpose and key implementation details of each component, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SurgiPaw PWA, referencing favicon assets, web manifest, Apple touch icon meta tags, and mounting the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for SurgiPaw defining app name, display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of app shell assets, runtime caching of static files, and cache cleanup on activation; skips caching for API calls and Internet Identity flows.",
  "frontend/src/App.tsx": "Root React component providing the authenticated app shell with sticky navigation header, view routing (dashboard/cases/settings), new case dialog, and login/logout flow using Internet Identity.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication and clears the React Query cache on logout.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and saves their profile using the `useSaveCallerUserProfile` mutation, blocking dismissal until completed.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines the checklist items (discharge notes, labs, imaging, etc.) for surgery cases and exports utility functions to compute remaining, completed, and total task counts along with Tailwind color helpers.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Renders a collapsible card for a surgery case showing species icon, patient info, and an interactive checklist where tasks can be toggled complete via the `useUpdateTask` mutation.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "A dialog form for creating new surgery cases with fields for patient details, a quick-fill text area with speech recognition support, debounced previous-case search, and a checklist editor.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Displays a filterable, searchable, and sortable grid of surgery case cards with controls for species, task type, completion status, sort order, and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "A search input component with a clear button that filters cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "A dropdown select control for choosing the sort order of the cases list, using predefined `SORT_OPTIONS`.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component that allows multi-select filtering of cases by species, persisting the selection to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that lets users filter cases by task types using checkboxes, persisting selections to sessionStorage. Displays a badge with the count of active filters and supports a 'show all tasks completed' toggle.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that renders task checkboxes in either 'creation' mode (toggling selected fields) or 'completion' mode (toggling completed fields), showing only selected tasks in completion mode.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, handling file parsing, progress tracking, and creating or updating cases via backend mutations with error reporting.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component supporting manual MM/DD/YYYY entry with auto-slash insertion and a calendar popover picker, auto-advancing to the next field on complete input.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Provides exportCasesToCsv and importCasesFromCsv functions for serializing surgery cases to CSV and parsing CSV files back into case data, including validation and matching against existing cases.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for veterinary surgery case import/export, including column headers, TypeScript types, valid enum values, and format constants for dates and booleans.",
  "frontend/src/features/cases/filtering.ts": "Provides functions to filter surgery cases by species, by incomplete task types, by all-tasks-completed status, and to exclude fully completed cases.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "React hook that wraps the browser Web Speech API to provide speech-to-text recording with state for transcript, recording status, errors, and browser support detection.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors, and removing artifacts; used as a fallback text cleaner.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text lines into a partial CaseFormData object, mapping recognized field labels to typed values including species, sex, dates, and string fields.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates and triggers a browser print dialog for a landscape HTML table report of surgery cases with remaining tasks, using a hidden iframe.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a timestamped CSV file of surgery cases including remaining checklist tasks, using a temporary anchor element.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Utility functions for formatting Time (bigint nanoseconds), Species, and Sex enum values into human-readable strings for PDF display, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Utility functions for formatting Time (bigint nanoseconds), Species, and Sex enum values into human-readable strings for CSV report output.",
  "frontend/src/features/cases/search.ts": "Filters an array of SurgeryCase objects by a search query, matching against basic case fields and selected-but-incomplete checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for an AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options and a sortCases function that sorts SurgeryCase arrays by arrival date or open task count.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex dropdown options, and the CaseFormData interface used in case creation/editing forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation functions for case form fields and utility functions for date parsing, formatting, and conversion between Date objects and nanosecond timestamps.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Renders the main dashboard with a filterable, searchable, sortable grid of CaseCard components, including species/task filters and PDF export functionality.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Provides utilities to extract open task items from individual cases and calculate the total open task count across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Renders a settings page where users can configure and save an OpenAI API key, with status indicators showing whether AI analysis is currently enabled.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a value by a configurable delay, returning the debounced result.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing Internet Computer authentication via AuthClient, exposing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, and updating cases via an ICP actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for a light blue theme, with dark mode forced to match light mode.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for the jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for the jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file providing full type definitions for the tesseract.js OCR library, including Worker, RecognizeResult, PSM, and OEM enums.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and font family, and registers animate and typography plugins.",
  "project_state.json": "Project state metadata for SurgiPaw tracking two Version 78 regressions: cases list showing 'No cases found' and a broken app logo in the navigation header."
}