{
  "kind": "build_request",
  "title": "Add Weekly Calendar View to Dashboard with Toggle",
  "projectName": "SurgiPaw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a weekly calendar view to the DashboardView component that displays surgery cases in a 7-column grid (Sunday through Saturday), where each case is placed into its day column based on its Arrival Date field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-weekly-calendar",
          "msg-user-answers"
        ],
        "quotes": [
          "7-day columns (Sun-Sat) showing the current week",
          "Each day column shows case cards for patients who arrived that day",
          "Arrival Date for placement"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard displays a 7-column grid with columns labeled Sun through Sat",
        "Each case appears in the column matching its Arrival Date",
        "Cases with no arrival date or arrival dates outside the current week are not shown in the calendar view"
      ]
    },
    {
      "id": "REQ-2",
      "text": "The weekly calendar view defaults to the current week on load, with Previous and Next week navigation arrows that shift the displayed week backward or forward by 7 days.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-answers"
        ],
        "quotes": [
          "Default week to current week"
        ]
      },
      "acceptanceCriteria": [
        "On initial load the calendar shows the week containing today's date",
        "Previous arrow shifts the displayed week back by 7 days",
        "Next arrow shifts the displayed week forward by 7 days",
        "The week header shows the date range for the currently displayed week"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a toggle button on the Dashboard that switches between the new weekly calendar view and the existing case card grid view. The calendar view should be the default view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-weekly-calendar",
          "msg-user-answers"
        ],
        "quotes": [
          "A toggle button to switch between the current card grid and the weekly calendar",
          "Toggle"
        ]
      },
      "acceptanceCriteria": [
        "A toggle control is visible on the Dashboard",
        "Clicking the toggle switches between the weekly calendar view and the existing card grid view",
        "The weekly calendar view is displayed by default when the Dashboard loads",
        "The existing card grid view remains fully functional when toggled to"
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the weekly calendar view, each case card must display: Pet Name, MRN, Species badge, Presenting Complaint, and task status icons. Cases where all tasks are completed must be visually shaded out (e.g., reduced opacity or muted background) to distinguish them from active cases.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-weekly-calendar"
        ],
        "quotes": [
          "Cards show: Pet Name, MRN, Species badge, presenting complaint, and task status icons",
          "When all tasks are completed the card will be shaded out to make it more noticeable"
        ]
      },
      "acceptanceCriteria": [
        "Each calendar card shows Pet Name, MRN, Species badge, Presenting Complaint, and task status icons",
        "Cards with all tasks completed are visually shaded out (e.g., reduced opacity or muted/greyed background)",
        "Active cases (with incomplete tasks) appear at full opacity with normal styling"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Day columns in the weekly calendar view that have no cases assigned to them must display a subtle empty-state placeholder note (e.g., 'No cases') instead of being completely blank.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-weekly-calendar"
        ],
        "quotes": [
          "Days with no cases show an empty column with a subtle note"
        ]
      },
      "acceptanceCriteria": [
        "Day columns with no cases show a subtle placeholder text such as 'No cases'",
        "The placeholder is visually understated and does not dominate the layout"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing card grid view behavior — it must remain fully functional as a toggle option",
    "Do not alter backend data models or API calls; read Arrival Date from the existing SurgeryCase type",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui"
  ],
  "nonGoals": [
    "Replacing the existing card grid view entirely",
    "Adding drag-and-drop case rescheduling on the calendar",
    "Adding new case creation directly from the calendar",
    "Month or day view calendars — only weekly view is in scope",
    "Any backend changes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}