{
  "kind": "build_request",
  "title": "Diagnose and fix frontend data-fetching failure for surgery cases",
  "projectName": "SurgiPaw",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit the backend `main.mo` actor to verify that the query functions for fetching surgery cases (e.g., `getCases`, `getDashboardData`, or equivalent) are correctly defined, exported, and return the expected data types. Confirm that stable variable declarations and any upgrade hooks are intact so stored case data survives canister upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "All case-fetching query functions are present and correctly typed in main.mo",
        "Stable storage variables holding cases are declared with the `stable` keyword",
        "No runtime trap or type mismatch would prevent case data from being returned to the frontend"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit `frontend/src/hooks/useQueries.ts` to identify and fix the root cause of the failing surgery case fetch. Check that the React Query hooks calling the backend actor use the correct method names matching those exported by `main.mo`, that the actor instance from `useActor` is valid before the query runs (i.e., the query is not enabled when actor is undefined/null), that query keys are stable and not causing unintended cache misses or stale states, and that error handling does not silently swallow failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "Query hooks only execute when a valid actor instance is available (enabled guard)",
        "Method names called on the actor exactly match the names exported by backend main.mo",
        "Fetch errors are surfaced visibly (not silently caught and discarded)",
        "Cases load successfully on both DashboardView and CasesListView after login"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit `frontend/src/features/dashboard/components/DashboardView.tsx` and `frontend/src/features/cases/components/CasesListView.tsx` to confirm they correctly consume the query hooks from `useQueries.ts`, handle loading and error states, and render the returned case data. Fix any prop mismatches, missing null checks, or conditional rendering bugs that prevent cases from appearing even when the fetch succeeds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "DashboardView renders case cards when data is returned from the query hook",
        "CasesListView renders case cards when data is returned from the query hook",
        "Loading spinners/skeletons are shown while fetching and removed once data arrives",
        "Error states display a user-facing message when the fetch fails"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Audit `frontend/src/hooks/useActor.ts` to verify the backend actor is correctly initialized using the current Internet Identity principal, that it is re-initialized when the identity changes, and that the actor instance is not stale or undefined when queries attempt to use it. Fix any initialization race conditions or missing dependency triggers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "Actor is initialized with the authenticated identity before any case-fetch query runs",
        "Actor is refreshed/reinitialised when the user's identity changes",
        "useQueries hooks receive a non-null actor instance when the user is authenticated"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts (only fix bugs found within it), frontend/src/main.tsx, or frontend/src/components/ui",
    "Do not alter the backend stable storage schema in a way that would cause data loss — if schema changes are needed, generate migration.mo",
    "Preserve all existing case data stored in the ICP canister"
  ],
  "nonGoals": [
    "Adding new features or UI redesigns",
    "Changing authentication provider or identity flow",
    "Migrating data to an external database",
    "Fixing unrelated UI styling issues"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}