{
  "kind": "build_request",
  "title": "Fix cases not showing in live app — restore canister data fetching regression",
  "projectName": "SurgiPaw",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit the backend canister query function(s) responsible for fetching surgery cases (e.g., getCases, getSurgeryCases, or equivalent) and compare the current implementation against the Version 87 state. Identify any changes to query logic, access control (role-based authorization via MixinAuthorization), data filters, or return types that could cause cases to be excluded or return an empty result for authenticated users in the live environment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "I believe this is a data issue. The cases would show up in Version 87",
          "Cases are fetched from backend canister"
        ]
      },
      "acceptanceCriteria": [
        "The canister query function returns all previously created surgery cases for an authenticated user in the live app.",
        "No unintended access control or filter logic silently excludes existing case records.",
        "The query response type and shape match what the frontend React Query hooks expect."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit the frontend React Query hooks in `frontend/src/hooks/useQueries.ts` that fetch surgery cases from the backend canister. Compare the current query key structure, actor call method names, response transformation, and error handling against what was present in Version 87. Restore any logic that regressed between Version 87 and Version 91 that would cause cases to silently fail to load or render as empty.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "Cases have been visible in earlier versions",
          "Cases are fetched from backend canister"
        ]
      },
      "acceptanceCriteria": [
        "The React Query hook successfully fetches cases from the canister actor and populates the cases list in the live app.",
        "If the canister returns an empty array, a meaningful empty-state message is shown rather than silently failing.",
        "No console errors or uncaught promise rejections occur during case fetching for an authenticated user.",
        "Cases that exist in the canister are visible in the CasesListView and DashboardView after login."
      ]
    }
  ],
  "constraints": [
    "Do not alter the SurgeryCase data model or any existing stable storage variables in the backend in a way that would lose existing case records.",
    "Do not change immutable frontend paths: frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "If backend stable state is involved, generate migration.mo to preserve existing case data."
  ],
  "nonGoals": [
    "Adding new case fields or changing the case data model.",
    "UI redesign or styling changes.",
    "Changes to the sticky New Case button or species icons introduced in Version 91.",
    "Performance optimizations unrelated to the cases-not-showing regression."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}