{
  "kind": "build_request",
  "title": "Add 'Follow Up' task to Dashboard and Cases pages",
  "projectName": "SurgiPaw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a 'Follow Up' task type to the backend checklist/task definitions so it is recognized as a valid task on SurgeryCase records.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Add a task to both pages for \"Follow up\" with a circular arrow in the color aqua"
        ]
      },
      "acceptanceCriteria": [
        "A 'Follow Up' task variant exists in the backend Task type",
        "Existing cases are not broken by the addition of this new task type"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add 'Follow Up' as a checklist item in frontend/src/features/cases/checklist.ts with an aqua color token, so it appears in the default checklist selections and is included in task filtering and counting logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Add a task to both pages for \"Follow up\" with a circular arrow in the color aqua"
        ]
      },
      "acceptanceCriteria": [
        "A 'Follow Up' checklist item is defined with a label of 'Follow Up' and an aqua color",
        "The item is included in the default checklist selections for new cases",
        "The item participates in open-task count calculations on both Dashboard and Cases pages"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update frontend/src/components/workflow-icons/workflowTokens.ts to assign an aqua color token (e.g. #00BFBF or equivalent OKLCH aqua) to the 'Follow Up' task type, and ensure the existing IconFollowUp.tsx icon uses this aqua color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "with a circular arrow in the color aqua"
        ]
      },
      "acceptanceCriteria": [
        "The 'Follow Up' task color in workflowTokens.ts is set to an aqua value",
        "The IconFollowUp circular arrow SVG icon renders in aqua when displayed in checklist and task views"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the WorkflowIcon dispatcher in frontend/src/components/workflow-icons/WorkflowIcon.tsx maps the 'Follow Up' task type string to the IconFollowUp component so the aqua circular arrow icon renders on both the Dashboard and Cases pages wherever workflow task icons are shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Add a task to both pages for \"Follow up\" with a circular arrow in the color aqua"
        ]
      },
      "acceptanceCriteria": [
        "WorkflowIcon renders IconFollowUp when given the 'Follow Up' task type",
        "The aqua circular arrow icon is visible on case cards in both DashboardView and CasesListView"
      ]
    }
  ],
  "constraints": [
    "Do not break existing task types or checklist items",
    "Use the existing IconFollowUp.tsx circular arrow icon — do not create a new icon component",
    "Aqua color must be consistent between workflowTokens.ts and checklist.ts"
  ],
  "nonGoals": [
    "Redesigning the checklist or workflow icon layout",
    "Adding any other new task types",
    "Changing the styling or color of existing task icons"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}