{
  "kind": "build_request",
  "title": "Fix browser console warnings: PWA manifest meta tag and icon resource",
  "projectName": "SurgiPaw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add <meta name=\"mobile-web-app-capable\" content=\"yes\"> to frontend/index.html alongside or replacing the deprecated <meta name=\"apple-mobile-web-app-capable\" content=\"yes\"> tag to resolve the browser deprecation warning.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "<meta name=\"apple-mobile-web-app-capable\" content=\"yes\"> is deprecated. Please include <meta name=\"mobile-web-app-capable\" content=\"yes\">"
        ]
      },
      "acceptanceCriteria": [
        "<meta name=\"mobile-web-app-capable\" content=\"yes\"> is present in frontend/index.html",
        "No deprecation warning about apple-mobile-web-app-capable appears in the browser console"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Fix the PWA manifest icon entry in frontend/public/manifest.json so that the icon referenced (IMG_4505.ico or equivalent) uses a valid image file with correct dimensions and format. Replace the .ico reference with a properly sized PNG icon (e.g., 192x192 and 512x512) so the browser can load the manifest icon without a 'Resource size is not correct' error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Error while trying to use the following icon from the Manifest: https://vet-surgery-caselog-97o.caffeine.xyz/assets/IMG_4505.ico (Resource size is not correct - typo in the Manifest?)"
        ]
      },
      "acceptanceCriteria": [
        "frontend/public/manifest.json references valid PNG icon files at standard PWA sizes (192x192 and 512x512)",
        "No manifest icon error appears in the browser console",
        "The .ico file reference is removed or replaced with a correctly formatted PNG entry"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths",
    "Do not change any existing app functionality or visual design"
  ],
  "nonGoals": [
    "Fixing the 'Detected both agent and agentOptions passed to createActor' warning — this is a known ICP/DFINITY SDK warning and does not affect functionality",
    "Adding new features or changing backend logic"
  ],
  "imageRequirements": {
    "required": [
      "App icon for PWA manifest — clean paw print or veterinary cross symbol on a solid background (app-icon.dim_512x512.png)",
      "App icon small size variant (app-icon-192.dim_192x192.png)"
    ],
    "edits": []
  }
}