{
  "kind": "build_request",
  "title": "Fix Version 78 regressions: cases not displaying and broken app logo",
  "projectName": "SurgiPaw",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the cases list display so that existing cases are visible in the Cases view. In Version 78, the list shows 'No cases found' even though cases existed and displayed correctly in Version 77. Audit changes made in Version 78 to CasesListView, filtering, search, and query hooks, and revert or fix any logic that incorrectly filters out or fails to load cases.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Cases were displaying correctly in Version 77. In Version 78 it says No cases found."
        ]
      },
      "acceptanceCriteria": [
        "Cases that exist in the backend are rendered in the cases list view without any filtering accidentally excluding them.",
        "The 'No cases found' message only appears when there are genuinely no cases stored.",
        "All filtering, search, and sort controls continue to work as expected after the fix."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the broken app logo in the top-left corner of the navigation header. The image is rendering as a broken image placeholder (paper icon with a line through it). Locate the logo asset reference in App.tsx and ensure the correct image path or inline SVG/component is used so the logo displays properly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "It is the app logo; it is a paper icon with a line through it"
        ]
      },
      "acceptanceCriteria": [
        "The app logo is visible and renders correctly in the top-left corner of the navigation header.",
        "No broken image placeholder (paper icon with a line through it) is shown.",
        "The logo displays consistently across the Dashboard, Cases, and Settings views."
      ]
    }
  ],
  "constraints": [
    "Do not introduce new features or UI changes beyond fixing the two identified regressions.",
    "Preserve all Version 78 improvements (species icons, compact cards, relocated + New Case button, updated search) except where they are the direct cause of the regressions."
  ],
  "nonGoals": [
    "Redesigning or restyling the app logo.",
    "Changes to backend data models or CRUD operations.",
    "Adding new filtering or sorting options."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}