{
  "kind": "build_request",
  "title": "Fix Cases loading regression from Version 94 (blank list on Dashboard and Cases pages)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the Version 94 frontend regression that causes a blank Cases list on both the Dashboard and Cases pages. The only changes in Version 94 were to workflow/task icons and their associated logic. Compare the current frontend code for cases data fetching and rendering (useQueries.ts, CasesListView.tsx, DashboardView.tsx, CaseCard.tsx, ChecklistEditor.tsx, WorkflowIcon.tsx) against the last known working state to identify where the icon/workflow changes broke Cases loading. Restore Cases loading to the working state from Version 93 while keeping any valid icon improvements intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Cases are not loading in the app. They are called cases in the app. Stored in the backend canister. They loaded fine in version 93",
          "Blank list",
          "Changes were related to changing icons for the tasks and the flow associated with those.",
          "From what I can tell it is loading cases on both the Dashboard and Cases page"
        ]
      },
      "acceptanceCriteria": [
        "Cases list is no longer blank on the Cases page — existing cases from the backend canister are displayed.",
        "Cases list is no longer blank on the Dashboard page — existing cases from the backend canister are displayed.",
        "No console errors related to case fetching, task icons, or workflow rendering.",
        "Workflow/task icons still render correctly on case cards.",
        "Creating, editing, and filtering cases continues to work as expected."
      ]
    }
  ],
  "constraints": [
    "Do not modify backend/main.mo — this is a frontend-only regression.",
    "Do not remove or revert workflow icon components unless they are directly causing the rendering failure.",
    "Preserve all valid Version 94 icon and workflow improvements that do not break case loading."
  ],
  "nonGoals": [
    "Adding new features or UI changes beyond fixing the blank list regression.",
    "Modifying backend data models or CRUD operations.",
    "Changing the visual design of the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}