{
  "kind": "build_request",
  "title": "Dashboard patient card resize, species icons, New Case button relocation, and completed case search inclusion",
  "projectName": "SurgiPaw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make each patient card on the Dashboard smaller overall — reduce padding, font sizes, and card height so more cards are visible without scrolling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-prior"
        ],
        "quotes": [
          "make each patient card smaller overall"
        ]
      },
      "acceptanceCriteria": [
        "Patient cards on the Dashboard are visibly more compact than before",
        "Card content (patient name, species icon, task count, etc.) remains readable",
        "Multiple cards fit in the viewport without scrolling on a standard desktop screen"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Move the '+ New Case' button from its current location into the top navigation/header bar, positioned to the left of the Dashboard navigation button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-prior"
        ],
        "quotes": [
          "move the + New Case button to the header to the left of the Dashboard button",
          "Yes, top navigation/header bar"
        ]
      },
      "acceptanceCriteria": [
        "The '+ New Case' button appears in the top navigation/header bar on all authenticated views",
        "The button is positioned to the left of the Dashboard nav button",
        "Clicking '+ New Case' from the header opens the new case dialog/form as before",
        "The button is no longer rendered in its previous location (e.g., page-level header of the Dashboard or Cases list)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the Canine, Feline, and Other species text labels on patient cards with colored animal silhouette icons: a dog silhouette for Canine, a cat silhouette for Feline, and a randomly chosen animal silhouette for Other. Each silhouette should use a distinct color to differentiate species at a glance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-prior"
        ],
        "quotes": [
          "change Canine and Feline to icons",
          "Use colored animal silhouettes, for other it can be a random animal"
        ]
      },
      "acceptanceCriteria": [
        "Patient cards display a colored animal silhouette icon instead of the text label 'Canine', 'Feline', or 'Other'",
        "Dog silhouette is shown for Canine cases, cat silhouette for Feline cases",
        "A random animal silhouette is shown for Other species cases",
        "Each species icon uses a visually distinct color",
        "Icons are appropriately sized within the compact card layout"
      ]
    },
    {
      "id": "REQ-4",
      "text": "When searching for previous cases inside the New Case form (MRN-based or name-based patient lookup), include cases where all tasks have been completed in the search results, in addition to active/open cases.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-current"
        ],
        "quotes": [
          "When searching for previous cases while data is being entered in the New Case fields include cases where all tasks have been completed."
        ]
      },
      "acceptanceCriteria": [
        "The previous-case lookup in the New Case form returns cases regardless of task completion status",
        "Cases where every task is marked complete are included in search/autocomplete results",
        "Existing search matching logic (by MRN, pet name, owner, etc.) is otherwise unchanged"
      ]
    }
  ],
  "constraints": [
    "Do not alter backend data models or APIs — all changes are frontend-only",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui"
  ],
  "nonGoals": [
    "Adding new species options to the data model",
    "Changing the species filter behavior in the Cases list view",
    "Modifying task completion logic or checklist behavior",
    "Any backend changes"
  ],
  "imageRequirements": {
    "required": [
      "Solid dog silhouette icon in warm amber/orange tone (dog-silhouette.dim_64x64.png)",
      "Solid cat silhouette icon in teal/green tone (cat-silhouette.dim_64x64.png)",
      "Solid rabbit silhouette icon in lavender/purple tone for Other species (other-animal-silhouette.dim_64x64.png)"
    ],
    "edits": []
  }
}