{
  "kind": "build_request",
  "title": "Icon changes (histo → side-view microscope, labs → test tube) and calendar card navigation to Cases page",
  "projectName": "SurgiPaw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the IconHisto SVG with a side-profile (lateral view) microscope illustration. The new SVG should clearly depict a microscope viewed from the side, with a visible eyepiece, arm, stage, and base, retaining the existing `histo` color token.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "histo to side-view microscope"
        ]
      },
      "acceptanceCriteria": [
        "IconHisto.tsx renders a side-view microscope silhouette instead of the previous microscope shape.",
        "The icon uses the existing `histo` color token for stroke/fill.",
        "The icon renders correctly in both the CaseCard checklist and CalendarCaseCard workflow icon rows."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the IconLabs SVG with a test tube illustration. The new SVG should clearly depict a single test tube (elongated cylinder closed at the bottom, open or capped at the top), retaining the existing `labs` color token.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "labs to test tube"
        ]
      },
      "acceptanceCriteria": [
        "IconLabs.tsx renders a test tube shape instead of the previous flask/beaker shape.",
        "The icon uses the existing `labs` color token for stroke/fill.",
        "The icon renders correctly in both the CaseCard checklist and CalendarCaseCard workflow icon rows."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make each case card in the weekly calendar view (CalendarCaseCard) a clickable link that navigates the user to the Cases page and highlights or focuses the corresponding case. Clicking anywhere on the card body (excluding individual workflow icon toggles) should trigger navigation to the Cases view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Calendar card links to Cases page"
        ]
      },
      "acceptanceCriteria": [
        "Clicking a CalendarCaseCard navigates the user to the Cases (CasesListView) page.",
        "Individual workflow icon toggle buttons within the card still function as task toggles and do not trigger navigation.",
        "The card has a visible pointer cursor and/or hover state indicating it is clickable.",
        "Navigation passes the case identifier so the Cases view can scroll to or highlight the relevant case."
      ]
    }
  ],
  "constraints": [
    "Do not change any color tokens or the WorkflowIconBase wrapper.",
    "Do not alter task toggle behavior on CalendarCaseCard workflow icons."
  ],
  "nonGoals": [
    "Adding last name to the calendar view (separate request).",
    "Increasing text size or decreasing icon size on the calendar view (separate request).",
    "Adding the Daily Summary task (separate request).",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}