{
  "kind": "build_request",
  "title": "Fix blank page: revert data-fetching logic to Version 107",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose why the database is not loading in both Draft and Live app (blank page). Inspect the current backend main.mo actor — verify that all query and update methods are correctly defined, publicly exposed, and return the expected types. Ensure there are no runtime traps, missing stable variables, or broken upgrade paths that would cause fetches to silently fail.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "Backend actor compiles without errors",
        "All query methods (e.g., getCases, getDashboardData) are publicly callable and return non-empty results when data exists",
        "No silent traps or missing stable variable declarations on upgrade"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Revert the data-fetching logic in frontend/src/hooks/useQueries.ts (and any related hooks or utilities modified after Version 107) to exactly how it was implemented in Version 107. This includes restoring the original React Query hooks for fetching surgery cases, dashboard data, and user profiles — including query keys, actor invocation patterns, enabled conditions, and error handling — as they existed in Version 107.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Revert to data-fetching logic from Version 107"
        ]
      },
      "acceptanceCriteria": [
        "useQueries.ts matches the Version 107 implementation for all data-fetching hooks",
        "The Dashboard view loads and displays surgery cases without a blank page",
        "The Cases list view loads and displays surgery cases without a blank page",
        "React Query fetches complete successfully and do not remain in a loading or error state indefinitely"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit the actor wiring between the frontend and backend: verify that the actor created in frontend/src/hooks/useActor.ts is correctly passed to all data-fetching calls in useQueries.ts, and that the actor's canister ID and IDL are aligned with the current deployed backend. Fix any mismatch introduced after Version 107 (e.g., wrong actor configuration, missing method bindings, or incorrect canister ID references).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "take a fresh look at the current backend and frontend code to diagnose exactly why the fetch is failing"
        ]
      },
      "acceptanceCriteria": [
        "The actor instance in useActor.ts successfully resolves and is passed to all query hooks",
        "No 'actor is undefined' or 'method not found' errors appear in the browser console",
        "Data loads correctly on both Dashboard and Cases pages after login"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, frontend/src/components/ui)",
    "Do not introduce new features; this is a targeted fix and revert only",
    "Preserve all existing stable variable declarations in the backend to avoid data loss on upgrade"
  ],
  "nonGoals": [
    "Adding new backend methods or data types",
    "Redesigning any UI components",
    "Changing authentication flow",
    "Modifying CSV import/export or PDF generation logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}