{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Cases loading regression from Version 94 (blank list on Dashboard and Cases pages)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Investigate and fix the Version 94 frontend regression causing blank Cases lists on Dashboard and Cases pages due to workflow/task icon changes",
      "acceptanceCriteria": [
        "Cases list is no longer blank on the Cases page — existing cases from the backend canister are displayed.",
        "Cases list is no longer blank on the Dashboard page — existing cases from the backend canister are displayed.",
        "No console errors related to case fetching, task icons, or workflow rendering.",
        "Workflow/task icons still render correctly on case cards.",
        "Creating, editing, and filtering cases continues to work as expected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/workflow-icons/WorkflowIcon.tsx",
          "operation": "modify",
          "description": "Review and fix the WorkflowIcon dispatcher component to ensure it handles all WorkflowType values correctly without causing rendering errors that would break the parent CaseCard component. Verify that the component gracefully handles unknown or undefined workflow types by returning null or a fallback instead of throwing errors. Check that the mapping logic from WorkflowType strings to icon components is complete and matches the types used in checklist.ts."
        },
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Review the CaseCard component to identify and fix any errors introduced by the workflow icon integration in Version 94. Ensure that WorkflowIcon component usage includes proper error boundaries or null checks. Verify that the checklist rendering logic does not break when WorkflowIcon returns undefined or encounters an unknown task type. Add defensive error handling around icon rendering to prevent the entire card from failing to render if a single icon has issues. Confirm that the expandable checklist section properly handles all task states."
        },
        {
          "path": "frontend/src/features/cases/components/ChecklistEditor.tsx",
          "operation": "modify",
          "description": "Review the ChecklistEditor component for any workflow icon integration issues that could prevent case lists from rendering. Ensure WorkflowIcon usage includes proper null checks and does not cause the component to fail silently or throw errors. Verify that the checklist items array mapping correctly handles all task types defined in checklist.ts. Add error boundaries or fallback rendering for cases where icon components fail to load."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Review the CasesListView component to ensure it properly handles rendering errors from child CaseCard components. Add defensive checks to ensure that if individual case cards fail to render due to icon issues, the entire list does not become blank. Verify that the cases data from useGetAllCases is being correctly mapped and passed to CaseCard components. Add console logging or error boundaries to catch and display any rendering failures. Ensure the empty state message displays when cases array is empty versus when rendering fails."
        },
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Review the DashboardView component to ensure it properly handles rendering errors from the embedded cases list. Verify that the cases data from useGetAllCases is correctly fetched and passed down. Add defensive checks to prevent the entire dashboard from going blank if case card rendering fails. Ensure proper error boundaries or fallback UI displays when individual components fail. Verify that filtering and sorting logic does not inadvertently filter out all cases due to icon-related data issues."
        },
        {
          "path": "frontend/src/features/cases/checklist.ts",
          "operation": "modify",
          "description": "Review the checklist item definitions and helper functions to ensure the WorkflowType values match exactly with those expected by WorkflowIcon.tsx. Verify that getRemainingTaskItems and other functions return task objects with properly formatted type fields. Check for any changes in Version 94 that might have introduced type mismatches or undefined values that would break icon rendering."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useGetAllCases hook to ensure it is properly fetching and returning cases data without silent failures. Verify that the query is enabled correctly and that error states are being surfaced. Add logging to confirm that the backend getAllCases function is being called and returning data. Ensure the query key and data transformation logic has not been inadvertently broken by Version 94 changes."
        },
        {
          "path": "frontend/src/components/workflow-icons/workflowTokens.ts",
          "operation": "modify",
          "description": "Review the workflow token definitions to ensure all required task types have corresponding color tokens. Verify that the workflowColors mapping includes entries for all task types used in checklist.ts. Check for any missing or misnamed entries that would cause icon components to fail when trying to access color values."
        }
      ]
    }
  ]
}