{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore 'New Case' button and functionality from version 77",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the 'New Case' button in CasesListView.tsx as it existed in version 77, including the button's visual appearance, placement, and click handler that opens the CaseFormDialog",
      "acceptanceCriteria": [
        "A 'New Case' button is visible in the cases list view",
        "Clicking the button opens the CaseFormDialog modal",
        "The button is styled and positioned consistently with the rest of the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Add the 'New Case' button to the CasesListView header section alongside existing search/filter/sort controls. Add state management for the CaseFormDialog open/close state using useState. Add a handleCreateCase callback that sets the dialog open state to true. Wire the button's onClick handler to open the CaseFormDialog. Position the button prominently in the toolbar area with consistent styling (primary color, appropriate padding, icon if needed). Ensure the button is only visible to authenticated users with appropriate permissions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore the full 'New Case' form functionality in CaseFormDialog.tsx as it existed in version 77, including form fields, validation, speech-to-text quick-fill, AI-assisted structured text parsing, previous-case lookup, checklist task selection, and case submission via the create case mutation",
      "acceptanceCriteria": [
        "CaseFormDialog opens when triggered from the 'New Case' button",
        "All form fields (MRN, dates, patient info, species, sex, notes) are present and functional",
        "Form validation prevents submission of incomplete or invalid data",
        "Speech-to-text quick-fill feature is present and functional",
        "AI-assisted structured text parsing is available",
        "Checklist task selection is available during case creation",
        "Submitting the form creates a new surgery case via the backend mutation",
        "After successful creation the dialog closes and the new case appears in the list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Restore all form functionality including: form state management for all case fields (medicalRecordNumber, arrivalDate, petName, ownerLastName, species, breed, sex, dateOfBirth, presentingComplaint, notes), task selection state using TaskOptions interface. Restore form validation logic that checks required fields before enabling submission. Restore speech-to-text integration using the useSpeechRecognition hook with UI controls (record button, status indicator, transcript display). Restore AI-assisted structured text parsing feature that analyzes captured/transcribed text and auto-fills form fields via parseStructuredText utility. Restore previous-case lookup functionality that searches for cases by MRN using getCaseByMedicalRecordNumber and offers to pre-fill owner/patient data. Restore ChecklistEditor component integration in creation mode for task selection. Wire form submission to useCreateCase mutation hook with proper error handling. Add success handling that closes dialog, clears form state, and triggers case list refresh. Ensure dialog can be opened/closed via props and handles all edge cases (validation errors, API errors, loading states)."
        }
      ]
    }
  ]
}