{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Weekly Calendar View to Dashboard with Toggle",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a weekly calendar view component that displays surgery cases in a 7-column grid (Sunday through Saturday) based on Arrival Date",
      "acceptanceCriteria": [
        "Dashboard displays a 7-column grid with columns labeled Sun through Sat",
        "Each case appears in the column matching its Arrival Date",
        "Cases with no arrival date or arrival dates outside the current week are not shown in the calendar view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx",
          "operation": "create",
          "description": "Create the WeeklyCalendarView component that renders a 7-column grid (Sun-Sat). For each day column, filter cases where the Arrival Date (Time bigint) falls on that day. Use the existing CaseCard component to render each case within its day column. Apply responsive grid layout using Tailwind CSS classes."
        },
        {
          "path": "frontend/src/features/dashboard/utils/calendarUtils.ts",
          "operation": "create",
          "description": "Create utility functions: getWeekDays(weekOffset: number) to return an array of 7 Date objects for the current week plus offset; isSameDay(date1: Date, date2: Date) to compare dates; filterCasesByDay(cases: SurgeryCase[], targetDate: Date) to filter cases matching a specific day based on arrivalDate (Time bigint converted to Date); formatWeekRange(startDate: Date, endDate: Date) to format the week header date range."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "The weekly calendar view defaults to the current week with Previous and Next navigation arrows",
      "acceptanceCriteria": [
        "On initial load the calendar shows the week containing today's date",
        "Previous arrow shifts the displayed week back by 7 days",
        "Next arrow shifts the displayed week forward by 7 days",
        "The week header shows the date range for the currently displayed week"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx",
          "operation": "modify",
          "description": "Add state management for weekOffset (number, default 0). Add a header section above the calendar grid with: a week range display (formatted using formatWeekRange from calendarUtils.ts), a Previous arrow button that decrements weekOffset, and a Next arrow button that increments weekOffset. Use the weekOffset to calculate the displayed week via getWeekDays(weekOffset). Use shadcn/ui Button components for the navigation arrows."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a toggle button on the Dashboard that switches between weekly calendar view and existing card grid view, defaulting to calendar view",
      "acceptanceCriteria": [
        "A toggle control is visible on the Dashboard",
        "Clicking the toggle switches between the weekly calendar view and the existing card grid view",
        "The weekly calendar view is displayed by default when the Dashboard loads",
        "The existing card grid view remains fully functional when toggled to"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Add state for view mode (useState) with initial value 'calendar'. Add a toggle control (using shadcn/ui Toggle or Tabs component) above the dashboard content area with options for 'Calendar' and 'List'. Conditionally render either the new WeeklyCalendarView component (when mode is 'calendar') or the existing case card grid (when mode is 'list'). Import WeeklyCalendarView and pass the filtered/sorted cases array to it. Ensure all existing filtering, sorting, and search controls remain active and affect both views."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "In the weekly calendar view, each case card displays Pet Name, MRN, Species badge, Presenting Complaint, and task status icons, with completed cases visually shaded out",
      "acceptanceCriteria": [
        "Each calendar card shows Pet Name, MRN, Species badge, Presenting Complaint, and task status icons",
        "Cards with all tasks completed are visually shaded out (e.g., reduced opacity or muted/greyed background)",
        "Active cases (with incomplete tasks) appear at full opacity with normal styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CalendarCaseCard.tsx",
          "operation": "create",
          "description": "Create a compact CalendarCaseCard component specifically for the calendar view. Display: Pet Name (bold), MRN (small text), Species badge (using existing species badge styling), Presenting Complaint (truncated if long), and task status icons (using WorkflowIcon components from workflow-icons). Calculate if all selected tasks are completed using checklist utilities from frontend/src/features/cases/checklist.ts. If all tasks are complete, apply reduced opacity (e.g., opacity-50) and a muted background class. Make the card clickable to expand details (similar to existing CaseCard behavior). Use Tailwind CSS for compact layout suitable for calendar cells."
        },
        {
          "path": "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx",
          "operation": "modify",
          "description": "Replace the usage of CaseCard with the new CalendarCaseCard component for rendering cases within day columns. Pass each SurgeryCase to CalendarCaseCard along with any required props for expand/collapse behavior."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Day columns with no cases display a subtle empty-state placeholder note",
      "acceptanceCriteria": [
        "Day columns with no cases show a subtle placeholder text such as 'No cases'",
        "The placeholder is visually understated and does not dominate the layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/WeeklyCalendarView.tsx",
          "operation": "modify",
          "description": "For each day column in the calendar grid, check if the filtered cases array for that day is empty. If empty, render a subtle placeholder div with text 'No cases' styled with muted text color (text-muted-foreground) and small font size. Position it vertically centered in the column with appropriate padding. Ensure the placeholder does not break the grid layout."
        }
      ]
    }
  ]
}