{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Icon changes (histo → side-view microscope, labs → test tube) and calendar card navigation to Cases page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace IconHisto SVG with a side-profile (lateral view) microscope illustration retaining the existing histo color token",
      "acceptanceCriteria": [
        "IconHisto.tsx renders a side-view microscope silhouette instead of the previous microscope shape.",
        "The icon uses the existing `histo` color token for stroke/fill.",
        "The icon renders correctly in both the CaseCard checklist and CalendarCaseCard workflow icon rows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/workflow-icons/IconHisto.tsx",
          "operation": "modify",
          "description": "Replace the current microscope SVG path with a new side-profile microscope illustration. The new SVG should clearly depict a microscope viewed from the side, with a visible eyepiece, arm, stage, and base. Keep the existing WorkflowIconBase wrapper and histo color token unchanged. Ensure the viewBox and path coordinates create a recognizable lateral microscope silhouette that fits within the standard icon dimensions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace IconLabs SVG with a test tube illustration retaining the existing labs color token",
      "acceptanceCriteria": [
        "IconLabs.tsx renders a test tube shape instead of the previous flask/beaker shape.",
        "The icon uses the existing `labs` color token for stroke/fill.",
        "The icon renders correctly in both the CaseCard checklist and CalendarCaseCard workflow icon rows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/workflow-icons/IconLabs.tsx",
          "operation": "modify",
          "description": "Replace the current flask/beaker SVG path with a new test tube illustration. The new SVG should clearly depict a single test tube (elongated cylinder closed at the bottom, open or capped at the top). Keep the existing WorkflowIconBase wrapper and labs color token unchanged. Ensure the viewBox and path coordinates create a recognizable test tube shape that fits within the standard icon dimensions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make each CalendarCaseCard clickable to navigate to the Cases page and highlight the corresponding case, while preserving workflow icon toggle functionality",
      "acceptanceCriteria": [
        "Clicking a CalendarCaseCard navigates the user to the Cases (CasesListView) page.",
        "Individual workflow icon toggle buttons within the card still function as task toggles and do not trigger navigation.",
        "The card has a visible pointer cursor and/or hover state indicating it is clickable.",
        "Navigation passes the case identifier so the Cases view can scroll to or highlight the relevant case."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CalendarCaseCard.tsx",
          "operation": "modify",
          "description": "Wrap the card content in a clickable container that navigates to the Cases view when clicked. Use the existing URL parameter utilities from frontend/src/utils/urlParams.ts to persist a caseId parameter. Prevent event propagation from workflow icon buttons to the card container so individual task toggles still work without triggering navigation. Add a pointer cursor and subtle hover state (e.g., slight scale or shadow) to indicate the card is clickable. Ensure the click handler extracts the case ID and navigates using window.location or React state management."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Add logic to read the caseId URL parameter on mount using the utilities from frontend/src/utils/urlParams.ts. When a caseId is present, scroll to or highlight the corresponding case card in the list. Implement smooth scrolling behavior and apply a temporary highlight effect (e.g., border pulse or background color change) to draw attention to the target case. Clear the URL parameter after highlighting to prevent repeat highlights on subsequent renders."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Cases view navigation from the calendar preserves the caseId parameter in the URL. Verify that switching between Dashboard and Cases views does not inadvertently clear session storage or URL parameters before the CasesListView has a chance to read them. If navigation is handled via state props, pass the caseId through the navigation flow."
        }
      ]
    }
  ]
}