{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix cases not showing in live app — restore canister data fetching regression",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Audit and restore frontend React Query hooks in useQueries.ts to match Version 87 behavior, ensuring surgery cases fetch correctly from the backend canister and render in the UI without silent failures",
      "acceptanceCriteria": [
        "The React Query hook successfully fetches cases from the canister actor and populates the cases list in the live app.",
        "If the canister returns an empty array, a meaningful empty-state message is shown rather than silently failing.",
        "No console errors or uncaught promise rejections occur during case fetching for an authenticated user.",
        "Cases that exist in the canister are visible in the CasesListView and DashboardView after login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit the useGetAllCases hook and compare against Version 87 implementation. Restore any query key structure, actor method call, response transformation, or error handling logic that regressed between Version 87 and Version 91. Ensure the hook properly handles empty arrays, loading states, and errors. Verify the actor.getAllCases() call matches the backend interface and that the enabled condition correctly depends on actor availability and authentication state. Add console logging for debugging if cases are empty or errors occur."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Audit the CasesListView component to ensure it correctly consumes the useGetAllCases hook and handles all states (loading, error, empty array, populated data). Compare against Version 87 to identify any conditional rendering or data flow regressions. Ensure that when isLoading is false and data is an empty array, a clear empty-state message is displayed (e.g., 'No cases found. Create your first case to get started.'). Verify that any filters or search logic does not inadvertently hide valid cases. Add error boundary or error display if query.error is present."
        },
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Audit the DashboardView component to ensure it correctly consumes the useGetAllCases hook and displays cases. Compare against Version 87 to identify any conditional rendering or data flow regressions. Ensure that when isLoading is false and data is an empty array, a clear empty-state message is displayed. Verify that the dashboard's filter and sort logic does not inadvertently exclude valid cases. Add error display if query.error is present."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the App.tsx root component to ensure authentication state and actor initialization are correct. Compare against Version 87 to identify any changes to the authentication flow, InternetIdentityProvider configuration, or query client setup that could cause queries to fail silently. Ensure that the ProfileSetupModal does not block case fetching or navigation. Verify that the QueryClientProvider and InternetIdentityProvider are correctly configured and that the actor hook dependency chain is intact."
        }
      ]
    }
  ]
}