{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix cases not loading on Dashboard and Cases pages",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the data-fetching logic in useQueries.ts so that surgery cases are correctly fetched and returned for both the DashboardView and CasesListView components",
      "acceptanceCriteria": [
        "The Dashboard page renders surgery case cards when cases exist in the backend.",
        "The Cases list page renders surgery case cards when cases exist in the backend.",
        "The `useCases` (or equivalent) query in useQueries.ts successfully returns an array of SurgeryCase objects.",
        "No console errors related to case fetching appear in the browser.",
        "Both pages show an appropriate empty state (not a blank or broken UI) when there are no cases."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the `useCases` query hook to ensure it properly fetches surgery cases from the backend. Verify the query configuration includes proper enabled conditions (actor must be available and not fetching), correct queryKey format, error handling with retry logic, and that the queryFn correctly calls actor.getAllCases() and returns the result. Ensure the hook returns proper loading states that account for actor dependency (isLoading should be true when actorFetching is true or query.isLoading is true). Review any recent changes to query keys, enabled conditions, or result transformation that may have caused a regression after Version 93."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify that DashboardView.tsx and CasesListView.tsx correctly consume the cases query result from useQueries.ts",
      "acceptanceCriteria": [
        "DashboardView displays a loading indicator while cases are being fetched.",
        "CasesListView displays a loading indicator while cases are being fetched.",
        "DashboardView renders CaseCard components for each returned case.",
        "CasesListView renders CaseCard components for each returned case.",
        "Both views display a user-friendly error message if the fetch fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Verify that DashboardView correctly consumes the useCases query result. Ensure it properly destructures isLoading, error, and data from the query hook. Confirm that a loading indicator is shown when isLoading is true, an error message is displayed when error is not null, and CaseCard components are rendered for each case in the data array when data is available. Verify that an empty state message (e.g., 'No cases yet') is shown when data is an empty array. Fix any issues preventing proper rendering of fetched cases."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Verify that CasesListView correctly consumes the useCases query result. Ensure it properly destructures isLoading, error, and data from the query hook. Confirm that a loading indicator is shown when isLoading is true, an error message is displayed when error is not null, and CaseCard components are rendered for filtered/sorted cases when data is available. Verify that an empty state message is shown when the filtered cases array is empty. Fix any issues preventing proper rendering of fetched cases."
        }
      ]
    }
  ]
}