{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Version 78 Regressions: Cases Display and App Logo",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore cases list display by auditing and fixing filtering, search, and query logic that incorrectly filters out or fails to load existing cases",
      "acceptanceCriteria": [
        "Cases that exist in the backend are rendered in the cases list view without any filtering accidentally excluding them.",
        "The 'No cases found' message only appears when there are genuinely no cases stored.",
        "All filtering, search, and sort controls continue to work as expected after the fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Audit the filter chain (species filter, tasks filter, completion status filter, search filter) to identify logic that incorrectly excludes valid cases. Ensure the initial state or default filter values do not accidentally filter out all cases. Add defensive checks to handle empty or undefined filter states gracefully. Verify that the filtered cases logic correctly handles cases when no filters are active."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useGetAllCases hook to ensure it correctly fetches and returns all cases from the backend. Verify that the query is enabled when the actor is available and that error states are properly handled. Ensure the hook does not inadvertently return an empty array when cases exist in the backend."
        },
        {
          "path": "frontend/src/features/cases/filtering.ts",
          "operation": "modify",
          "description": "Review filterCasesBySpecies, filterCasesByIncompleteTasks, and related filter functions to ensure they do not incorrectly exclude cases. Verify that when no species or task filters are selected (empty arrays), the functions return all cases instead of filtering everything out. Add explicit handling for empty filter arrays to pass through all cases."
        },
        {
          "path": "frontend/src/features/cases/search.ts",
          "operation": "modify",
          "description": "Audit the searchCases function to ensure it correctly matches cases when the search query is empty or whitespace-only. Verify that an empty search term returns all cases unchanged. Check for any edge cases in string matching that might exclude valid cases."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Review URL parameter and sessionStorage handling for filter state persistence. Ensure that persisted filter values from previous sessions do not inadvertently exclude all cases on page load. Add logic to validate and sanitize persisted filter values, falling back to safe defaults (no filters active) if invalid state is detected."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the broken app logo in the navigation header by using a valid image asset or inline SVG component",
      "acceptanceCriteria": [
        "The app logo is visible and renders correctly in the top-left corner of the navigation header.",
        "No broken image placeholder (paper icon with a line through it) is shown.",
        "The logo displays consistently across the Dashboard, Cases, and Settings views."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the broken `/assets/logo.png` reference with a valid logo asset path. Use one of the existing generated icon assets from the workspace: `frontend/public/assets/generated/surgery-case-log-icon.dim_512x512.png` for a high-quality logo, or `frontend/public/assets/generated/favicon-192x192.dim_192x192.png` for a smaller icon. Update the img src attribute to use the correct path (e.g., `/assets/generated/surgery-case-log-icon.dim_512x512.png`) and ensure appropriate width/height styling is applied for the header size."
        }
      ]
    }
  ]
}