{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard patient card resize, species icons, New Case button relocation, and completed case search inclusion",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reduce patient card size on the Dashboard to show more cards without scrolling",
      "acceptanceCriteria": [
        "Patient cards on the Dashboard are visibly more compact than before",
        "Card content (patient name, species icon, task count, etc.) remains readable",
        "Multiple cards fit in the viewport without scrolling on a standard desktop screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Reduce the grid gap between cards and adjust the card container layout to accommodate more compact cards. Update grid-cols classes to show more cards per row on larger screens."
        },
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Reduce card padding, decrease font sizes for all text elements (patient name, species, MRN, owner, task count), and reduce the overall card height. Maintain readability while making the card significantly more compact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Relocate the '+ New Case' button from page-level to the top navigation header, positioned left of the Dashboard button",
      "acceptanceCriteria": [
        "The '+ New Case' button appears in the top navigation/header bar on all authenticated views",
        "The button is positioned to the left of the Dashboard nav button",
        "Clicking '+ New Case' from the header opens the new case dialog/form as before",
        "The button is no longer rendered in its previous location (e.g., page-level header of the Dashboard or Cases list)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add the '+ New Case' button to the top navigation bar within the authenticated header section. Position it to the left of the Dashboard nav button. Wire it to call handleNewCase to open the CaseFormDialog. Ensure the button is visible on all authenticated views (dashboard, cases, settings)."
        },
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Remove the '+ New Case' button from the DashboardView page-level header since it now lives in the top navigation. Keep all other controls (search, filters, export) in their current positions."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Remove the '+ New Case' button from the CasesListView page-level header since it now lives in the top navigation. Keep all other controls (search, filters, sort) in their current positions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace species text labels with colored animal silhouette icons on patient cards",
      "acceptanceCriteria": [
        "Patient cards display a colored animal silhouette icon instead of the text label 'Canine', 'Feline', or 'Other'",
        "Dog silhouette is shown for Canine cases, cat silhouette for Feline cases",
        "A random animal silhouette is shown for Other species cases",
        "Each species icon uses a visually distinct color",
        "Icons are appropriately sized within the compact card layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Replace the species text label with an <img> element that displays the appropriate silhouette icon based on species. For Canine, use frontend/public/assets/generated/dog-silhouette.dim_64x64.png. For Feline, use frontend/public/assets/generated/cat-silhouette.dim_64x64.png. For Other, use frontend/public/assets/generated/other-animal-silhouette.dim_64x64.png. Size the icons appropriately for the compact card (e.g., 24x24 or 32x32 pixels). The images are already colored (amber/orange for dog, teal/green for cat, lavender/purple for rabbit)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Include completed cases in the previous-case search within the New Case form",
      "acceptanceCriteria": [
        "The previous-case lookup in the New Case form returns cases regardless of task completion status",
        "Cases where every task is marked complete are included in search/autocomplete results",
        "Existing search matching logic (by MRN, pet name, owner, etc.) is otherwise unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Update the MRN-based previous-case lookup logic to remove any filtering that excludes cases where all tasks are completed. Ensure that the searchCasesByMedicalRecordNumber results and any autocomplete/dropdown for selecting prior cases include fully completed cases. The filtering logic in filtering.ts (excludeFullyCompleted) should not be applied during the New Case form search."
        }
      ]
    }
  ]
}