{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Diagnose and fix frontend data-fetching failure for surgery cases",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Audit and fix useQueries.ts to resolve surgery case fetch failures",
      "acceptanceCriteria": [
        "Query hooks only execute when a valid actor instance is available (enabled guard)",
        "Method names called on the actor exactly match the names exported by backend main.mo",
        "Fetch errors are surfaced visibly (not silently caught and discarded)",
        "Cases load successfully on both DashboardView and CasesListView after login"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit all React Query hooks that fetch surgery cases (useGetAllCases, useGetDashboard, useGetCase, etc.). Verify that each query has an enabled guard checking both `!!actor` and `!actorFetching` to prevent queries from running with undefined/null actors. Confirm method names called on the actor match backend interface exactly (getAllCases, getDashboard, getCase). Add explicit error logging and ensure errors are not silently swallowed. Return proper loading states that reflect actor dependency (isLoading should include actorFetching). Follow the pattern shown in authorization component usage for preventing modal flash."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Audit DashboardView and CasesListView to fix case rendering and error handling",
      "acceptanceCriteria": [
        "DashboardView renders case cards when data is returned from the query hook",
        "CasesListView renders case cards when data is returned from the query hook",
        "Loading spinners/skeletons are shown while fetching and removed once data arrives",
        "Error states display a user-facing message when the fetch fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Audit how DashboardView consumes the useGetAllCases and useGetDashboard query hooks. Verify that loading state checks include both `isLoading` and `isFetching` from the query result. Ensure error states are rendered with user-visible messages when queries fail. Check that case data rendering handles empty arrays gracefully and doesn't fail on null/undefined checks. Verify that the component properly waits for both actor initialization and data fetch completion before attempting to render case cards."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Audit how CasesListView consumes the useGetAllCases query hook. Verify that loading state checks include both `isLoading` and `isFetching` from the query result. Ensure error states are rendered with user-visible messages (not just console logs) when the query fails. Check that case filtering, searching, and sorting logic properly handles undefined/null data before processing. Verify that empty state, loading skeletons, and error UI are all properly wired and displayed at the correct times. Ensure the component waits for actor initialization before attempting data operations."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Audit useActor.ts to verify correct actor initialization and identity handling",
      "acceptanceCriteria": [
        "Actor is initialized with the authenticated identity before any case-fetch query runs",
        "Actor is refreshed/reinitialised when the user's identity changes",
        "useQueries hooks receive a non-null actor instance when the user is authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Audit the actor initialization logic to confirm it properly creates a backend actor using the current Internet Identity principal from useInternetIdentity. Verify that the actor is recreated when identity changes (proper useEffect dependency on identity). Check that isFetching state accurately reflects actor initialization progress and is false only when actor is fully ready. Ensure queryClient.invalidateQueries is called when identity changes to force dependent queries to refetch with the new actor. Verify there are no race conditions where queries attempt to use the actor before it is initialized. Confirm the actor instance is not stale or cached incorrectly across identity changes."
        }
      ]
    }
  ]
}