{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert Cases data-fetching logic to Version 93",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revert the data-fetching logic for surgery cases in the frontend to the implementation from Version 93, restoring case visibility on both Dashboard and Cases list views",
      "acceptanceCriteria": [
        "Surgery cases appear correctly on the Dashboard view after login.",
        "Surgery cases appear correctly on the Cases list view after login.",
        "The data-fetching hooks/queries used for cases match the approach from Version 93, not Version 97.",
        "No regression is introduced to other views or features."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Revert the getAllCases query implementation to Version 93 approach. Ensure the query is properly enabled when the actor is available and the user is authenticated. Restore any query configuration options (staleTime, cacheTime, refetchOnMount) that were present in Version 93 but removed or changed in Version 97. Verify the query key structure matches Version 93."
        },
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Revert the data-fetching integration in DashboardView to Version 93 approach. Restore how the getAllCases query result is consumed, including proper handling of loading states, error states, and the data transformation pipeline. Ensure cases are passed correctly to child components and that filtering/sorting logic matches Version 93 implementation."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Revert the data-fetching integration in CasesListView to Version 93 approach. Restore how the getAllCases query result is consumed, including proper handling of loading states, error states, and the data transformation pipeline. Ensure cases flow correctly through the search, filter, sort, and pagination logic as implemented in Version 93."
        }
      ]
    }
  ]
}