{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project with a case management feature. Cases are fetched from a backend canister and were working in Version 87 but broke sometime between Version 87 and Version 91.",
  "architectural_notes": [
    "Cases are fetched from a backend canister (not local state or external API)"
  ],
  "known_issues": [
    "Cases not showing in live app after Version 91 deploy; worked in Version 87 — likely a data fetching regression in the canister query logic"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-audit-the-frontend-react-query-hooks-in-frontend-src-hooks-usequeries-ts-that-fetch-surgery-cases-from-the-backend-canister-compare-the-current-query-key-structure-actor-call-method-names-response-transformation-and-error-handling-against-what-was-present-in-version-87-restore-any-logic-that-regressed-between-version-87-and-version-91-that-would-cause-cases-to-silently-fail-to-load-or-render-as-empty",
      "title": "Audit the frontend React Query hooks in `frontend/src/hooks/useQueries.ts` that fetch surgery cases from the backend canister. Compare the current query key structure, actor call method names, response transformation, and error handling against what was present in Version 87. Restore any logic that regressed between Version 87 and Version 91 that would cause cases to silently fail to load or render as empty.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Audit the backend canister query function(s) responsible for fetching surgery cases (e.g., getCases, getSurgeryCases, or equivalent) and compare the current implementation against the Version 87 state. Identify any changes to query logic, access control (role-based authorization via MixinAuthorization), data filters, or return types that could cause cases to be excluded or return an empty result for authenticated users in the live environment.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "SurgiPaw",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}