{
  "backend/main.mo": "Main Motoko actor defining surgery case management system with types (Species, Sex, Checklist, SurgeryCase, UserProfile), CRUD operations for cases and user profiles, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing custom favicon link from frontend/index.html and removing generated icon/logo files from frontend/public/assets/generated directory.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including App.tsx (main component with auth and light mode enforcement), hooks, case management components, CSV import/export, validation, search, and UI utilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI components (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point with light color scheme enforcement, \"Surgery Case Log\" title, and root div for React mounting; no custom favicon link present.",
  "frontend/src/App.tsx": "Main React component managing authentication flow with Internet Identity, profile setup modal, case list view, forced light theme via ThemeProvider, and MutationObserver to prevent dark mode class application.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and primary/outline button styling based on authentication state.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup prompting for name input on initial login with form validation and toast notifications.",
  "frontend/src/features/cases/checklist.ts": "Checklist configuration defining seven items (discharge notes, pDVM notified, labs, histo, surgery report, imaging, culture) with default states and utility functions for default checklist creation and filtering remaining items.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case as a card with patient details, checklist tasks, and actions (edit, delete). Handles task completion and case deletion with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Modal dialog for creating/editing surgery cases with form fields, AI-powered structured text parsing, MRN-based auto-prefill, and checklist management. Tracks user-edited fields to avoid overwriting manual changes.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases in a grid, provides search functionality, and includes buttons for creating new cases and CSV import/export.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering surgery cases by any field.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Reusable component for editing a surgery case checklist with checkboxes for each task item.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides buttons for exporting cases to CSV and importing cases from CSV files, handling file selection and batch create/update operations.",
  "frontend/src/features/cases/components/DateField.tsx": "Date input component combining a native date input with a calendar popover picker, handling date parsing and formatting in YYYY-MM-DD format.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including validation, error handling, and matching existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers and TypeScript types for CSV row structure used in case import/export.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured label:value text (e.g., 'MRN: 12345') into a partial CaseFormData object, extracting fields like MRN, arrival date, pet name, owner name, species, sex, breed, DOB, and presenting complaint using regex matching with label variations.",
  "frontend/src/features/cases/search.ts": "Filters surgery cases by a search query, matching against text fields (MRN, pet name, owner, breed, complaint, notes), species/sex labels, formatted dates, and checklist item labels.",
  "frontend/src/features/cases/types.ts": "Defines constants for species and sex options, and the CaseFormData interface containing all case form fields including medical record number, dates, pet/owner info, and presenting complaint.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validators, species/sex parsers with fuzzy matching, and date parsing supporting ISO and slash-separated formats.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profile management and CRUD operations for surgery cases (get all, get by MRN, create, update, delete).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme with white surfaces, blue accents for patient names, and orange styling for presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient provider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography, container queries, animations, and design tokens for a component library.",
  "project_state.json": "Project state metadata tracking two completed features: removing custom favicon link from index.html and deleting generated icon/logo files from the assets directory."
}