{
  "backend/main.mo": "Main actor defining SurgeryCase types, user profiles, OpenAI config, and CRUD operations for cases with access control via MixinAuthorization; includes migration support and permission checks on all endpoints.",
  "backend/migration.mo": "Migration module that transforms old actor state (with basic OpenAIConfig) to new state (with initialized flag), preserving cases and nextId while upgrading the config structure.",
  "feature_evidence.json": "Feature evidence report documenting three features related to fixing backend actor initialization issues, adding error boundaries with retry mechanisms, and ensuring CaseFormDialog waits for actor availability.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including App.tsx, hooks, auth components, case management views, forms, CSV import/export, and validation logic with actor availability checks.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI components, charts, sidebar, and design tokens using oklch color space.",
  "frontend/index.html": "HTML entry point with PWA manifest links, favicons, theme color configuration, and forced light color scheme for the Surgery Case Log application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode (standalone), theme colors, and categorization for the Surgery Case Log application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping caching for Internet Identity and API calls.",
  "frontend/src/App.tsx": "Root component managing authentication flow, actor availability checks with loading states and retry mechanism, profile setup modal, view switching between cases and settings, and forced light theme enforcement.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication and clears the query cache on logout.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves it to their profile using the useSaveCallerUserProfile hook.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with utilities to get default checklist state, remaining items, and task counts.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case as a card with patient details, remaining checklist tasks, and actions to edit, delete, or toggle task completion.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating or editing surgery cases with fields for patient/owner info, AI-powered structured text parsing, MRN-based auto-prefill, and checklist editing.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases with search, sort, species/task filters, and CSV import/export functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sort order using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species, persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to select checklist task types to filter surgery cases by incomplete tasks, with session storage persistence and an active filter count badge.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A form component that renders checkboxes for all checklist items (discharge notes, labs, imaging, histo, culture, surgery report, PDVM notified) with optional disabled state.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A component providing CSV export and import functionality for surgery cases, with progress tracking, error display, and backend synchronization via create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component combining a text field (MM/DD/YYYY format) with a calendar popover picker for flexible date entry.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including date/enum formatting, field escaping, row parsing, validation, and matching with existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery case import/export with header names, type definitions, validation constants, and documentation for date/boolean/enum formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species and incomplete task types, plus a combined filter/sort pipeline function.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l), removing artifacts, and cleaning punctuation.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses semi-structured text in label:value format to extract case information fields (MRN, pet name, dates, species, etc.) and returns a partial CaseFormData object, serving as a fallback for AI responses and Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query strings against text fields, species/sex labels, dates, and checklist item names.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file placeholder for AI image analysis service functionality.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with four options: arrival date (newest/oldest) and open tasks count (most/fewest), with secondary sorting by arrival date for stability.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case form data, including species options (canine/feline/other) and sex options (male/female with neutered/spayed variants).",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validation, species/sex parsing with flexible string matching, and date parsing supporting multiple formats (M/D/YYYY, ISO, etc.).",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for the settings page that allows users to configure and save their OpenAI API key, displaying validation status and providing secure input with show/hide toggle.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, OpenAI configuration, and surgery case management, all using the actor from useActor hook with proper loading states and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including specific colors for patient names and presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for the Tesseract.js OCR library, including worker options, recognition results, and text extraction data structures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH format, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking known issues with backend actor initialization preventing case addition, existing features for error handling, and pending feature requests for actor recreation on authentication changes."
}