{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, TaskOptions, UserProfile, and OpenAIConfig types with CRUD operations for cases and user profiles, plus authorization mixins for admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: microphone button UI placement, Web Speech API voice recording toggle, and automatic speech-to-text transcription into the Quick Fill input box.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, types, validation, search, and CSV import/export functionality with detailed descriptions of case management, task tracking, and voice recording features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon links, theme color meta tags, and Apple mobile web app configuration for the SurgiPaw application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode, theme colors, and start URL for SurgiPaw veterinary surgery case management application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping caching for Internet Identity and API calls.",
  "frontend/src/App.tsx": "Main app component with Internet Identity authentication, view routing between dashboard/cases/settings, profile setup modal, navigation buttons, and forced light theme with dark class prevention.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout, error handling for duplicate authentication, and primary/outline button styling based on auth state.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name during initial profile setup, with form validation and mutation handling via useSaveCallerUserProfile hook.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file, no content.",
  "frontend/src/features/auth/validation.ts": "Empty file, no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with configuration for task selection/completion fields, default values, colors, and utility functions for counting and filtering tasks.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file, no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist with color-coded badges, edit/delete actions, and inline task completion toggling with optimistic updates.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog for creating/editing surgery cases with fields for patient info, AI-powered structured text parsing, speech recognition support, MRN-based case lookup for prefilling, and task checklist editor.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays filtered, sorted, and searchable list of surgery cases with controls for species/task filtering, CSV import/export, and handles case selection with scroll-to-highlight behavior.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with search icon and clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sort order using predefined sort options from the sorting module.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for selecting species to filter cases, persists selections to session storage, and shows active filter count badge.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to filter cases by task types and completion status, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with both manual text entry (MM/DD/YYYY format with auto-formatting) and calendar picker, supporting auto-advance on completion and validation.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, handles parsing, validation, and matching with existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case data, including headers, validation constants, and documentation for expected formats and field mappings.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, task completion status, and whether all tasks are completed or not.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "React hook that wraps the browser's Web Speech Recognition API to provide voice-to-text transcription with error handling and browser compatibility checks.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts; serves as fallback for cleaning semi-structured AI responses.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text to extract case information fields (MRN, owner, pet name, dates, species, sex, breed, complaint) into a CaseFormData object; used as fallback for AI responses and Quick Fill feature.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with remaining tasks using browser's native print functionality via a hidden iframe, without external dependencies.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases including their details and remaining tasks, with proper CSV field escaping.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display: converts Time (bigint nanoseconds) to MM/DD/YYYY strings, Species/Sex enums to readable text, and formats task lists.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV reports: converts Time (bigint nanoseconds) to MM/DD/YYYY strings and Species/Sex enums to readable text.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query strings against basic fields (MRN, pet name, owner, species, breed, sex, complaint, notes) and incomplete checklist tasks.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for future AI image analysis service implementation.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with options for arrival date (newest/oldest) and open task count (most/fewest), using checklist item counts for task-based sorting.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms, including species options (canine, feline, other), sex options (male, female, neutered/spayed variants), and the CaseFormData interface.",
  "frontend/src/features/cases/validation.ts": "Contains validation and parsing functions for case form fields including required field validation, species/sex parsing with flexible string matching, boolean parsing, and date validation with string parsing support.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays a filterable, searchable, and sortable list of surgery cases with task badges, species indicators, and navigation to individual cases; includes PDF generation and task filtering capabilities.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions for extracting open tasks from surgery cases and calculating total open task counts across multiple cases using checklist item data.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout and cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login status, identity state, and AuthClient lifecycle with configurable options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for surgery case CRUD operations (getAllCases, getCaseByMedicalRecordNumber, createCase, updateCase) and user profile management, using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including specialized colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library, including Worker interface, recognition options, result structures, and enums for page segmentation modes and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, border radius variables, Inter font family, and including animate and typography plugins.",
  "project_state.json": "Project state metadata for SurgiPaw application tracking features including authentication, project restoration from version 67, and voice recording for Quick Fill functionality using Web Speech API."
}