{
  "backend/main.mo": "Main Motoko actor defining surgery case management system with types (Species, Sex, Checklist, SurgeryCase, UserProfile), CRUD operations for cases and user profiles, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of app logo/favicon with a custom image (image.png) showing a black dog and orange cat with surgical scalpel on blue background.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components for authentication, case management, CSV import/export, search, validation, and UI styling with forced light mode and custom color tokens.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, borders, and component-specific tokens.",
  "frontend/index.html": "HTML entry point with forced light color scheme, Surgery Case Log title, custom favicon reference to /assets/image.png, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component managing authentication flow with Internet Identity, profile setup modal for new users, case list view for authenticated users, forced light theme via ThemeProvider, and MutationObserver to prevent dark mode class application.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and primary/outline button styling based on authentication state.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog prompting first-time users to enter their name for profile creation with form validation and toast notifications.",
  "frontend/src/features/cases/checklist.ts": "Checklist configuration defining seven items (Discharge Notes, pDVM Notified, Labs, Histo, Surgery Report, Imaging, Culture) with default states and utility functions for default checklist and filtering remaining items.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case as a card with patient details, checklist tasks, and action buttons (edit, delete). Handles task completion and case deletion with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Modal dialog for creating/editing surgery cases with form fields, AI-powered structured text parsing, MRN-based auto-prefill, and checklist editing. Tracks user-edited fields to avoid overwriting manual changes.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases in a grid layout with search functionality, CSV import/export, and a button to create new cases.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon that filters cases by any field value.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a list of checkboxes for surgery case checklist items, allowing users to toggle task completion states.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides buttons to export cases to CSV and import cases from CSV files, handling file selection, parsing, and batch create/update operations.",
  "frontend/src/features/cases/components/DateField.tsx": "Date input component combining a native date input with a calendar popover, handling date parsing and formatting in YYYY-MM-DD format.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export/import logic for surgery cases, including data serialization, parsing, validation, and matching with existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers and TypeScript types for surgery case CSV import/export operations.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format (e.g., 'MRN: 12345') to extract case information fields like medical record number, dates, pet/owner names, species, sex, breed, and presenting complaint into a partial CaseFormData object.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching a query string against text fields (MRN, names, breed, complaint, notes), species/sex labels, dates, and checklist item names.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms, including SPECIES_OPTIONS (canine/feline/other), SEX_OPTIONS (male/female with neutered/spayed variants), and the CaseFormData interface with all case fields.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validators, species/sex parsers that handle various input formats, and date parsing supporting ISO and slash-separated formats.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing it with Internet Identity when available and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms), useful for delaying expensive operations like search queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profile management (get/save), case CRUD operations (get all, get by MRN, create, update, delete) with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme with white surfaces, including specific colors for patient names (blue) and presenting complaints (orange).",
  "frontend/src/lib/utils.ts": "Utility function 'cn' that combines clsx and tailwind-merge to merge Tailwind CSS class names while handling conflicts.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient provider and InternetIdentity provider wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom design tokens for a component library.",
  "project_state.json": "Project metadata tracking the Surgery Case Log app state, including a completed feature to replace the app logo/favicon with a custom image of a black dog and orange cat."
}