{
  "backend/main.mo": "Motoko actor managing user profiles and surgery cases with access control, providing CRUD operations and permission‑checked queries.",
  "feature_evidence.json": "Feature evidence report linking UI light‑mode enforcement and theme‑fix changes to specific files and components.",
  "frontend-file-summaries.txt": "Auto‑generated summaries describing each frontend file’s purpose, including theme logic, case management, and UI components.",
  "frontend/index.css": "Global Tailwind/OKLCH CSS variables defining light and dark theme tokens with base element styling.",
  "frontend/index.html": "HTML entry point enforcing light color scheme and loading the React app.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, case list view, and forced light mode via ThemeProvider and MutationObserver.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and simple UI.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal for first‑time user profile creation with name input and mutation handling.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items, defaults, and helper to compute remaining items.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with pet details, checklist actions, and edit/delete dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating or editing a surgery case with validation and checklist editing.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Shows the full list of surgery cases with search, CSV import/export, and create-case dialog.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component for filtering surgery cases.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders editable checklist items for a surgery case.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Handles exporting cases to CSV and importing cases from CSV with error reporting.",
  "frontend/src/features/cases/components/DateField.tsx": "Date input component combining text input and calendar popover.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including validation.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines CSV column headers and row type for surgery case CSV operations.",
  "frontend/src/features/cases/search.ts": "Implements full‑text search over SurgeryCase fields including text, species/sex labels, dates, and checked checklist items.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData and provides species and sex option lists used in forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation, parsing, formatting, date conversion utilities, and age calculation for case fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, identity loading, and provides context for authentication.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles and CRUD operations on cases and checklists.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theme colors and layout.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge and dedupe class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color tokens, container settings, extended animations, and typography/container/animation plugins.",
  "project_state.json": "Defines project metadata, known issues about theme colors not applying, and feature requests related to enforcing light mode."
}