{
  "backend/main.mo": "Main actor defining SurgeryCase data types with CompletedTasks (replacing Checklist), user profiles, OpenAI config, and CRUD operations for cases with authorization checks via MixinAuthorization.",
  "backend/migration.mo": "Migration module that transforms old SurgeryCase records with 'checklist' field to new records with 'completedTasks' field while preserving all other data.",
  "feature_evidence.json": "Feature evidence report documenting three implemented requirements: task checkboxes in case creation form with defaults, storing only checked tasks in case data, and displaying only selected tasks on case cards.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files showing completedTasks usage throughout, ChecklistEditor with creation/completion modes, and CSV import/export with task handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and component styling tokens.",
  "frontend/index.html": "HTML entry point with PWA manifest links, favicon references, theme color meta tags, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, theme colors, and categories for Surgery Case Log application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell, skipping Internet Identity and API calls, with runtime caching for JS/CSS/images.",
  "frontend/src/App.tsx": "Root component managing authentication flow, actor initialization, profile setup modal, view switching between cases/settings, admin-only settings access, and forced light theme with retry logic for actor failures.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication and clears the query cache on logout.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name during initial profile setup, with form validation and error handling.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items for surgery case tasks (discharge notes, labs, imaging, etc.) with utilities to get default selections, remaining items, and task counts.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Card component displaying surgery case details with edit/delete actions and checkboxes for completing remaining tasks.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with AI-powered text parsing, MRN lookup for auto-prefill, and task checklist management.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component for displaying surgery cases with search, sort, species/task filters, and CSV import/export functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sorting options (by arrival date, pet name, etc.).",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species, persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to select task types to filter surgery cases by incomplete tasks, with session storage persistence and an active filter count badge.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that renders checkboxes for CompletedTasks fields, supporting both creation and completion modes with optional default indicators.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component that handles CSV export of surgery cases and CSV import with progress tracking, error reporting, and backend synchronization via create/update mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component combining a text field (MM/DD/YYYY format) with a calendar popover picker for flexible date entry.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including parsing, validation, boolean conversion, and matching against existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery case import/export with headers, types, validation constants, and detailed documentation of expected formats and field mappings.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species and incomplete task types, plus a combined filter/sort pipeline function.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l), and removing artifacts as a fallback for AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses semi-structured text (label:value format) into CaseFormData fields, serving as a fallback for AI responses and Quick Fill feature. Includes extensive logging and handles various field patterns for medical records, pet info, dates, species, and sex.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by query string across multiple fields including medical record number, pet/owner names, species, sex, dates, breed, complaints, notes, and incomplete checklist items.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file placeholder for AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with four options: arrival date (newest/oldest) and open tasks count (most/fewest), with secondary sorting by arrival date for stability.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms including Species and Sex options, and the CaseFormData interface with fields for medical records, pet info, dates, and complaints.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validation, species/sex parsing with flexible string matching, and date parsing supporting multiple formats (M/D/YYYY, ISO, etc.).",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for application settings page that allows users to configure and validate OpenAI API key for AI-powered document scanning and data extraction features.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, and updating cases with comprehensive logging and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including custom colors for patient names and presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for the Tesseract.js OCR library, including worker options, recognition results, and text structure interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking the medical case management app's architecture, features for task checklist management during case creation, and pending feature requests for task display."
}