{
  "backend/main.mo": "Motoko canister defining surgery case types, checklist defaults, user profiles, and authorized CRUD/query methods for cases and profiles.",
  "feature_evidence.json": "Report mapping implemented features to source files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme color variables and applying global background and text styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup flow, and rendering the case list view within themed layout.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing and login retry logic.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save their name, with validation and success/error toasts.",
  "frontend/src/features/cases/checklist.ts": "Defines the seven checklist items with defaults and provides helpers to generate default checklists and remaining tasks.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with key details, remaining tasks, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Provides a dialog for creating or editing a surgery case with validation and checklist editing.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Lists all surgery cases with search, CSV import/export, and a dialog for creating new cases.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Simple search input component for filtering surgery cases.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders editable checklist items for a surgery case.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Handles exporting cases to CSV and importing cases from CSV with validation and save logic.",
  "frontend/src/features/cases/components/DateField.tsx": "Reusable date input with calendar popover selection.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including parsing, validation, and mapping.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV headers and row structure for case import/export.",
  "frontend/src/features/cases/search.ts": "Filters SurgeryCase items by matching text fields, species/sex labels, dates, and incomplete checklist items against a query.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData and provides species and sex option lists for case creation/editing.",
  "frontend/src/features/cases/validation.ts": "Implements validation and date parsing/formatting helpers for case fields including species, sex, and dates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and auth client creation.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching and mutating user profiles and surgery cases.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark blue‑themed UI styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind and clsx class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with InternetIdentityProvider and React Query setup.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration enabling dark mode, custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "JSON describing the app’s project state, including summary, features, architectural notes, and pending feature requests."
}