{
  "backend/main.mo": "Main backend actor defining SurgeryCase, Task, and TaskOptions types, managing cases and user profiles with Map storage, implementing access control with authorization mixins, and providing CRUD operations for cases with task management.",
  "feature_evidence.json": "Feature evidence report documenting two features: making dashboard task groups clickable to navigate to specific case cards, and adding visual affordances to indicate clickability.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React components covering authentication, case management, dashboard, search/filter, CSV import/export, task checklists, and navigation with selectedCaseId tracking.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, borders, and component-specific tokens.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicons, theme color, and viewport configuration for the SurgiPaw application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode, theme colors, and start URL for SurgiPaw.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell, excluding Internet Identity and API calls from caching, with runtime cache management.",
  "frontend/src/App.tsx": "Main app component managing authentication flow, view switching between dashboard/cases/settings, profile setup modal, admin access control, and navigation with selectedCaseId state for highlighting specific cases.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and default/outline button styling based on authentication state.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that prompts for a name and saves it using the useSaveCallerUserProfile hook. Prevents closing until profile is created.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, pDVM notified, labs, histo, surgery report, imaging, culture) with their task field mappings, colors, and utility functions for calculating task completion status.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist management, and delete functionality. Shows case details like pet info, arrival date, and remaining tasks with color-coded badges.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating or editing surgery cases with fields for medical record number, pet details, dates, and task selection. Includes AI-powered structured text parsing and auto-prefill from existing cases by MRN.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays all surgery cases with search, sort, species/task filtering, and CSV import/export. Handles case selection, highlighting, and scrolling to specific cases.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with a search icon for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases using predefined sort options from the sorting module.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species (canine, feline, avian, exotic). Persists selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to select task types to filter surgery cases by incomplete tasks, with state persisted to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks to track) and completion mode (marking tasks as done), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones by medical record number.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that auto-formats MM/DD/YYYY input, validates dates, and auto-advances to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, validates data, matches existing cases by medical record number, and returns structured errors for invalid rows.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery case import/export, including headers, validation constants for species/sex/boolean values, and documentation of expected formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions to filter surgery cases by species and by incomplete task types based on checklist item selections.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as a fallback for cleaning semi-structured text from AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text into CaseFormData by matching field patterns and applying type-specific parsing (species, sex, dates). Serves as fallback for AI responses and powers the Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Filters surgery cases by query string, searching across basic fields (MRN, pet name, owner, species, breed, sex, complaint, notes) and checklist items that are selected but not completed.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file for AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases by arrival date (newest/oldest) or open task count (most/fewest), with predefined sort options.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData interface and constants for species and sex options used throughout the case management feature.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field checks, species/sex parsing with fuzzy matching, boolean parsing, and date validation.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Displays dashboard overview with total open tasks count and grouped task details by case, allowing navigation to individual cases on click.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Calculates open tasks from surgery cases by checking checklist items that are selected but not completed, returning structured task information with case details.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings UI for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, updating, and deleting cases with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including specialized colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for the Tesseract.js OCR library, including worker interfaces, recognition results, and configuration options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, border radius variables, Inter font family, and enabling dark mode class strategy with animation and typography plugins.",
  "project_state.json": "Project state file for SurgiPaw tracking two completed features for making dashboard task groups clickable and navigable to case cards, plus one pending feature request for direct case card access from Dashboard view."
}