{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, TaskOptions, UserProfile, and OpenAIConfig types; provides CRUD operations for cases and user profiles with role-based access control (admin/user permissions) via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: placeholder text in Quick Fill box, automatic voice recording parsing to populate case fields, and enhanced parseStructuredText function for extracting nine veterinary case fields.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including App.tsx, hooks, case management components (CaseFormDialog with Quick Fill and voice recording, CaseCard, CasesListView), validation/parsing utilities, and CSV import/export functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, favicon links in multiple sizes, manifest reference, apple-touch-icon configuration, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app name 'SurgiPaw', standalone display mode, theme colors, and icon references for 192x192 and 512x512 sizes with maskable purpose.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping caching for Internet Identity flows and API calls.",
  "frontend/src/App.tsx": "Main application component with Internet Identity authentication, view switching between dashboard/cases/settings, navigation buttons, profile setup modal, admin-only settings access, case navigation from dashboard, and forced light theme enforcement.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file (no content).",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file (no content).",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout, error handling for duplicate authentication, and primary/outline button styling based on auth state.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file (no content).",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file (no content).",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, using a non-dismissible dialog that calls useSaveCallerUserProfile mutation.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, pDVM notified, labs, histo, surgery report, imaging, culture) with their selection/completion states, default values, colors, and utility functions for filtering and counting tasks.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist with color-coded badges, edit/delete actions, and uses mutations for updating notes, tasks, and deleting cases.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, arrival date, presenting complaint, task checklist, AI-powered structured text parsing, speech recognition support, and MRN-based case lookup for prefilling.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered/sorted surgery cases with search, species filter, task filter, sort controls, CSV import/export, and handles case selection/highlighting with scroll-to functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with search icon and clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases using predefined sort options from the sorting module.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species (canine, feline, avian, exotic), persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for cases that allows filtering by task types and completed tasks, with state persisted to session storage and a badge showing active filter count.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks to assign) and completion mode (marking assigned tasks as done), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones by medical record number.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with both text input (MM/DD/YYYY format with auto-formatting) and calendar picker, featuring auto-advance on complete date entry and validation on blur.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, validates data, parses fields, and matches imported cases to existing records by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case import/export, including headers, validation constants, and documentation for date formats, boolean values, species, and sex values.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, and completion status. Includes logic to filter cases with incomplete selected tasks and to exclude fully completed cases.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "React hook that wraps the browser's Web Speech API for voice-to-text transcription. Handles recording state, transcript accumulation, error handling, and browser compatibility checks.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as a fallback for cleaning semi-structured text.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields like MRN, owner name, pet name, dates, species, and sex. Enhanced to handle voice dictation variations and natural language patterns.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with remaining tasks using the browser's native print functionality via a hidden iframe. Creates an HTML table with case details formatted for landscape printing.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases with their remaining tasks. Includes proper CSV field escaping and creates a timestamped filename for the download.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display including date conversion from bigint nanoseconds to MM/DD/YYYY, species/sex enum to readable text, text truncation, and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV report display including date conversion from bigint nanoseconds to MM/DD/YYYY and species/sex enum to readable text strings.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query strings against basic fields (MRN, pet name, owner, species, breed, sex, complaint, notes) and incomplete checklist tasks.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for future AI image analysis service implementation.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with options for arrival date (newest/oldest) and open task count (most/fewest), using checklist item counts for task-based sorting.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms including species options (canine/feline/other), sex options (male/female with neutered/spayed variants), and the CaseFormData interface.",
  "frontend/src/features/cases/validation.ts": "Contains validation and parsing functions for case form fields including required field validation, species/sex parsing with flexible string matching, boolean parsing, and date validation/parsing utilities.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays a filterable, searchable, and sortable list of surgery cases with task badges, species indicators, and navigation to individual cases; includes PDF export functionality.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open tasks from surgery cases and calculate total open task counts across multiple cases using the checklist items system.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Simple React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout and cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login status, identity state, and AuthClient lifecycle with configurable options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for surgery case CRUD operations (getAllCases, getCaseByMedicalRecordNumber, createCase, updateCase) using the actor from useActor hook with query invalidation and retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specialized colors for patient names, species fields, presenting complaints, and notes sections.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable module types.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf module types.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library including Worker interface, recognition options, result structures, and enums for page segmentation modes and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both standard query strings and hash-based routing with parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom color variables using OKLCH color space, border radius variables, Inter font family, and plugins for animations and typography.",
  "project_state.json": "Project state file for SurgiPaw veterinary case management system documenting voice-to-text Quick Fill feature with structured data extraction, existing features for placeholder text and audio parsing, and pending feature requests."
}