{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, TaskOptions, UserProfile, and OpenAIConfig types with CRUD operations for cases, user profiles, and access control using MixinAuthorization; includes dashboard query for open tasks count.",
  "feature_evidence.json": "Feature evidence report mapping three features (voice recording fix, parse-and-fill button fix, and date parsing enhancement) to their implementation files and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend TypeScript/React files covering authentication, case management, validation, search, CSV import/export, and UI components with Task/TaskOptions type usage details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon links, theme color meta tags, and Apple mobile web app configuration for the SurgiPaw application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode (standalone), theme colors, and start URL for SurgiPaw veterinary surgery case management app.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets with precaching of app shell, runtime caching for JS/CSS/images, and exclusion of Internet Identity and API calls from caching.",
  "frontend/src/App.tsx": "Main React app component with Internet Identity authentication, view routing (dashboard/cases/settings), profile setup modal, admin-only settings access, case navigation from dashboard, and forced light theme enforcement.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout, error handling for duplicate authentication, and primary/outline button styling based on auth state.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, using a form with validation and mutation hook to save the profile.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with configuration for task selection/completion fields, default values, colors, and utility functions to calculate task progress and styling.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist with color-coded badges, edit/delete actions, and handles task completion updates with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, AI-powered text parsing, speech recognition, MRN-based case lookup for prefilling, and task checklist configuration.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered and sorted surgery cases with search, species/task filters, CSV import/export, and handles case selection with scroll-to-highlight behavior.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with search icon and clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases using predefined sort options with an icon indicator.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter with checkboxes for selecting species to filter cases, persists selections to session storage, and shows active filter count badge.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for filtering cases by task types and completion status, with session storage persistence and a badge showing active filter count.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that formats dates as MM/DD/YYYY, auto-inserts slashes during typing, validates input, and auto-advances to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, validates data, handles parsing errors, and matches imported cases with existing records by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case data, including headers, validation constants for species/sex/boolean values, and comprehensive documentation of expected formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, task completion status, and whether all tasks are completed or not.",
  "frontend/src/features/cases/hooks/useSpeechRecognition.ts": "React hook that wraps the browser's SpeechRecognition API to provide voice-to-text transcription with recording state, error handling, and browser compatibility checks.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts as a fallback for text cleaning.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields (MRN, owner, pet name, dates, species, sex, breed, complaint) with support for voice dictation variations.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases with remaining tasks using an iframe and the browser's native print functionality without external dependencies.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of surgery cases including all fields and remaining tasks, with proper CSV field escaping and timestamped filenames.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display, converting Time (bigint nanoseconds) to date strings and enums (Species, Sex) to readable text, plus text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV reports, converting Time (bigint nanoseconds) to date strings and enums (Species, Sex) to readable text for export.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query strings against basic fields (MRN, pet name, owner, species, etc.) and incomplete checklist tasks.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for future AI image analysis service implementation.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with options for arrival date (newest/oldest) and open task count (most/fewest), using checklist items to calculate remaining tasks.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms, including species options (canine/feline/other), sex options (male/female with neutered/spayed variants), and the CaseFormData interface.",
  "frontend/src/features/cases/validation.ts": "Contains validation functions for case form fields (MRN, pet name, owner name, breed) and utility functions for date parsing/formatting and converting between Date objects and nanosecond timestamps.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays a filterable, searchable, and sortable list of surgery cases with task status indicators, species badges, and navigation to individual cases or PDF generation.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open tasks from surgery cases and calculate total open task counts across all cases using the checklist items system.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling actor initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout and cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, and updating cases with task options and detailed logging.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including special styling for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable module.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf module.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library, including Worker interface, recognition options, result structures, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard query strings and hash-based routing with parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, border radius variables, and enabling dark mode with typography and animation plugins.",
  "project_state.json": "Project state document describing a veterinary case management application with known issues in voice recording transcription (populating wrong field) and Parse and Fill button (not extracting fields correctly)."
}