{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, and UserProfile types with CRUD operations for veterinary surgery cases, user profiles, and OpenAI configuration; includes authorization mixins for admin/user permission checks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React components covering authentication, case management with task tracking, CSV import/export, search/filter functionality, and form validation with date handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme tokens including colors for background, foreground, primary, secondary, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA manifest, multiple favicon sizes, Apple touch icons, and theme color configuration for the SurgiPaw application.",
  "frontend/public/manifest.json": "PWA manifest defining SurgiPaw as a standalone app with icons, theme colors, and display settings for installation on mobile devices.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, and skipping Internet Identity and API calls from caching.",
  "frontend/src/App.tsx": "Root application component managing view routing (dashboard/cases/settings), authentication state, profile setup modal, admin-only settings access, case navigation with highlighting, and forced light theme enforcement.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing username/password authentication with login, register, logout functions, session persistence via localStorage (remember me) or sessionStorage, and mock implementation pending backend integration.",
  "frontend/src/features/auth/components/AuthView.tsx": "Main authentication view component that toggles between login and registration forms, includes header with logo and footer with branding.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Login form component with username/password inputs, remember-me checkbox, validation, and loading states that calls the auth context login method.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Logout button component that displays username and triggers logout with query cache clearing.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for initial profile setup that prompts users to enter their name after registration.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Registration form component with username, password, and confirm password fields that validates inputs and calls the auth context register method.",
  "frontend/src/features/auth/validation.ts": "Validation utility functions for username (3-30 chars), password (8+ chars), and password matching with typed validation results.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with configuration, default selections, and utility functions for calculating task progress and styling.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Card component displaying surgery case details with editable notes, task checklist management, delete functionality, and progress tracking with color-coded task badges.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog component for creating and editing surgery cases with form fields for patient/owner details, AI-powered structured text parsing, checklist task selection, and auto-prefill from matched medical record numbers.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered and sorted surgery cases with search, species/task filters, CSV import/export, and handles case selection with scroll-to-highlight functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases by different criteria using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species, persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "Popover filter component for filtering cases by task types and completed status, with session storage persistence and active filter count badge.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Reusable checklist component that supports both creation mode (selecting tasks) and completion mode (marking tasks complete) with color-coded task items.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component providing UI for CSV import/export of surgery cases with progress tracking, error display, and batch create/update operations using mutation hooks.",
  "frontend/src/features/cases/components/DateField.tsx": "Custom date input component with calendar picker that auto-formats MM/DD/YYYY input, validates dates, and supports auto-advance to next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that parses CSV files into surgery case data, validates fields, handles updates vs. creates by matching medical record numbers, and generates downloadable CSV files.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery cases including headers, field descriptions, validation constants for species/sex/booleans, and date format specifications.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, completion status, and whether all selected tasks are completed.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l), and removing artifacts as fallback for AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses semi-structured text with label:value pairs into CaseFormData by matching field patterns, handling species/sex/date parsing, and serving as fallback for AI responses and Quick Fill feature.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases by creating a hidden iframe with styled HTML content and triggering the browser's native print dialog. Includes case details and remaining checklist tasks in a landscape-oriented table format.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases with their remaining tasks. Handles CSV field escaping for special characters and creates a timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display including date conversion from bigint nanoseconds to MM/DD/YYYY, species/sex enum to readable text conversion, text truncation, and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV reports including date conversion from bigint nanoseconds to MM/DD/YYYY and species/sex enum to readable text conversion.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query text against basic fields (MRN, names, species, etc.) and remaining checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for future AI image analysis functionality.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with options for arrival date (newest/oldest) and open task count (most/fewest), using checklist items to calculate remaining tasks.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms including species/sex options and the CaseFormData interface with all required case fields.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validation, species/sex enum parsing with flexible string matching, boolean parsing, and date validation/parsing utilities.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays surgery cases with filtering, searching, sorting, and PDF export capabilities. Shows case cards with species badges, arrival dates, and remaining tasks with icons, and includes a task filter sidebar.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions for calculating open tasks across cases, including extracting open task items from individual cases and computing total open task counts using checklist items.",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using custom hooks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login, logout, and identity management using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on surgery cases, user profiles, tasks, and OpenAI configuration, including fetching, creating, updating, and deleting data via the actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specialized colors for patient names, species, complaints, and notes fields.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable module types.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf module types.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for tesseract.js OCR library, including Worker interface, recognition options, result structures, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended font families, border radius variables, and plugins for animations and typography.",
  "project_state.json": "Project state tracking file indicating an authentication app with pending fixes for AuthProvider context wrapping issues in main.tsx causing runtime errors."
}