{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase data types, user profiles, and CRUD operations with access control; includes authorization mixin and permission checks for all operations.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: sorting control UI component, sorting logic implementation, and sort persistence across user actions.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for authentication, case management, CSV import/export, search, sorting, and validation logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with light color scheme enforcement, favicon links, and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup modal, and case list view; enforces light theme and prevents dark mode with MutationObserver.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component for Internet Identity login/logout with query cache clearing on logout and error handling for authentication state conflicts.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name input; prevents dismissal until profile is created.",
  "frontend/src/features/cases/checklist.ts": "Checklist configuration defining seven items with default states and utility functions for default checklist creation and filtering remaining tasks.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case as a card with patient details, checklist progress, and action buttons for editing and deleting. Handles checklist task completion and case deletion with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Modal dialog for creating or editing surgery cases with form fields, AI-powered structured text parsing, MRN-based auto-prefill from existing cases, and checklist management. Tracks user-edited fields to avoid overwriting manual changes during auto-prefill.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases in a grid layout with search, sort, and CSV import/export controls. Shows loading state and empty state with prompts to create the first case.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon that filters cases by any field. Controlled component that accepts value and onChange props.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for sorting cases using predefined sort options. Displays sort icon and triggers sort changes via callback.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a list of checkboxes for surgery case checklist items. Allows toggling individual checklist items and can be disabled.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides buttons for exporting cases to CSV and importing cases from CSV files. Handles file parsing, validation, and creates/updates cases via mutations with error reporting.",
  "frontend/src/features/cases/components/DateField.tsx": "Date input component combining a native date input field with a calendar popover picker. Handles date parsing, validation, and synchronization between text input and calendar selection.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Exports surgery cases to CSV format and imports cases from CSV files with validation, error handling, and duplicate detection against existing cases.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers and TypeScript type for surgery case CSV import/export operations.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields like MRN, pet name, species, dates, etc. into a CaseFormData object.",
  "frontend/src/features/cases/search.ts": "Filters surgery cases by searching across text fields, dates, species, sex labels, and checklist items using a case-insensitive query string.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases by arrival date (newest/oldest) or open task count (most/fewest) with secondary sorting by arrival date.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for species options, sex options, and the CaseFormData interface used in case forms.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case fields including medical record number, pet name, owner name, breed, species, sex, and dates with flexible format support.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms) to reduce frequent updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing surgery cases and user profiles, including queries for fetching cases and user data, and mutations for creating, updating, and deleting cases.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specific colors for patient names and presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors using OKLCH color space, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state tracking document showing implemented sorting features for case cards by arrival date and open tasks, with persistence across user actions."
}