{
  "backend/main.mo": "Main actor defining surgery case management system with types for Species, Sex, Task, SurgeryCase, UserProfile, OpenAIConfig, and Dashboard; includes CRUD operations for cases and user profiles with authorization checks via MixinAuthorization.",
  "backend/migration.mo": "Migration module with empty OldActor and NewActor types and a run function that returns an empty actor for upgrade compatibility.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: sex field display format change in CaseCard, application rebranding from 'Surgery Case Log' to 'SurgiPaw', and new Dashboard view with open tasks list and count.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering authentication, case management, dashboard, forms, validation, search, CSV import/export, task checklists, and UI components with detailed implementation notes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with SurgiPaw branding, favicon links, PWA manifest, theme color, and viewport meta tags for mobile optimization.",
  "frontend/public/manifest.json": "PWA manifest defining SurgiPaw as a standalone app with icons, theme colors, and description for veterinary surgery case tracking.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets with precaching of app shell, runtime caching for JS/CSS/images, and exclusion of Internet Identity and API calls from caching.",
  "frontend/src/App.tsx": "Main app component with Internet Identity authentication, view routing between dashboard (default), cases, and settings, profile setup modal, admin-only settings access, and forced light theme enforcement.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and retry logic for authentication errors.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that prompts for a name and saves it using useSaveCallerUserProfile hook. Prevents closing until profile is created.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, pDVM notified, labs, histo, surgery report, imaging, culture) with default selections and provides utility functions to get remaining/completed task counts.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist, and delete functionality. Supports inline editing of notes and tasks with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, arrival date, species, breed, sex, and task checklist. Includes AI-powered structured text parsing and MRN-based case lookup for auto-prefilling.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays a filterable, searchable, sortable list of surgery cases with CSV import/export and create/edit functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sort order using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species, persists selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to select task types to filter surgery cases by incomplete tasks, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that displays task items with checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete), with special styling for histo and imaging tasks.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV import/export functionality for surgery cases, handling file parsing, validation errors, and batch creation/update operations with progress tracking.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that auto-formats MM/DD/YYYY input, validates dates, and supports auto-advancing to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, validates data, handles parsing errors, and matches imported cases with existing records by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case import/export, including headers, validation constants, and documentation for date, boolean, species, and sex field formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions to filter surgery cases by species and by incomplete task types using checklist item definitions.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as fallback for cleaning semi-structured text from AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields (MRN, pet name, dates, species, etc.) into CaseFormData. Serves as fallback for AI responses and supports Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Filters surgery cases by query string, searching across basic fields (MRN, pet name, owner, species, breed, sex, complaint, notes) and remaining checklist tasks.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file for AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases by arrival date (newest/oldest) or open task count (most/fewest), with predefined sort options.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData interface and constant options for species (canine, feline, other) and sex (male, male neutered, female, female spayed).",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field checks, species/sex parsing with fuzzy matching, date validation, and boolean parsing.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Displays dashboard overview with total open tasks count and detailed list of pending tasks grouped by case, showing pet name, MRN, owner, and task labels.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Calculates open tasks from surgery cases by checking selected but incomplete checklist items, returning structured task data with case and task details.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings UI for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, updating, and deleting cases with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including specialized colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for the Tesseract.js OCR library, including Worker interface, recognition options, result structures, and enums for page segmentation modes and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and functions to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color variables, Inter font family, border radius variables, and plugins for animations and typography.",
  "project_state.json": "Project state file for SurgiPaw, a surgical case management application tracking features for sex field display formatting, application rebranding, and a dashboard view for open tasks. Contains schema version 1.0.0, three existing features, and two pending feature requests."
}