{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, and UserProfile types with CRUD operations for cases, user profiles, and OpenAI config; includes authorization mixins and access control for admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting three PDF export features: adding a PDF export button to the dashboard, formatting the PDF with all case fields, and including incomplete tasks in the PDF report.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering authentication, case management, CSV import/export, search/filter, validation, task checklists, and UI components with detailed implementation notes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, borders, and component-specific tokens.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicons, theme color, and viewport meta tags for the SurgiPaw application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, and standalone display mode for SurgiPaw veterinary surgery case tracker.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell, and skipping caching for Internet Identity and API calls.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, view routing between dashboard/cases/settings, profile setup modal, admin access control, and navigation state including case highlighting and new case dialog triggers.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and error handling for authentication state conflicts.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, preventing dismissal until profile is created.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with their selection/completion states, default values, colors, and utility functions for filtering and counting tasks.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file placeholder for camera capture functionality.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist with color-coded badges, edit/delete actions, and confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog for creating/editing surgery cases with fields for patient info, arrival date, species, breed, and AI-powered structured text parsing to auto-fill form fields.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered, sorted, and searchable surgery cases with controls for species/task filtering, CSV import/export, and case highlighting/scrolling.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases by various criteria using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component for selecting multiple species with session storage persistence and active filter count badge.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to filter cases by task types and completion status, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that formats dates as MM/DD/YYYY, auto-inserts slashes during typing, validates input, and supports auto-advancing to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, validates data, parses fields, and matches imported records with existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case data, including headers, validation constants for species/sex/boolean values, and documentation of expected formats and field mappings.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, and completion status. Includes logic to filter cases with incomplete tasks or exclude fully completed cases.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as fallback for cleaning semi-structured AI responses.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text into CaseFormData by matching field patterns and applying type-specific parsing (species, sex, dates). Serves as fallback for AI responses and Quick Fill feature.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Empty file with no content.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of all surgery cases with remaining tasks. Includes CSV field escaping and timestamp-based filename generation.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Empty file with no content.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting functions to convert Time (bigint nanoseconds) to MM/DD/YYYY strings and Species/Sex enums to readable text for CSV reports.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality across basic fields (MRN, names, species, breed, etc.) and remaining checklist tasks. Returns filtered cases matching the query string.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file with no content.",
  "frontend/src/features/cases/sorting.ts": "Defines sort options (arrival date, open tasks) and implements sorting logic for surgery cases. Includes helper to count remaining tasks per case.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData interface and constant arrays for species and sex options with their display labels.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including MRN, names, breed, species, sex, dates, and booleans with normalization and fuzzy matching logic.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays a filterable, searchable list of surgery cases with task status indicators, species badges, and navigation to individual cases. Includes PDF report generation and task filtering capabilities.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open tasks from surgery cases and calculate total open task counts across all cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component for configuring OpenAI API key with validation status display and secure input handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a changing value with configurable delay (default 500ms).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on surgery cases, user profiles, OpenAI config, and document analysis with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specialized colors for patient names, species, complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "TypeScript declaration file for jspdf-autotable library (empty placeholder).",
  "frontend/src/types/jspdf.d.ts": "TypeScript declaration file for jspdf library (empty placeholder).",
  "frontend/src/types/tesseract.d.ts": "TypeScript declaration file defining types and interfaces for the Tesseract.js OCR library, including Worker, RecognizeResult, configuration options, and text recognition data structures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography plugin, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project metadata for SurgiPaw medical case management system, tracking features including PDF export functionality for cases with task tracking and case details."
}