{
  "backend/main.mo": "Main Motoko actor defining surgery case management system with types (Species, Sex, Task, SurgeryCase), CRUD operations for cases and user profiles, OpenAI configuration, dashboard queries, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting two features: restoring complete project state from Version 67 and removing post-Version 67 AuthProvider/authentication context changes, both with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering App.tsx, hooks, auth components, case management views, forms, validation, search, CSV import/export, and checklist functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, favicon links, manifest reference, Apple touch icon configuration, and script tag loading main.tsx.",
  "frontend/public/manifest.json": "PWA manifest defining SurgiPaw app metadata, standalone display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping caching for Internet Identity and API calls.",
  "frontend/src/App.tsx": "Main React app component with Internet Identity authentication, view routing (dashboard/cases/settings), profile setup modal, admin-only settings access, case navigation, and forced light theme enforcement.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/AuthView.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout, error handling for duplicate authentication, and primary/outline button styling.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, using a form with validation and mutation hook to save the profile.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/features/auth/validation.ts": "Empty file with no content.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with their field mappings, default selections, and utility functions for calculating task completion and styling.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist management, delete confirmation dialog, and progress tracking with color-coded task badges.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog for creating or editing surgery cases with fields for patient info, arrival date, species, breed, and AI-powered structured text parsing to auto-populate form fields.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered, sorted, and searchable surgery cases with controls for species/task filtering, CSV import/export, and case highlighting/scrolling.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for sorting cases by various criteria using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter with checkboxes for filtering cases by species, persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to filter cases by task types and completion status, persisting selections to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist component that displays task items with checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete), with color-coded borders.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for creating or updating cases.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that auto-formats MM/DD/YYYY input, validates dates, and auto-advances to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, parsing fields with validation and matching existing cases by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case import/export, including headers, validation constants, and documentation for date/boolean/enum formats.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, and completion status. Filters cases based on selected species, incomplete tasks, or whether all tasks are completed.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as fallback for cleaning semi-structured AI responses.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields (MRN, pet name, dates, species, etc.). Serves as fallback for AI responses and supports Quick Fill feature.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a PDF report of surgery cases with remaining tasks using browser's native print functionality via a hidden iframe. Creates landscape-oriented HTML table with case details and styling.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of surgery cases including all fields and remaining tasks. Handles CSV field escaping and creates timestamped filename.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display: converts Time (bigint nanoseconds) to MM/DD/YYYY strings, formats Species and Sex enums to readable text, and handles text truncation and task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV reports: converts Time to MM/DD/YYYY strings and formats Species and Sex enums to readable text for CSV export.",
  "frontend/src/features/cases/search.ts": "Implements case-insensitive search across surgery case fields (MRN, names, species, breed, complaint, notes) and remaining checklist tasks. Returns filtered cases matching the query.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely placeholder for AI image analysis service functionality.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases by arrival date (newest/oldest) or open task count (most/fewest). Defines sort options and implements comparison logic.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms: Species and Sex option arrays, and CaseFormData interface with all case fields including dates, patient info, and medical details.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including medical record number, pet name, owner name, breed, species, sex, dates, and booleans with extensive logging and normalization logic.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays a filterable, searchable list of surgery cases with task status indicators, species badges, and navigation to individual cases; includes PDF generation and sorting capabilities.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open tasks from individual cases and calculate total open task counts across all cases using checklist item logic.",
  "frontend/src/features/settings/components/SettingsView.tsx": "Settings page component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, handles actor creation with admin token initialization, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Simple React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on surgery cases, user profiles, and OpenAI configuration, including fetching all cases, creating/updating/deleting cases, and managing task updates with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specific colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, InternetIdentityProvider context, and renders the root App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable library types.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf library types.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library, including worker interfaces, recognition options, and result structures with text, confidence, and bounding box data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular query strings and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, border radius variables, Inter font family, and plugins for animations and typography.",
  "project_state.json": "Project metadata file indicating this is SurgiPaw, an authentication app at version 9 with features to restore project state from version 67 and remove post-v67 AuthProvider changes."
}