{
  "backend/main.mo": "Motoko canister managing surgery cases and user profiles with access control, CRUD operations, and checklist support.",
  "feature_evidence.json": "Feature evidence report linking a UI enhancement request to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of human‑written summaries describing the purpose of all frontend files.",
  "frontend/index.css": "Tailwind base styles defining light and dark OKLCH color variables and global layout rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, profile setup, and rendering the case list UI.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Authentication button toggling Internet Identity login and logout with query cache clearing.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal prompting new users for their name and saving profiles via backend mutation.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist item metadata, default checklist values, and utility to extract remaining tasks.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with highlighted complaint/notes sections, styled checklist badges, and edit/delete actions.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Form dialog component for creating and editing surgery cases, handling field state, validation, and submission mutations.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Displays the list of surgery cases with search, CSV import/export, and a dialog for creating new cases.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component for filtering cases by text query.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Editor UI for toggling checklist boolean fields on a case.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides CSV import/export controls for surgery cases, including file handling and mutation calls.",
  "frontend/src/features/cases/components/DateField.tsx": "Reusable date input component with both text and calendar picker support.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including parsing, validation, and matching existing cases.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines CSV headers and row type for surgery case CSV structure.",
  "frontend/src/features/cases/search.ts": "Search utility that filters cases by matching text, dates, species, sex, and checked checklist items.",
  "frontend/src/features/cases/types.ts": "Defines case form data type and dropdown options for species and sex.",
  "frontend/src/features/cases/validation.ts": "Validation utilities for case fields and date/format helpers including nanosecond conversions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login, logout, and status state.",
  "frontend/src/hooks/useQueries.ts": "React Query wrappers for backend calls such as user profile, cases, and checklist CRUD operations using the actor.",
  "frontend/src/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names with clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App bootstrap that wraps the root component with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, OKLCH color mappings, animations, and plugins.",
  "project_state.json": "Defines current app state, including project version, feature list, architectural notes, and known issues. Describes requirements for case fields, checklist behavior, UI details, and CSV import/export."
}