{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase, Task, and UserProfile types with CRUD operations for veterinary surgery cases, user profiles, and OpenAI configuration; includes authorization mixin with admin/user permission checks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components, hooks, and utilities covering authentication, case management with task tracking, CSV import/export, search/filter functionality, and form validation.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point for SurgiPaw PWA with favicon links, manifest reference, Apple touch icon configuration, and viewport/theme-color meta tags.",
  "frontend/public/manifest.json": "PWA manifest defining SurgiPaw app metadata, standalone display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping Internet Identity/API/extension requests.",
  "frontend/src/App.tsx": "Root application component managing authentication state, view routing (dashboard/cases/settings), profile setup modal, admin-only settings access, case navigation with highlighting, and forced light theme enforcement.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing username/password authentication with mock implementation, session management via localStorage (remember me) or sessionStorage, and login/register/logout methods.",
  "frontend/src/features/auth/components/AuthView.tsx": "Main authentication view component that toggles between login and registration forms, includes header with logo and footer with attribution.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/features/auth/components/LoginForm.tsx": "Login form component with username/password inputs, remember-me checkbox, validation, and loading states that calls the auth context login method.",
  "frontend/src/features/auth/components/LogoutButton.tsx": "Logout button component that displays username and triggers logout with query cache clearing.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for initial profile setup that prompts users to enter their name after registration.",
  "frontend/src/features/auth/components/RegistrationForm.tsx": "Registration form component with username, password, and confirm password fields that validates inputs and calls the auth context register method.",
  "frontend/src/features/auth/validation.ts": "Validation utilities for username (3-30 chars), password (min 8 chars), and password matching with typed validation results.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with configuration, default selections, and utility functions for calculating task completion and styling.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Surgery case card component displaying patient info, editable notes, task checklist with completion tracking, and delete functionality with confirmation dialog.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog component for creating and editing surgery cases with form fields for patient/owner details, AI-powered structured text parsing, checklist task selection, and auto-prefill from matched medical record numbers.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main list view component that displays filtered and sorted surgery cases with search, species/task filters, CSV import/export, and handles case selection with scroll-to and highlight animations.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with clear button for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing case sorting options (e.g., arrival date, pet name).",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter component with checkboxes for filtering cases by species (canine, feline, etc.) with session storage persistence.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "Popover filter component for filtering cases by incomplete task types and toggling visibility of completed cases, with session storage persistence.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Reusable checklist component that supports both creation mode (selecting which tasks to track) and completion mode (marking tasks as done) with color-coded task items.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "React component providing CSV import/export UI for surgery cases with progress tracking, error display, and batch create/update operations using mutations.",
  "frontend/src/features/cases/components/DateField.tsx": "Custom date input component with calendar picker that auto-formats MM/DD/YYYY input, validates dates, and supports auto-advance to next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that parses CSV files into surgery case data, validates fields, handles existing case updates, and generates downloadable CSV exports.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the 17-column CSV schema for surgery cases including headers, field descriptions, validation constants for species/sex/boolean values, and date format regex.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species, task types, task completion status, and whether all selected tasks are completed.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l), and removing artifacts as fallback for AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses semi-structured text with label:value pairs into CaseFormData fields, handling species, sex, dates, and string fields with regex pattern matching as AI/Quick Fill fallback.",
  "frontend/src/features/cases/pdf/generateCasePdf.ts": "Generates a printable PDF report of surgery cases using a hidden iframe and browser's native print functionality. Creates an HTML table with case details and remaining tasks, styled for landscape printing.",
  "frontend/src/features/cases/pdf/generateCaseReport.ts": "Generates and downloads a CSV report of surgery cases with remaining tasks. Handles CSV field escaping and creates a timestamped filename for download.",
  "frontend/src/features/cases/pdf/pdfFormatters.ts": "Provides formatting utilities for PDF display: converts Time (bigint nanoseconds) to MM/DD/YYYY strings, formats Species and Sex enums to readable text, and handles task list formatting.",
  "frontend/src/features/cases/pdf/reportFormatters.ts": "Provides formatting utilities for CSV reports: converts Time to date strings, and formats Species and Sex enums to readable text for CSV export.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query against basic fields (MRN, pet name, owner, species, etc.) and remaining checklist task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file, likely a placeholder for future AI image analysis service implementation.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with four options: arrival date (newest/oldest) and open tasks count (most/fewest).",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms, including Species and Sex option arrays and the CaseFormData interface.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including MRN, pet name, owner name, breed, species, sex, dates, and booleans with flexible string matching.",
  "frontend/src/features/dashboard/components/DashboardView.tsx": "Main dashboard component that displays surgery cases with filtering, searching, sorting, and PDF export capabilities. Shows case cards with task badges and provides navigation to individual cases.",
  "frontend/src/features/dashboard/utils/openTasksCalculation.ts": "Utility functions to extract open tasks from surgery cases and calculate total open task counts across multiple cases.",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for managing application settings, specifically OpenAI API key configuration with validation status display, secure input field with show/hide toggle, and save functionality using custom hooks.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on surgery cases, user profiles, tasks, and OpenAI configuration, using the actor hook to interact with the backend canister.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme for the application, including specialized colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge CSS class names with proper Tailwind class precedence.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty TypeScript declaration file for jspdf-autotable module types.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf module types.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for tesseract.js OCR library, including Worker interface, recognition options, result structures with text blocks/lines/words, and PSM/OEM enums.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended font families, border radius variables, and plugins for animations and typography.",
  "project_state.json": "Project state tracking file documenting an authentication app with known AuthProvider context wrapping issues in production builds and pending architectural fixes."
}