{
  "backend/main.mo": "Main actor defining surgery case management system with CRUD operations for cases, user profiles, and OpenAI config; includes authorization mixin, task management with seven task types (discharge notes, PDVM notified, labs, histo, surgery report, imaging, culture), and migration support.",
  "backend/migration.mo": "Migration module defining type aliases for SurgeryCase, Task, UserProfile, and OpenAIConfig; provides identity migration function that preserves existing actor state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: removing grey box from species field, moving task list below notes, adding task edit functionality, and adding purple/blue colored boxes around histo/imaging tasks with proper alignment.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React components covering authentication, case management, form validation, CSV import/export, checklist editing with creation/completion modes, and task management with colored highlighting for histo (purple) and imaging (blue).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for backgrounds, foregrounds, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for Surgery Case Log PWA with favicon links, manifest reference, apple-touch-icon configuration, and light color scheme meta tags.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons (192x192 and 512x512), standalone display mode, blue theme color, and medical/productivity categories.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping caching for Internet Identity flows and API calls.",
  "frontend/src/App.tsx": "Main application component that handles authentication, profile setup, and view routing between cases and settings. Enforces light theme and displays loading/error states with retry logic.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component for Internet Identity login/logout that handles authentication state and clears query cache on logout.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves it to their profile using the backend mutation.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, histo, etc.) with default selections and provides utility functions to calculate task completion and remaining items.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file for camera capture modal component (not yet implemented).",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with editable notes, task checklist, and delete functionality. Handles inline editing and task completion updates.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, arrival date, and task selection. Includes AI-powered structured text parsing and auto-prefill from matched MRN.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases with search, filtering by species/tasks, sorting, and CSV import/export. Manages case creation and editing dialogs.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field text.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sort order using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for selecting species with checkboxes, persisting selections to sessionStorage and displaying an active filter count badge.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for selecting task types from a checklist, persisting selections to sessionStorage and showing an active filter count badge.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that supports both creation mode (selecting tasks to include) and completion mode (marking tasks as done), with special styling for histology and imaging items.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for both creating new cases and updating existing ones by medical record number.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that formats dates as MM/DD/YYYY, auto-inserts slashes during typing, validates input, and supports auto-advancing to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "CSV import/export utilities for surgery cases, handling parsing, validation, date conversion, and matching existing cases by medical record number with detailed error reporting.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema for veterinary surgery case import/export with 17 columns including medical record, dates, pet/owner info, species, sex, and checklist items. Exports constants for headers, validation values (species, sex, boolean formats), and TypeScript types for CSV rows.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions for surgery cases by species and task types. Filters cases by selected species or by incomplete tasks from the checklist.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts. Used as fallback for cleaning semi-structured text when AI returns non-JSON responses.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields (medical record, pet name, dates, species, sex, breed, etc.). Serves as fallback for AI responses and supports Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by query string across basic fields (medical record, pet name, owner, species, breed, sex, complaint, notes) and checklist items that are selected but not completed.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file for AI image analysis service (no content provided).",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases with four options: arrival date (newest/oldest) and open tasks count (most/fewest). Exports sort options and sortCases function.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms including species options (canine, feline, other), sex options (male, neutered, female, spayed), and CaseFormData interface with all required case fields.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including medical record number, pet name, owner name, breed, species, sex, dates, and booleans. Includes normalization logic for flexible input formats.",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for application settings page that allows users to configure OpenAI API key for AI-powered document scanning. Displays configuration status, provides secure input with show/hide toggle, and handles saving with validation feedback.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance using Internet Identity authentication, initializing access control with an admin token from URL parameters and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence in local storage, and delegation validity checking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on surgery cases including fetching all cases, fetching by MRN, creating, updating, and deleting cases with automatic query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including specialized colors for patient names, species fields, presenting complaints, and notes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for the Tesseract.js OCR library, including worker interfaces, recognition results, and configuration options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and secure parameter clearing capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color variables, Inter font family, and plugins for animations and typography.",
  "project_state.json": "Project state tracking six features related to case card UI refinements: removing grey box from species field, repositioning task list, adding edit functionality for tasks, and adding colored boxes (purple for histo, blue for imaging) around specific task items while maintaining checkbox alignment."
}