{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase data types (with Task checklist fields), user profiles, OpenAI config, and CRUD operations for cases with role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting five UI enhancements to CaseCard.tsx: colored borders for notes (green), presenting complaint (orange), Histo task (purple), Imaging task (blue), and species badge display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components covering authentication, case management, CSV import/export, task checklists, search/filter, and form validation with Task type usage.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for backgrounds, borders, charts, sidebar, and other UI elements using oklch color space.",
  "frontend/index.html": "HTML entry point for Surgery Case Log app with PWA manifest, favicons, theme color, and viewport meta tags configured for light mode.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata (name, icons, theme colors, display mode) for Surgery Case Log as a standalone medical/productivity application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell, excluding Internet Identity and API calls from caching, with runtime cache management.",
  "frontend/src/App.tsx": "Root React component managing authentication flow with Internet Identity, actor initialization, profile setup modal, view switching between cases and settings, admin-only settings access, and forced light theme enforcement.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication, handles login state transitions, and clears the query cache on logout.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup, preventing dismissal until completed.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, labs, imaging, etc.) with their default states and provides utility functions to calculate task completion status and filter remaining items.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file with no content.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a surgery case card with patient details, remaining checklist tasks with checkboxes, editable notes, and delete/edit actions with confirmation dialog.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, arrival date, checklist task selection, AI-powered structured text parsing, and MRN-based auto-prefill from existing cases.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays a filterable, searchable, sortable list of surgery case cards with CSV import/export and create/edit functionality.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field text.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select control for choosing case sort order from predefined options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "Popover filter with checkboxes for filtering cases by species (canine, feline, etc.), persisting selections to session storage.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component that allows users to select task types to filter surgery cases by incomplete tasks, with state persisted to session storage.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that displays task items as checkboxes, supporting both creation mode (selecting tasks) and completion mode (marking tasks complete).",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, with progress tracking, error handling, and support for creating or updating cases.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input field component with calendar picker that accepts MM/DD/YYYY format, auto-formats input, validates dates, and supports auto-advancing to next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Core CSV import/export logic that converts surgery cases to/from CSV format, parses CSV rows with validation, and matches imported cases to existing records by medical record number.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case import/export, including header names, data types, validation constants, and field mapping documentation.",
  "frontend/src/features/cases/filtering.ts": "Provides filtering functions to filter surgery cases by species and by incomplete task types based on checklist item selections.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), removing artifacts, and cleaning punctuation. Used as a fallback for text cleaning when AI analysis returns semi-structured text.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format to extract case information fields (MRN, pet name, owner, dates, species, sex, breed, complaint) into a CaseFormData object. Serves as fallback for AI responses and supports Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Filters surgery cases by query string, searching across basic fields (MRN, names, species, breed, complaint, notes) and checklist task items that are selected but not completed.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file for AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Provides sorting functionality for surgery cases by arrival date (newest/oldest) or open task count (most/fewest), with predefined sort options.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case form data, including species options (canine, feline, other) and sex options (male, female, neutered/spayed variants).",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validation, species/sex parsing with fuzzy matching, boolean parsing, and date validation/parsing.",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a changing value with configurable delay (default 500ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, updating, and deleting cases with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue color scheme using OKLCH color space, including theme tokens for UI components and specific colors for patient names and presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library, including worker interfaces, recognition options, result structures, and enums for page segmentation and OCR engine modes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking five implemented features that add colored borders around patient card fields (notes, Histo task, Imaging task, presenting complaint) and a species badge below the medical record number. Contains one pending aggregated requirement (AR-1) encompassing all these visual enhancements."
}