{
  "backend/main.mo": "Main actor defining SurgeryCase with Task type (separate selected/completed fields for 7 tasks), user profiles, OpenAI config, and CRUD operations with authorization checks via MixinAuthorization.",
  "backend/migration.mo": "Migration module that transforms OldSurgeryCase with CompletedTasks to NewSurgeryCase with Task type, setting all tasks as selected by default and preserving completion status.",
  "feature_evidence.json": "Feature evidence report documenting three features: task selection workflow fix, default task checkbox states, and MM/DD/YYYY date formatting with auto-advance behavior.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React components covering authentication, case management, task handling with Task type, CSV import/export, date fields with auto-advance, and checklist editing in creation/completion modes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA metadata, favicon links, manifest reference, and root div for React mounting; sets light color scheme and Surgery Case Log title.",
  "frontend/public/manifest.json": "PWA manifest defining Surgery Case Log app metadata, icons, display mode (standalone), theme colors, and categorization as medical/productivity/business application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, precaching app shell on install, cleaning old caches on activate, and skipping authentication/API calls from caching.",
  "frontend/src/App.tsx": "Main application component that handles authentication flow, profile setup, and view routing between cases and settings. Includes defensive logic to prevent dark mode and retry mechanism for authentication failures.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Button component for Internet Identity authentication that handles login/logout actions and clears query cache on logout. Includes error recovery for duplicate authentication attempts.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that prompts for name entry. Cannot be dismissed until profile is created.",
  "frontend/src/features/cases/checklist.ts": "Defines checklist items (discharge notes, pDVM notification, labs, etc.) with default selections and provides utility functions to calculate task completion status and filter remaining items.",
  "frontend/src/features/cases/components/CameraCaptureModal.tsx": "Empty file for camera capture modal component (not yet implemented).",
  "frontend/src/features/cases/components/CaseCard.tsx": "Card component displaying individual surgery case details with expandable notes, task checklist toggles, edit/delete actions, and formatted date displays. Includes delete confirmation dialog.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Dialog form for creating/editing surgery cases with fields for patient info, dates, and task checklist. Includes AI-powered structured text parsing, auto-prefill from matched MRN, and field-level edit tracking.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component for displaying surgery cases list with search, sort, species/task filters, and CSV import/export. Shows filtered count and handles case creation/editing through dialog.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon for filtering cases by any field.",
  "frontend/src/features/cases/components/CasesSortControl.tsx": "Dropdown select component for choosing case sort order using predefined sort options.",
  "frontend/src/features/cases/components/CasesSpeciesFilter.tsx": "A popover filter component for selecting species (canine, feline, other) with checkboxes, persisting selections to sessionStorage and displaying an active filter count badge.",
  "frontend/src/features/cases/components/CasesTasksFilter.tsx": "A popover filter component for selecting task types from a checklist, persisting selections to sessionStorage and showing an active count badge on the trigger button.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "A checklist editor component that renders checkboxes for task items, supporting both creation mode (selecting tasks to assign) and completion mode (marking tasks as done).",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "A panel component providing CSV export and import functionality for surgery cases, handling file parsing, validation errors, progress tracking, and backend mutations with toast notifications.",
  "frontend/src/features/cases/components/DateField.tsx": "A date input component with calendar picker that formats dates as MM/DD/YYYY, auto-inserts slashes during typing, validates input on blur, and optionally auto-advances to the next field on completion.",
  "frontend/src/features/cases/csv/caseCsv.ts": "CSV import/export logic for surgery cases, including parsing CSV rows with quoted field handling, validating data, matching existing cases by medical record number, and generating downloadable CSV files.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV schema with 17 columns for surgery case import/export, including header names, validation constants for species/sex/boolean values, and documentation of expected formats and field mappings.",
  "frontend/src/features/cases/filtering.ts": "Provides functions to filter surgery cases by species and by incomplete task types using checklist item definitions.",
  "frontend/src/features/cases/parsing/parseOcrText.ts": "Preprocesses raw OCR text by normalizing whitespace, correcting common character recognition errors (O/0, I/1/l confusion), and removing artifacts; serves as fallback for AI analysis.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses label:value formatted text into CaseFormData by matching field patterns and applying type-specific parsing (species, sex, dates); serves as fallback for AI responses and Quick Fill feature.",
  "frontend/src/features/cases/search.ts": "Searches surgery cases by matching query against basic fields (MRN, pet name, owner, species, breed, sex, complaint, notes) and incomplete task labels.",
  "frontend/src/features/cases/services/aiImageAnalysis.ts": "Empty file placeholder for AI image analysis service.",
  "frontend/src/features/cases/sorting.ts": "Sorts surgery cases by arrival date (newest/oldest) or open task count (most/fewest) with predefined sort options.",
  "frontend/src/features/cases/types.ts": "Defines CaseFormData interface and constant options for species (canine, feline, other) and sex (male, male neutered, female, female spayed).",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required string fields, species/sex parsing with fuzzy matching, boolean parsing, and date validation.",
  "frontend/src/features/settings/components/SettingsView.tsx": "React component for configuring OpenAI API key with validation status display, secure input field with show/hide toggle, and save functionality using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a changing value with configurable delay (default 500ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on surgery cases, including fetching all cases, fetching by MRN, creating, updating, and deleting cases with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue theme with OKLCH color tokens for UI components, patient names, and presenting complaints.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/types/tesseract.d.ts": "TypeScript type definitions for Tesseract.js OCR library, including worker creation, recognition options, and result structures with text, confidence, and bounding box data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH, container settings, border radius variables, Inter font family, and accordion animations.",
  "project_state.json": "Project state for a veterinary case management system tracking three feature requests: fixing task selection workflow from case creation to case cards, implementing default checkbox states for seven task types, and formatting date fields with MM/DD/YYYY format and auto-advance behavior."
}