{
  "backend/main.mo": "Main Motoko actor defining SurgeryCase data types (species, sex, checklist), user profiles, and CRUD operations with authorization checks; includes case creation, retrieval, search by owner/MRN, updates, and checklist management.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for displaying the logo image (image-1.png) in the header, landing page, and as favicon with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components for authentication, case management, CSV import/export, search, validation, and UI elements with logo integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, borders, and component-specific tokens.",
  "frontend/index.html": "HTML entry point with light color scheme, title 'Surgery Case Log', and favicon links to generated PNG assets at multiple sizes (16x16, 32x32, 192x192, 512x512).",
  "frontend/src/App.tsx": "Main React app component managing authentication flow with Internet Identity, profile setup modal, and cases list view; displays logo in header and landing page, enforces light theme, and includes loading states.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and disabled state during authentication process.",
  "frontend/src/features/auth/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup prompting for name input with form validation and toast notifications.",
  "frontend/src/features/cases/checklist.ts": "Checklist configuration defining seven items (discharge notes, pDVM notified, labs, histo, surgery report, imaging, culture) with default states and utility functions for default checklist and remaining items.",
  "frontend/src/features/cases/components/CaseCard.tsx": "Displays a single surgery case as a card with patient details, checklist tasks, and action buttons (edit, delete). Handles task completion and case deletion with confirmation dialogs.",
  "frontend/src/features/cases/components/CaseFormDialog.tsx": "Modal dialog for creating or editing surgery cases with form fields, AI-powered structured text parsing, MRN-based auto-prefill, and checklist editing. Tracks user-edited fields to avoid overwriting manual changes.",
  "frontend/src/features/cases/components/CasesListView.tsx": "Main view component that displays all surgery cases in a grid layout with search functionality, CSV import/export panel, and a button to create new cases.",
  "frontend/src/features/cases/components/CasesSearchBar.tsx": "Search input component with icon that allows filtering cases by any field value.",
  "frontend/src/features/cases/components/ChecklistEditor.tsx": "Renders a list of checkboxes for surgery case checklist items, allowing users to toggle task completion status.",
  "frontend/src/features/cases/components/CsvImportExportPanel.tsx": "Provides buttons to export cases to CSV and import cases from CSV files, handling file selection, parsing, and batch create/update operations.",
  "frontend/src/features/cases/components/DateField.tsx": "Date input component combining a native date input with a calendar popover picker, handling date formatting and validation in YYYY-MM-DD format.",
  "frontend/src/features/cases/csv/caseCsv.ts": "Implements CSV export and import logic for surgery cases, including row parsing, validation, date conversion, and matching with existing cases by MRN.",
  "frontend/src/features/cases/csv/caseCsvSchema.ts": "Defines the CSV column headers and TypeScript type for CSV row structure used in import/export operations.",
  "frontend/src/features/cases/parsing/parseStructuredText.ts": "Parses structured text in label:value format (e.g., 'MRN: 12345') to extract case information fields like medical record number, dates, pet/owner names, species, sex, breed, and presenting complaint into a partial CaseFormData object.",
  "frontend/src/features/cases/search.ts": "Implements case search functionality that filters surgery cases by matching query text against multiple fields including medical record number, pet/owner names, breed, species, sex, dates, notes, and checklist items.",
  "frontend/src/features/cases/types.ts": "Defines TypeScript types and constants for case forms, including SPECIES_OPTIONS (canine/feline/other), SEX_OPTIONS (male/female with neutered/spayed variants), and the CaseFormData interface with all case fields.",
  "frontend/src/features/cases/validation.ts": "Provides validation and parsing functions for case form fields including required field validators, species/sex parsers with fuzzy matching, date parsing for multiple formats (ISO, US, EU), and date formatting utilities.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state, initializing access control with admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a changing value with a configurable delay (default 500ms), useful for optimizing search inputs and other frequently updating values.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence in local storage, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profile management (get/save), case CRUD operations (get all, get by MRN, create, update, delete), with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light blue theme with white surfaces, including colors for backgrounds, text, borders, charts, patient names (blue), and presenting complaints (orange).",
  "frontend/src/lib/utils.ts": "Utility function 'cn' that combines clsx and tailwind-merge to merge CSS class names with proper Tailwind class precedence handling.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient provider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, and animation plugins.",
  "project_state.json": "Project state tracking file documenting feature requests to add a logo (image-1.png) to the header, landing page, and as favicon, with requirements for multiple favicon sizes."
}