{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add task checklist selection during case creation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add checkboxes to the case creation form for seven task items with default states",
      "acceptanceCriteria": [
        "Case creation form displays all seven task checkboxes",
        "Discharge Notes and pDVM Notified are checked by default",
        "Labs, Histo, Surgery Report, Imaging, and Culture are unchecked by default",
        "User can toggle any checkbox before submitting the case"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Add ChecklistEditor component to the case creation/edit form. Initialize completedTasks state with default values (dischargeNotes: false, pdvmNotified: false, labs: false, histo: false, surgeryReport: false, imaging: false, culture: false). Pass completedTasks and onChange handler to ChecklistEditor. Ensure the completedTasks data is included when calling createCase or updateCase mutations."
        },
        {
          "path": "frontend/src/features/cases/components/ChecklistEditor.tsx",
          "operation": "modify",
          "description": "Update ChecklistEditor to accept an optional 'mode' prop that distinguishes between 'creation' and 'completion' modes. In 'creation' mode, display checkboxes for selecting which tasks to include in the case (default unchecked state). In 'completion' mode (default), use existing behavior for marking tasks as complete. Update checkbox labels and help text accordingly. Remove the disabled prop requirement for creation mode."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Store only the tasks that were checked during case creation in the case data structure",
      "acceptanceCriteria": [
        "Backend SurgeryCase type stores only the selected tasks",
        "Unchecked tasks during creation are not stored in the case",
        "Selected tasks are persisted correctly when creating a new case"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Transform the completedTasks object before sending to backend. Filter out tasks that were not selected during creation (set their values to exclude them from the stored structure). Ensure the createCase mutation receives only the selected tasks in the completedTasks parameter."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display only the tasks that were selected during case creation on the case card as open checkboxes that can be marked as complete",
      "acceptanceCriteria": [
        "Case card shows only the tasks that were selected during creation",
        "Each displayed task appears as an unchecked checkbox initially",
        "Tasks not selected during creation do not appear on the case card",
        "Users can check off tasks as they complete them"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Update the checklist rendering logic to only display tasks that exist in the case's completedTasks object (were selected during creation). Filter the checklist items to show only those present in the case data. Ensure the completion checkboxes continue to work for the filtered list of tasks."
        },
        {
          "path": "frontend/src/features/cases/checklist.ts",
          "operation": "modify",
          "description": "Add a utility function to get only the selected checklist items from a CompletedTasks object. This function should return an array of ChecklistItem objects that correspond to tasks that were selected during case creation (exist in the completedTasks structure). Update getRemainingItems to work with filtered task lists."
        }
      ]
    }
  ]
}