{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default sort by Arrival Date and increase MRN font size",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Set default sort order to Arrival Date (Oldest First) on Dashboard page while preserving manual sort control",
      "acceptanceCriteria": [
        "Dashboard displays cases sorted by Arrival Date (Oldest First) on initial page load",
        "Users can still manually change the sort order using the existing sort control",
        "Manual sort selections persist during the session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Update the default sortOption state initialization from 'arrivalDateDesc' to 'arrivalDateAsc' so cases are sorted by Arrival Date (Oldest First) when the Dashboard page loads. The existing CasesSortControl component and manual sort functionality remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Set default sort order to Arrival Date (Oldest First) on Cases page while preserving manual sort control",
      "acceptanceCriteria": [
        "Cases page displays cases sorted by Arrival Date (Oldest First) on initial page load",
        "Users can still manually change the sort order using the existing sort control",
        "Manual sort selections persist during the session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Update the default sortOption state initialization from 'arrivalDateDesc' to 'arrivalDateAsc' so cases are sorted by Arrival Date (Oldest First) when the Cases page loads. The existing CasesSortControl component and manual sort functionality remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Increase the font size of the MRN field in case cards on the Dashboard page",
      "acceptanceCriteria": [
        "MRN text is visibly larger and more prominent in Dashboard case cards",
        "Font size increase is consistent across all case cards",
        "Visual hierarchy remains balanced with other case information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/components/DashboardView.tsx",
          "operation": "modify",
          "description": "Increase the MRN font size in the case card rendering by changing the text size class from 'text-sm' to 'text-lg' for the medicalRecordNumber display. Ensure the change applies to all case cards rendered in the grid."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Increase the font size of the MRN field in case list items on the Cases page",
      "acceptanceCriteria": [
        "MRN text is visibly larger and more prominent in Cases page list items",
        "Font size increase matches the Dashboard implementation",
        "Visual hierarchy remains balanced with other case information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Increase the MRN font size in the CaseCard component by changing the text size class from 'text-sm' to 'text-lg' for the medicalRecordNumber display in the card header. This component is used by both Dashboard and Cases pages, ensuring consistency."
        }
      ]
    }
  ]
}