{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enhance Quick Fill with placeholder guide and automatic field extraction from voice",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add placeholder text to Quick Fill text box displaying field names as a guide",
      "acceptanceCriteria": [
        "The Quick Fill text box shows placeholder text listing all nine field names when empty",
        "Placeholder text disappears when user begins typing or voice recording populates the field",
        "Placeholder text is visually distinct (e.g., lighter gray) from actual input text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Add placeholder attribute to the Quick Fill textarea displaying the nine field names: 'Medical Record number, Arrival Date, Pet Name, Owner Last Name, Species, Breed, Sex, Date of Birth, Presenting Complaint'. Ensure placeholder is styled with lighter text color to distinguish from actual input and is automatically hidden when the field contains text or receives voice transcription input."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement automatic parsing of voice recording to extract structured veterinary case fields and populate form",
      "acceptanceCriteria": [
        "After voice recording completes, the system automatically parses the transcribed text to identify the nine specified fields",
        "Successfully extracted field values are populated into their corresponding form fields (MRN, arrival date, pet name, owner last name, species, breed, sex, date of birth, presenting complaint)",
        "Parsing handles variations in how users dictate field names (e.g., 'MRN', 'Medical Record Number', 'Record Number')",
        "Any fields that cannot be extracted remain empty and can be manually filled",
        "The Quick Fill text box retains the full transcribed text for user reference"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseFormDialog.tsx",
          "operation": "modify",
          "description": "Wire the voice recording completion handler to automatically trigger parseStructuredText on the transcribed text. After parsing, populate the extracted field values into their corresponding form state fields while keeping the full transcription in the Quick Fill textarea for user reference. Ensure the parsing is called immediately after speech recognition returns the final transcript."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enhance parseStructuredText function to recognize and extract nine veterinary case fields with improved voice dictation pattern matching",
      "acceptanceCriteria": [
        "The parseStructuredText function successfully extracts all nine fields from voice-transcribed text",
        "Pattern matching handles common voice dictation variations and synonyms for each field name",
        "Existing Quick Fill functionality continues to work with manually typed text",
        "Field extraction works with both structured (label:value) and natural speech patterns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/parsing/parseStructuredText.ts",
          "operation": "modify",
          "description": "Enhance field extraction patterns to handle voice dictation variations and synonyms for all nine fields: Medical Record number (MRN, record number, medical record), Arrival Date (arrival, admit date, admission date), Pet Name (pet, patient name, animal name), Owner Last Name (owner, last name, surname), Species (canine, feline, dog, cat, other), Breed, Sex (male, female, neutered, spayed, intact), Date of Birth (DOB, birth date, birthday), and Presenting Complaint (complaint, chief complaint, reason for visit). Add case-insensitive regex patterns that match common voice-dictated phrasings and handle both 'label: value' and natural language formats (e.g., 'the pet name is Buddy'). Preserve existing structured text parsing behavior for backward compatibility."
        }
      ]
    }
  ]
}