{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add sorting for case cards by arrival date and task status",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a sorting control UI component to the CasesListView that allows users to select sort order with options: 'Arrival Date (Newest First)', 'Arrival Date (Oldest First)', 'Open Tasks (Most First)', and 'Open Tasks (Fewest First)'",
      "acceptanceCriteria": [
        "A visible sort dropdown or button group appears above the case cards grid",
        "Users can select between at least 4 sorting options",
        "The selected sort option persists visually while active"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CasesSortControl.tsx",
          "operation": "create",
          "description": "Create a sorting control component using shadcn/ui Select component. Provide four sort options: 'Arrival Date (Newest First)', 'Arrival Date (Oldest First)', 'Open Tasks (Most First)', and 'Open Tasks (Fewest First)'. Accept onSortChange callback prop and current sortBy value prop. Use consistent styling with the existing search bar component."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Add the CasesSortControl component above the case cards grid, positioned next to the existing CasesSearchBar. Add state to track the current sort selection. Wire the sort control's callback to update the sort state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement sorting logic that reorders the displayed case cards based on the selected sort option, using the arrivalDate field for date sorting and counting uncompleted checklist items for task status sorting",
      "acceptanceCriteria": [
        "Cases sort correctly by arrival date in ascending and descending order",
        "Cases sort correctly by number of open (uncompleted) checklist tasks in ascending and descending order",
        "Sorting updates immediately when the user changes the selection",
        "Sorting works correctly with the existing search filter"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/sorting.ts",
          "operation": "create",
          "description": "Create sorting utility functions. Define a SortOption type with values 'arrival-date-newest', 'arrival-date-oldest', 'open-tasks-most', 'open-tasks-fewest'. Implement a sortCases function that accepts an array of SurgeryCase objects and a SortOption, returning a sorted array. For arrival date sorting, compare arrivalDate timestamps. For task status sorting, count uncompleted checklist items using the getRemainingChecklistItems function from frontend/src/features/cases/checklist.ts and compare counts. Use stable sorting to maintain relative order for equal values."
        },
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Import the sortCases function from frontend/src/features/cases/sorting.ts. Apply sorting after search filtering but before rendering the case cards grid. Pass the filtered cases and the current sort state to sortCases and use the sorted result for rendering. Ensure sorting updates immediately when the sort selection changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the sorting persists when users perform other actions like searching, creating new cases, updating cases, or toggling checklist items",
      "acceptanceCriteria": [
        "The selected sort order remains active after search queries change",
        "Cases automatically re-sort when checklist items are toggled",
        "New cases appear in the correct sorted position",
        "Updated cases move to the correct sorted position"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CasesListView.tsx",
          "operation": "modify",
          "description": "Ensure the sort state is maintained independently from search state. When cases data is refetched due to mutations (create, update, delete, checklist toggle), reapply the current sort order to the updated case list. The sorting logic should run whenever the cases data changes or when the sort selection changes, ensuring cases always appear in the correct sorted position."
        }
      ]
    }
  ]
}