{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add colored boxes and species badge to patient card",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add colored border around notes field and make it always visible",
      "acceptanceCriteria": [
        "Notes field has a visible colored border",
        "Notes field is always expanded and visible on the patient card",
        "Notes field is visually distinct from other fields"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Remove collapsible/expandable behavior from notes field and add a colored border (e.g., border-2 border-blue-500) to make the notes field always visible and stand out. Update the rendering logic to display notes directly without the Collapsible wrapper."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add purple colored border around Histo task in checklist",
      "acceptanceCriteria": [
        "Histo task has a purple border when displayed in the patient card",
        "Purple color is clearly distinguishable from other task colors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Add conditional styling logic to apply a purple border (e.g., border-2 border-purple-500) around the Histo (histopathology) task item when it is rendered in the checklist section of the patient card."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add blue colored border around Imaging task in checklist",
      "acceptanceCriteria": [
        "Imaging task has a blue border when displayed in the patient card",
        "Blue color is clearly distinguishable from other task colors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Add conditional styling logic to apply a blue border (e.g., border-2 border-blue-600) around the Imaging task item when it is rendered in the checklist section of the patient card."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add orange colored border around presenting complaint field",
      "acceptanceCriteria": [
        "Presenting complaint field has an orange border",
        "Orange color is clearly distinguishable from other field colors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Add an orange colored border (e.g., border-2 border-orange-500) to the presenting complaint field display section to make it visually distinct from other fields on the patient card."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add species badge below medical record number field",
      "acceptanceCriteria": [
        "Species is displayed in a rounded badge-style box",
        "Species badge appears directly below the medical record number",
        "Badge has rounded corners and stands out visually"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cases/components/CaseCard.tsx",
          "operation": "modify",
          "description": "Add a rounded badge component displaying the species information positioned directly below the medical record number field. Use Tailwind classes like 'rounded-full px-3 py-1 text-sm font-medium' with appropriate background color to create a visually distinct badge with rounded corners."
        }
      ]
    }
  ]
}